min_caml_start:
	li	$gp, 3124
	li	$0, 0
	li	$1, 1
	li	$2, 2
	li	$3, 3
	li	$4, 4
	li	$5, 5
	li	$6, 255
	li	$7, -1
	lui.s	$f0, 0x0	# 0.000000の上位16ビット
	li	$8, 0
	li	$9, 32
	sw	$8, 0($9)
	li	$8, 36
	li	$9, 0
	li	$10, 0
	li	$11, 0
	li	$12, 0
	li	$13, 0
	li	$14, 36
	sw	$8, 40($14)
	sw	$8, 36($14)
	sw	$8, 32($14)
	sw	$8, 28($14)
	sw	$13, 24($14)
	sw	$8, 20($14)
	sw	$8, 16($14)
	sw	$12, 12($14)
	sw	$11, 8($14)
	sw	$10, 4($14)
	sw	$9, 0($14)
	li	$8, 36
	li	$9, 80
	sw	$8, 236($9)
	sw	$8, 232($9)
	sw	$8, 228($9)
	sw	$8, 224($9)
	sw	$8, 220($9)
	sw	$8, 216($9)
	sw	$8, 212($9)
	sw	$8, 208($9)
	sw	$8, 204($9)
	sw	$8, 200($9)
	sw	$8, 196($9)
	sw	$8, 192($9)
	sw	$8, 188($9)
	sw	$8, 184($9)
	sw	$8, 180($9)
	sw	$8, 176($9)
	sw	$8, 172($9)
	sw	$8, 168($9)
	sw	$8, 164($9)
	sw	$8, 160($9)
	sw	$8, 156($9)
	sw	$8, 152($9)
	sw	$8, 148($9)
	sw	$8, 144($9)
	sw	$8, 140($9)
	sw	$8, 136($9)
	sw	$8, 132($9)
	sw	$8, 128($9)
	sw	$8, 124($9)
	sw	$8, 120($9)
	sw	$8, 116($9)
	sw	$8, 112($9)
	sw	$8, 108($9)
	sw	$8, 104($9)
	sw	$8, 100($9)
	sw	$8, 96($9)
	sw	$8, 92($9)
	sw	$8, 88($9)
	sw	$8, 84($9)
	sw	$8, 80($9)
	sw	$8, 76($9)
	sw	$8, 72($9)
	sw	$8, 68($9)
	sw	$8, 64($9)
	sw	$8, 60($9)
	sw	$8, 56($9)
	sw	$8, 52($9)
	sw	$8, 48($9)
	sw	$8, 44($9)
	sw	$8, 40($9)
	sw	$8, 36($9)
	sw	$8, 32($9)
	sw	$8, 28($9)
	sw	$8, 24($9)
	sw	$8, 20($9)
	sw	$8, 16($9)
	sw	$8, 12($9)
	sw	$8, 8($9)
	sw	$8, 4($9)
	sw	$8, 0($9)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 320
	sw.s	$f1, 8($8)
	sw.s	$f1, 4($8)
	sw.s	$f1, 0($8)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 332
	sw.s	$f1, 8($8)
	sw.s	$f1, 4($8)
	sw.s	$f1, 0($8)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 344
	sw.s	$f1, 8($8)
	sw.s	$f1, 4($8)
	sw.s	$f1, 0($8)
	lui.s	$f1, 0x437f	# 255.000000の上位16ビット
	li	$8, 356
	sw.s	$f1, 0($8)
	li	$8, -1
	li	$9, 360
	sw	$8, 0($9)
	li	$8, 360
	li	$9, 364
	sw	$8, 196($9)
	sw	$8, 192($9)
	sw	$8, 188($9)
	sw	$8, 184($9)
	sw	$8, 180($9)
	sw	$8, 176($9)
	sw	$8, 172($9)
	sw	$8, 168($9)
	sw	$8, 164($9)
	sw	$8, 160($9)
	sw	$8, 156($9)
	sw	$8, 152($9)
	sw	$8, 148($9)
	sw	$8, 144($9)
	sw	$8, 140($9)
	sw	$8, 136($9)
	sw	$8, 132($9)
	sw	$8, 128($9)
	sw	$8, 124($9)
	sw	$8, 120($9)
	sw	$8, 116($9)
	sw	$8, 112($9)
	sw	$8, 108($9)
	sw	$8, 104($9)
	sw	$8, 100($9)
	sw	$8, 96($9)
	sw	$8, 92($9)
	sw	$8, 88($9)
	sw	$8, 84($9)
	sw	$8, 80($9)
	sw	$8, 76($9)
	sw	$8, 72($9)
	sw	$8, 68($9)
	sw	$8, 64($9)
	sw	$8, 60($9)
	sw	$8, 56($9)
	sw	$8, 52($9)
	sw	$8, 48($9)
	sw	$8, 44($9)
	sw	$8, 40($9)
	sw	$8, 36($9)
	sw	$8, 32($9)
	sw	$8, 28($9)
	sw	$8, 24($9)
	sw	$8, 20($9)
	sw	$8, 16($9)
	sw	$8, 12($9)
	sw	$8, 8($9)
	sw	$8, 4($9)
	sw	$8, 0($9)
	li	$8, 364
	lw	$8, 0($8)
	li	$9, 564
	sw	$8, 0($9)
	li	$8, 564
	li	$9, 568
	sw	$8, 0($9)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 572
	sw.s	$f1, 0($8)
	li	$8, 0
	li	$9, 576
	sw	$8, 0($9)
	lui.s	$f1, 0x4e6e	# 1000000000.000000の上位16ビット
	lli.s	$f1, 0x6b28	# 1000000000.000000の下位16ビット
	li	$8, 580
	sw.s	$f1, 0($8)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 584
	sw.s	$f1, 8($8)
	sw.s	$f1, 4($8)
	sw.s	$f1, 0($8)
	li	$8, 0
	li	$9, 596
	sw	$8, 0($9)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 600
	sw.s	$f1, 8($8)
	sw.s	$f1, 4($8)
	sw.s	$f1, 0($8)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 612
	sw.s	$f1, 8($8)
	sw.s	$f1, 4($8)
	sw.s	$f1, 0($8)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 624
	sw.s	$f1, 8($8)
	sw.s	$f1, 4($8)
	sw.s	$f1, 0($8)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 636
	sw.s	$f1, 8($8)
	sw.s	$f1, 4($8)
	sw.s	$f1, 0($8)
	li	$8, 0
	li	$9, 648
	sw	$8, 4($9)
	sw	$8, 0($9)
	li	$8, 0
	li	$9, 656
	sw	$8, 4($9)
	sw	$8, 0($9)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 664
	sw.s	$f1, 0($8)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 668
	sw.s	$f1, 8($8)
	sw.s	$f1, 4($8)
	sw.s	$f1, 0($8)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 680
	sw.s	$f1, 8($8)
	sw.s	$f1, 4($8)
	sw.s	$f1, 0($8)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 692
	sw.s	$f1, 8($8)
	sw.s	$f1, 4($8)
	sw.s	$f1, 0($8)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 704
	sw.s	$f1, 8($8)
	sw.s	$f1, 4($8)
	sw.s	$f1, 0($8)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 716
	sw.s	$f1, 8($8)
	sw.s	$f1, 4($8)
	sw.s	$f1, 0($8)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$8, 728
	sw.s	$f1, 8($8)
	sw.s	$f1, 4($8)
	sw.s	$f1, 0($8)
	li	$8, 740
	li	$9, 740
	li	$10, 740
	sw	$9, 4($10)
	sw	$8, 0($10)
	li	$8, 748
	li	$9, 748
	sw	$8, 16($9)
	sw	$8, 12($9)
	sw	$8, 8($9)
	sw	$8, 4($9)
	sw	$8, 0($9)
	li	$8, 768
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$9, 768
	sw.s	$f1, 8($9)
	sw.s	$f1, 4($9)
	sw.s	$f1, 0($9)
	li	$9, 768
	li	$10, 780
	sw	$8, 236($10)
	sw	$8, 232($10)
	sw	$8, 228($10)
	sw	$8, 224($10)
	sw	$8, 220($10)
	sw	$8, 216($10)
	sw	$8, 212($10)
	sw	$8, 208($10)
	sw	$8, 204($10)
	sw	$8, 200($10)
	sw	$8, 196($10)
	sw	$8, 192($10)
	sw	$8, 188($10)
	sw	$8, 184($10)
	sw	$8, 180($10)
	sw	$8, 176($10)
	sw	$8, 172($10)
	sw	$8, 168($10)
	sw	$8, 164($10)
	sw	$8, 160($10)
	sw	$8, 156($10)
	sw	$8, 152($10)
	sw	$8, 148($10)
	sw	$8, 144($10)
	sw	$8, 140($10)
	sw	$8, 136($10)
	sw	$8, 132($10)
	sw	$8, 128($10)
	sw	$8, 124($10)
	sw	$8, 120($10)
	sw	$8, 116($10)
	sw	$8, 112($10)
	sw	$8, 108($10)
	sw	$8, 104($10)
	sw	$8, 100($10)
	sw	$8, 96($10)
	sw	$8, 92($10)
	sw	$8, 88($10)
	sw	$8, 84($10)
	sw	$8, 80($10)
	sw	$8, 76($10)
	sw	$8, 72($10)
	sw	$8, 68($10)
	sw	$8, 64($10)
	sw	$8, 60($10)
	sw	$8, 56($10)
	sw	$8, 52($10)
	sw	$8, 48($10)
	sw	$8, 44($10)
	sw	$8, 40($10)
	sw	$8, 36($10)
	sw	$8, 32($10)
	sw	$8, 28($10)
	sw	$8, 24($10)
	sw	$8, 20($10)
	sw	$8, 16($10)
	sw	$8, 12($10)
	sw	$8, 8($10)
	sw	$8, 4($10)
	sw	$8, 0($10)
	li	$8, 780
	li	$10, 1020
	sw	$8, 4($10)
	sw	$9, 0($10)
	li	$8, 1020
	li	$9, 1028
	li	$10, 1028
	li	$11, 1028
	sw	$10, 4($11)
	sw	$9, 0($11)
	li	$9, 1028
	li	$10, 0
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$11, 1036
	sw.s	$f1, 8($11)
	sw	$9, 4($11)
	sw	$10, 0($11)
	li	$9, 1036
	li	$10, 1048
	sw	$9, 716($10)
	sw	$9, 712($10)
	sw	$9, 708($10)
	sw	$9, 704($10)
	sw	$9, 700($10)
	sw	$9, 696($10)
	sw	$9, 692($10)
	sw	$9, 688($10)
	sw	$9, 684($10)
	sw	$9, 680($10)
	sw	$9, 676($10)
	sw	$9, 672($10)
	sw	$9, 668($10)
	sw	$9, 664($10)
	sw	$9, 660($10)
	sw	$9, 656($10)
	sw	$9, 652($10)
	sw	$9, 648($10)
	sw	$9, 644($10)
	sw	$9, 640($10)
	sw	$9, 636($10)
	sw	$9, 632($10)
	sw	$9, 628($10)
	sw	$9, 624($10)
	sw	$9, 620($10)
	sw	$9, 616($10)
	sw	$9, 612($10)
	sw	$9, 608($10)
	sw	$9, 604($10)
	sw	$9, 600($10)
	sw	$9, 596($10)
	sw	$9, 592($10)
	sw	$9, 588($10)
	sw	$9, 584($10)
	sw	$9, 580($10)
	sw	$9, 576($10)
	sw	$9, 572($10)
	sw	$9, 568($10)
	sw	$9, 564($10)
	sw	$9, 560($10)
	sw	$9, 556($10)
	sw	$9, 552($10)
	sw	$9, 548($10)
	sw	$9, 544($10)
	sw	$9, 540($10)
	sw	$9, 536($10)
	sw	$9, 532($10)
	sw	$9, 528($10)
	sw	$9, 524($10)
	sw	$9, 520($10)
	sw	$9, 516($10)
	sw	$9, 512($10)
	sw	$9, 508($10)
	sw	$9, 504($10)
	sw	$9, 500($10)
	sw	$9, 496($10)
	sw	$9, 492($10)
	sw	$9, 488($10)
	sw	$9, 484($10)
	sw	$9, 480($10)
	sw	$9, 476($10)
	sw	$9, 472($10)
	sw	$9, 468($10)
	sw	$9, 464($10)
	sw	$9, 460($10)
	sw	$9, 456($10)
	sw	$9, 452($10)
	sw	$9, 448($10)
	sw	$9, 444($10)
	sw	$9, 440($10)
	sw	$9, 436($10)
	sw	$9, 432($10)
	sw	$9, 428($10)
	sw	$9, 424($10)
	sw	$9, 420($10)
	sw	$9, 416($10)
	sw	$9, 412($10)
	sw	$9, 408($10)
	sw	$9, 404($10)
	sw	$9, 400($10)
	sw	$9, 396($10)
	sw	$9, 392($10)
	sw	$9, 388($10)
	sw	$9, 384($10)
	sw	$9, 380($10)
	sw	$9, 376($10)
	sw	$9, 372($10)
	sw	$9, 368($10)
	sw	$9, 364($10)
	sw	$9, 360($10)
	sw	$9, 356($10)
	sw	$9, 352($10)
	sw	$9, 348($10)
	sw	$9, 344($10)
	sw	$9, 340($10)
	sw	$9, 336($10)
	sw	$9, 332($10)
	sw	$9, 328($10)
	sw	$9, 324($10)
	sw	$9, 320($10)
	sw	$9, 316($10)
	sw	$9, 312($10)
	sw	$9, 308($10)
	sw	$9, 304($10)
	sw	$9, 300($10)
	sw	$9, 296($10)
	sw	$9, 292($10)
	sw	$9, 288($10)
	sw	$9, 284($10)
	sw	$9, 280($10)
	sw	$9, 276($10)
	sw	$9, 272($10)
	sw	$9, 268($10)
	sw	$9, 264($10)
	sw	$9, 260($10)
	sw	$9, 256($10)
	sw	$9, 252($10)
	sw	$9, 248($10)
	sw	$9, 244($10)
	sw	$9, 240($10)
	sw	$9, 236($10)
	sw	$9, 232($10)
	sw	$9, 228($10)
	sw	$9, 224($10)
	sw	$9, 220($10)
	sw	$9, 216($10)
	sw	$9, 212($10)
	sw	$9, 208($10)
	sw	$9, 204($10)
	sw	$9, 200($10)
	sw	$9, 196($10)
	sw	$9, 192($10)
	sw	$9, 188($10)
	sw	$9, 184($10)
	sw	$9, 180($10)
	sw	$9, 176($10)
	sw	$9, 172($10)
	sw	$9, 168($10)
	sw	$9, 164($10)
	sw	$9, 160($10)
	sw	$9, 156($10)
	sw	$9, 152($10)
	sw	$9, 148($10)
	sw	$9, 144($10)
	sw	$9, 140($10)
	sw	$9, 136($10)
	sw	$9, 132($10)
	sw	$9, 128($10)
	sw	$9, 124($10)
	sw	$9, 120($10)
	sw	$9, 116($10)
	sw	$9, 112($10)
	sw	$9, 108($10)
	sw	$9, 104($10)
	sw	$9, 100($10)
	sw	$9, 96($10)
	sw	$9, 92($10)
	sw	$9, 88($10)
	sw	$9, 84($10)
	sw	$9, 80($10)
	sw	$9, 76($10)
	sw	$9, 72($10)
	sw	$9, 68($10)
	sw	$9, 64($10)
	sw	$9, 60($10)
	sw	$9, 56($10)
	sw	$9, 52($10)
	sw	$9, 48($10)
	sw	$9, 44($10)
	sw	$9, 40($10)
	sw	$9, 36($10)
	sw	$9, 32($10)
	sw	$9, 28($10)
	sw	$9, 24($10)
	sw	$9, 20($10)
	sw	$9, 16($10)
	sw	$9, 12($10)
	sw	$9, 8($10)
	sw	$9, 4($10)
	sw	$9, 0($10)
	li	$9, 0
	li	$10, 1768
	sw	$9, 0($10)
	li	$9, 128
	li	$10, 128
	li	$11, 648
	sw	$9, 0($11)
	li	$9, 652
	sw	$10, 0($9)
	li	$9, 64
	li	$10, 656
	sw	$9, 0($10)
	li	$9, 64
	li	$10, 660
	sw	$9, 0($10)
	lui.s	$f1, 0x3f80	# 1.000000の上位16ビット
	li	$9, 664
	sw.s	$f1, 0($9)
	li	$9, 648
	lw	$9, 0($9)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$10, 1772
	sw.s	$f1, 8($10)
	sw.s	$f1, 4($10)
	sw.s	$f1, 0($10)
	li	$10, 1772
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$11, 1784
	sw.s	$f1, 8($11)
	sw.s	$f1, 4($11)
	sw.s	$f1, 0($11)
	li	$11, 1784
	li	$12, 1796
	sw	$11, 16($12)
	sw	$11, 12($12)
	sw	$11, 8($12)
	sw	$11, 4($12)
	sw	$11, 0($12)
	li	$11, 1796
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$12, 1816
	sw.s	$f1, 8($12)
	sw.s	$f1, 4($12)
	sw.s	$f1, 0($12)
	li	$12, 1816
	li	$13, 1800
	sw	$12, 0($13)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$12, 1828
	sw.s	$f1, 8($12)
	sw.s	$f1, 4($12)
	sw.s	$f1, 0($12)
	li	$12, 1828
	li	$13, 1804
	sw	$12, 0($13)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$12, 1840
	sw.s	$f1, 8($12)
	sw.s	$f1, 4($12)
	sw.s	$f1, 0($12)
	li	$12, 1840
	li	$13, 1808
	sw	$12, 0($13)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$12, 1852
	sw.s	$f1, 8($12)
	sw.s	$f1, 4($12)
	sw.s	$f1, 0($12)
	li	$12, 1852
	li	$13, 1812
	sw	$12, 0($13)
	li	$12, 0
	li	$13, 1864
	sw	$12, 16($13)
	sw	$12, 12($13)
	sw	$12, 8($13)
	sw	$12, 4($13)
	sw	$12, 0($13)
	li	$12, 1864
	li	$13, 0
	li	$14, 1884
	sw	$13, 16($14)
	sw	$13, 12($14)
	sw	$13, 8($14)
	sw	$13, 4($14)
	sw	$13, 0($14)
	li	$13, 1884
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$14, 1904
	sw.s	$f1, 8($14)
	sw.s	$f1, 4($14)
	sw.s	$f1, 0($14)
	li	$14, 1904
	li	$15, 1916
	sw	$14, 16($15)
	sw	$14, 12($15)
	sw	$14, 8($15)
	sw	$14, 4($15)
	sw	$14, 0($15)
	li	$14, 1916
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 1936
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 1936
	li	$16, 1920
	sw	$15, 0($16)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 1948
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 1948
	li	$16, 1924
	sw	$15, 0($16)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 1960
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 1960
	li	$16, 1928
	sw	$15, 0($16)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 1972
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 1972
	li	$16, 1932
	sw	$15, 0($16)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 1984
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 1984
	li	$16, 1996
	sw	$15, 16($16)
	sw	$15, 12($16)
	sw	$15, 8($16)
	sw	$15, 4($16)
	sw	$15, 0($16)
	li	$15, 1996
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$16, 2016
	sw.s	$f1, 8($16)
	sw.s	$f1, 4($16)
	sw.s	$f1, 0($16)
	li	$16, 2016
	li	$17, 2000
	sw	$16, 0($17)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$16, 2028
	sw.s	$f1, 8($16)
	sw.s	$f1, 4($16)
	sw.s	$f1, 0($16)
	li	$16, 2028
	li	$17, 2004
	sw	$16, 0($17)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$16, 2040
	sw.s	$f1, 8($16)
	sw.s	$f1, 4($16)
	sw.s	$f1, 0($16)
	li	$16, 2040
	li	$17, 2008
	sw	$16, 0($17)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$16, 2052
	sw.s	$f1, 8($16)
	sw.s	$f1, 4($16)
	sw.s	$f1, 0($16)
	li	$16, 2052
	li	$17, 2012
	sw	$16, 0($17)
	li	$16, 0
	li	$17, 2064
	sw	$16, 0($17)
	li	$16, 2064
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$17, 2068
	sw.s	$f1, 8($17)
	sw.s	$f1, 4($17)
	sw.s	$f1, 0($17)
	li	$17, 2068
	li	$18, 2080
	sw	$17, 16($18)
	sw	$17, 12($18)
	sw	$17, 8($18)
	sw	$17, 4($18)
	sw	$17, 0($18)
	li	$17, 2080
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$18, 2100
	sw.s	$f1, 8($18)
	sw.s	$f1, 4($18)
	sw.s	$f1, 0($18)
	li	$18, 2100
	li	$19, 2084
	sw	$18, 0($19)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$18, 2112
	sw.s	$f1, 8($18)
	sw.s	$f1, 4($18)
	sw.s	$f1, 0($18)
	li	$18, 2112
	li	$19, 2088
	sw	$18, 0($19)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$18, 2124
	sw.s	$f1, 8($18)
	sw.s	$f1, 4($18)
	sw.s	$f1, 0($18)
	li	$18, 2124
	li	$19, 2092
	sw	$18, 0($19)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$18, 2136
	sw.s	$f1, 8($18)
	sw.s	$f1, 4($18)
	sw.s	$f1, 0($18)
	li	$18, 2136
	li	$19, 2096
	sw	$18, 0($19)
	li	$18, 2148
	sw	$17, 28($18)
	sw	$16, 24($18)
	sw	$15, 20($18)
	sw	$14, 16($18)
	sw	$13, 12($18)
	sw	$12, 8($18)
	sw	$11, 4($18)
	sw	$10, 0($18)
	li	$10, 2148
	mv	$11, $gp
	sw	$8, 0($sp)
	sw	$11, 4($sp)
	mv	$8, $9
	mv	$9, $10
	sw	$ra, 8($sp)
	addi	$sp, $sp, 12
	jal	create_array_loop
	addi	$sp, $sp, -12
	lw	$ra, 8($sp)
	lw	$8, 4($sp)
	li	$9, 648
	lw	$9, 0($9)
	addi	$9, $9, -2
	sw	$ra, 8($sp)
	addi	$sp, $sp, 12
	jal	init_line_elements..7346
	addi	$sp, $sp, -12
	lw	$ra, 8($sp)
	li	$9, 648
	lw	$9, 0($9)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$10, 2180
	sw.s	$f1, 8($10)
	sw.s	$f1, 4($10)
	sw.s	$f1, 0($10)
	li	$10, 2180
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$11, 2192
	sw.s	$f1, 8($11)
	sw.s	$f1, 4($11)
	sw.s	$f1, 0($11)
	li	$11, 2192
	li	$12, 2204
	sw	$11, 16($12)
	sw	$11, 12($12)
	sw	$11, 8($12)
	sw	$11, 4($12)
	sw	$11, 0($12)
	li	$11, 2204
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$12, 2224
	sw.s	$f1, 8($12)
	sw.s	$f1, 4($12)
	sw.s	$f1, 0($12)
	li	$12, 2224
	li	$13, 2208
	sw	$12, 0($13)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$12, 2236
	sw.s	$f1, 8($12)
	sw.s	$f1, 4($12)
	sw.s	$f1, 0($12)
	li	$12, 2236
	li	$13, 2212
	sw	$12, 0($13)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$12, 2248
	sw.s	$f1, 8($12)
	sw.s	$f1, 4($12)
	sw.s	$f1, 0($12)
	li	$12, 2248
	li	$13, 2216
	sw	$12, 0($13)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$12, 2260
	sw.s	$f1, 8($12)
	sw.s	$f1, 4($12)
	sw.s	$f1, 0($12)
	li	$12, 2260
	li	$13, 2220
	sw	$12, 0($13)
	li	$12, 0
	li	$13, 2272
	sw	$12, 16($13)
	sw	$12, 12($13)
	sw	$12, 8($13)
	sw	$12, 4($13)
	sw	$12, 0($13)
	li	$12, 2272
	li	$13, 0
	li	$14, 2292
	sw	$13, 16($14)
	sw	$13, 12($14)
	sw	$13, 8($14)
	sw	$13, 4($14)
	sw	$13, 0($14)
	li	$13, 2292
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$14, 2312
	sw.s	$f1, 8($14)
	sw.s	$f1, 4($14)
	sw.s	$f1, 0($14)
	li	$14, 2312
	li	$15, 2324
	sw	$14, 16($15)
	sw	$14, 12($15)
	sw	$14, 8($15)
	sw	$14, 4($15)
	sw	$14, 0($15)
	li	$14, 2324
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 2344
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 2344
	li	$16, 2328
	sw	$15, 0($16)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 2356
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 2356
	li	$16, 2332
	sw	$15, 0($16)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 2368
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 2368
	li	$16, 2336
	sw	$15, 0($16)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 2380
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 2380
	li	$16, 2340
	sw	$15, 0($16)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 2392
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 2392
	li	$16, 2404
	sw	$15, 16($16)
	sw	$15, 12($16)
	sw	$15, 8($16)
	sw	$15, 4($16)
	sw	$15, 0($16)
	li	$15, 2404
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$16, 2424
	sw.s	$f1, 8($16)
	sw.s	$f1, 4($16)
	sw.s	$f1, 0($16)
	li	$16, 2424
	li	$17, 2408
	sw	$16, 0($17)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$16, 2436
	sw.s	$f1, 8($16)
	sw.s	$f1, 4($16)
	sw.s	$f1, 0($16)
	li	$16, 2436
	li	$17, 2412
	sw	$16, 0($17)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$16, 2448
	sw.s	$f1, 8($16)
	sw.s	$f1, 4($16)
	sw.s	$f1, 0($16)
	li	$16, 2448
	li	$17, 2416
	sw	$16, 0($17)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$16, 2460
	sw.s	$f1, 8($16)
	sw.s	$f1, 4($16)
	sw.s	$f1, 0($16)
	li	$16, 2460
	li	$17, 2420
	sw	$16, 0($17)
	li	$16, 0
	li	$17, 2472
	sw	$16, 0($17)
	li	$16, 2472
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$17, 2476
	sw.s	$f1, 8($17)
	sw.s	$f1, 4($17)
	sw.s	$f1, 0($17)
	li	$17, 2476
	li	$18, 2488
	sw	$17, 16($18)
	sw	$17, 12($18)
	sw	$17, 8($18)
	sw	$17, 4($18)
	sw	$17, 0($18)
	li	$17, 2488
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$18, 2508
	sw.s	$f1, 8($18)
	sw.s	$f1, 4($18)
	sw.s	$f1, 0($18)
	li	$18, 2508
	li	$19, 2492
	sw	$18, 0($19)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$18, 2520
	sw.s	$f1, 8($18)
	sw.s	$f1, 4($18)
	sw.s	$f1, 0($18)
	li	$18, 2520
	li	$19, 2496
	sw	$18, 0($19)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$18, 2532
	sw.s	$f1, 8($18)
	sw.s	$f1, 4($18)
	sw.s	$f1, 0($18)
	li	$18, 2532
	li	$19, 2500
	sw	$18, 0($19)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$18, 2544
	sw.s	$f1, 8($18)
	sw.s	$f1, 4($18)
	sw.s	$f1, 0($18)
	li	$18, 2544
	li	$19, 2504
	sw	$18, 0($19)
	li	$18, 2556
	sw	$17, 28($18)
	sw	$16, 24($18)
	sw	$15, 20($18)
	sw	$14, 16($18)
	sw	$13, 12($18)
	sw	$12, 8($18)
	sw	$11, 4($18)
	sw	$10, 0($18)
	li	$10, 2556
	mv	$11, $gp
	sw	$8, 8($sp)
	sw	$11, 12($sp)
	mv	$8, $9
	mv	$9, $10
	sw	$ra, 16($sp)
	addi	$sp, $sp, 20
	jal	create_array_loop
	addi	$sp, $sp, -20
	lw	$ra, 16($sp)
	lw	$8, 12($sp)
	li	$9, 648
	lw	$9, 0($9)
	addi	$9, $9, -2
	sw	$ra, 16($sp)
	addi	$sp, $sp, 20
	jal	init_line_elements..7346
	addi	$sp, $sp, -20
	lw	$ra, 16($sp)
	li	$9, 648
	lw	$9, 0($9)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$10, 2588
	sw.s	$f1, 8($10)
	sw.s	$f1, 4($10)
	sw.s	$f1, 0($10)
	li	$10, 2588
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$11, 2600
	sw.s	$f1, 8($11)
	sw.s	$f1, 4($11)
	sw.s	$f1, 0($11)
	li	$11, 2600
	li	$12, 2612
	sw	$11, 16($12)
	sw	$11, 12($12)
	sw	$11, 8($12)
	sw	$11, 4($12)
	sw	$11, 0($12)
	li	$11, 2612
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$12, 2632
	sw.s	$f1, 8($12)
	sw.s	$f1, 4($12)
	sw.s	$f1, 0($12)
	li	$12, 2632
	li	$13, 2616
	sw	$12, 0($13)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$12, 2644
	sw.s	$f1, 8($12)
	sw.s	$f1, 4($12)
	sw.s	$f1, 0($12)
	li	$12, 2644
	li	$13, 2620
	sw	$12, 0($13)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$12, 2656
	sw.s	$f1, 8($12)
	sw.s	$f1, 4($12)
	sw.s	$f1, 0($12)
	li	$12, 2656
	li	$13, 2624
	sw	$12, 0($13)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$12, 2668
	sw.s	$f1, 8($12)
	sw.s	$f1, 4($12)
	sw.s	$f1, 0($12)
	li	$12, 2668
	li	$13, 2628
	sw	$12, 0($13)
	li	$12, 0
	li	$13, 2680
	sw	$12, 16($13)
	sw	$12, 12($13)
	sw	$12, 8($13)
	sw	$12, 4($13)
	sw	$12, 0($13)
	li	$12, 2680
	li	$13, 0
	li	$14, 2700
	sw	$13, 16($14)
	sw	$13, 12($14)
	sw	$13, 8($14)
	sw	$13, 4($14)
	sw	$13, 0($14)
	li	$13, 2700
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$14, 2720
	sw.s	$f1, 8($14)
	sw.s	$f1, 4($14)
	sw.s	$f1, 0($14)
	li	$14, 2720
	li	$15, 2732
	sw	$14, 16($15)
	sw	$14, 12($15)
	sw	$14, 8($15)
	sw	$14, 4($15)
	sw	$14, 0($15)
	li	$14, 2732
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 2752
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 2752
	li	$16, 2736
	sw	$15, 0($16)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 2764
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 2764
	li	$16, 2740
	sw	$15, 0($16)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 2776
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 2776
	li	$16, 2744
	sw	$15, 0($16)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 2788
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 2788
	li	$16, 2748
	sw	$15, 0($16)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$15, 2800
	sw.s	$f1, 8($15)
	sw.s	$f1, 4($15)
	sw.s	$f1, 0($15)
	li	$15, 2800
	li	$16, 2812
	sw	$15, 16($16)
	sw	$15, 12($16)
	sw	$15, 8($16)
	sw	$15, 4($16)
	sw	$15, 0($16)
	li	$15, 2812
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$16, 2832
	sw.s	$f1, 8($16)
	sw.s	$f1, 4($16)
	sw.s	$f1, 0($16)
	li	$16, 2832
	li	$17, 2816
	sw	$16, 0($17)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$16, 2844
	sw.s	$f1, 8($16)
	sw.s	$f1, 4($16)
	sw.s	$f1, 0($16)
	li	$16, 2844
	li	$17, 2820
	sw	$16, 0($17)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$16, 2856
	sw.s	$f1, 8($16)
	sw.s	$f1, 4($16)
	sw.s	$f1, 0($16)
	li	$16, 2856
	li	$17, 2824
	sw	$16, 0($17)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$16, 2868
	sw.s	$f1, 8($16)
	sw.s	$f1, 4($16)
	sw.s	$f1, 0($16)
	li	$16, 2868
	li	$17, 2828
	sw	$16, 0($17)
	li	$16, 0
	li	$17, 2880
	sw	$16, 0($17)
	li	$16, 2880
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$17, 2884
	sw.s	$f1, 8($17)
	sw.s	$f1, 4($17)
	sw.s	$f1, 0($17)
	li	$17, 2884
	li	$18, 2896
	sw	$17, 16($18)
	sw	$17, 12($18)
	sw	$17, 8($18)
	sw	$17, 4($18)
	sw	$17, 0($18)
	li	$17, 2896
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$18, 2916
	sw.s	$f1, 8($18)
	sw.s	$f1, 4($18)
	sw.s	$f1, 0($18)
	li	$18, 2916
	li	$19, 2900
	sw	$18, 0($19)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$18, 2928
	sw.s	$f1, 8($18)
	sw.s	$f1, 4($18)
	sw.s	$f1, 0($18)
	li	$18, 2928
	li	$19, 2904
	sw	$18, 0($19)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$18, 2940
	sw.s	$f1, 8($18)
	sw.s	$f1, 4($18)
	sw.s	$f1, 0($18)
	li	$18, 2940
	li	$19, 2908
	sw	$18, 0($19)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$18, 2952
	sw.s	$f1, 8($18)
	sw.s	$f1, 4($18)
	sw.s	$f1, 0($18)
	li	$18, 2952
	li	$19, 2912
	sw	$18, 0($19)
	li	$18, 2964
	sw	$17, 28($18)
	sw	$16, 24($18)
	sw	$15, 20($18)
	sw	$14, 16($18)
	sw	$13, 12($18)
	sw	$12, 8($18)
	sw	$11, 4($18)
	sw	$10, 0($18)
	li	$10, 2964
	mv	$11, $gp
	sw	$8, 16($sp)
	sw	$11, 20($sp)
	mv	$8, $9
	mv	$9, $10
	sw	$ra, 24($sp)
	addi	$sp, $sp, 28
	jal	create_array_loop
	addi	$sp, $sp, -28
	lw	$ra, 24($sp)
	lw	$8, 20($sp)
	li	$9, 648
	lw	$9, 0($9)
	addi	$9, $9, -2
	sw	$ra, 24($sp)
	addi	$sp, $sp, 28
	jal	init_line_elements..7346
	addi	$sp, $sp, -28
	lw	$ra, 24($sp)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	li	$9, 320
	sw.s	$f1, 0($9)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	li	$9, 324
	sw.s	$f1, 0($9)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	li	$9, 328
	sw.s	$f1, 0($9)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	lui.s	$f2, 0x3c8e	# 0.017453の上位16ビット
	lli.s	$f2, 0xfa35	# 0.017453の下位16ビット
	mul.s	$f1, $f1, $f2
	sw	$8, 24($sp)
	sw.s	$f1, 28($sp)
	sw	$ra, 32($sp)
	addi	$sp, $sp, 36
	jal	cos..6891
	addi	$sp, $sp, -36
	lw	$ra, 32($sp)
	lw.s	$f2, 28($sp)
	sw.s	$f1, 32($sp)
	mv.s	$f1, $f2
	sw	$ra, 36($sp)
	addi	$sp, $sp, 40
	jal	sin..6893
	addi	$sp, $sp, -40
	lw	$ra, 36($sp)
	in	$8
	sll	$8, $8, 24
	in	$9
	sll	$9, $9, 16
	add	$8, $9, $8
	in	$9
	sll	$9, $9, 8
	add	$8, $9, $8
	in	$9
	add	$8, $9, $8
	sw	$8, 16($zero)
	lw.s	$f2, 16($zero)
	lui.s	$f3, 0x3c8e	# 0.017453の上位16ビット
	lli.s	$f3, 0xfa35	# 0.017453の下位16ビット
	mul.s	$f2, $f2, $f3
	sw.s	$f1, 36($sp)
	sw.s	$f2, 40($sp)
	mv.s	$f1, $f2
	sw	$ra, 44($sp)
	addi	$sp, $sp, 48
	jal	cos..6891
	addi	$sp, $sp, -48
	lw	$ra, 44($sp)
	lw.s	$f2, 40($sp)
	sw.s	$f1, 44($sp)
	mv.s	$f1, $f2
	sw	$ra, 48($sp)
	addi	$sp, $sp, 52
	jal	sin..6893
	addi	$sp, $sp, -52
	lw	$ra, 48($sp)
	lw.s	$f2, 32($sp)
	mul.s	$f3, $f2, $f1
	lui.s	$f4, 0x4348	# 200.000000の上位16ビット
	mul.s	$f3, $f3, $f4
	li	$8, 716
	sw.s	$f3, 0($8)
	lui.s	$f3, 0xc348	# -200.000000の上位16ビット
	lw.s	$f4, 36($sp)
	mul.s	$f3, $f4, $f3
	li	$8, 720
	sw.s	$f3, 0($8)
	lw.s	$f3, 44($sp)
	mul.s	$f5, $f2, $f3
	lui.s	$f6, 0x4348	# 200.000000の上位16ビット
	mul.s	$f5, $f5, $f6
	li	$8, 724
	sw.s	$f5, 0($8)
	li	$8, 692
	sw.s	$f3, 0($8)
	lui.s	$f5, 0x0	# 0.000000の上位16ビット
	li	$8, 696
	sw.s	$f5, 0($8)
	neg.s	$f5, $f1
	li	$8, 700
	sw.s	$f5, 0($8)
	neg.s	$f5, $f4
	mul.s	$f1, $f5, $f1
	li	$8, 704
	sw.s	$f1, 0($8)
	neg.s	$f1, $f2
	li	$8, 708
	sw.s	$f1, 0($8)
	neg.s	$f1, $f4
	mul.s	$f1, $f1, $f3
	li	$8, 712
	sw.s	$f1, 0($8)
	li	$8, 320
	lw.s	$f1, 0($8)
	li	$8, 716
	lw.s	$f2, 0($8)
	sub.s	$f1, $f1, $f2
	li	$8, 332
	sw.s	$f1, 0($8)
	li	$8, 324
	lw.s	$f1, 0($8)
	li	$8, 720
	lw.s	$f2, 0($8)
	sub.s	$f1, $f1, $f2
	li	$8, 336
	sw.s	$f1, 0($8)
	li	$8, 328
	lw.s	$f1, 0($8)
	li	$8, 724
	lw.s	$f2, 0($8)
	sub.s	$f1, $f1, $f2
	li	$8, 340
	sw.s	$f1, 0($8)
	in	$8
	in	$8
	in	$8
	in	$8
	in	$8
	sll	$8, $8, 24
	in	$9
	sll	$9, $9, 16
	add	$8, $9, $8
	in	$9
	sll	$9, $9, 8
	add	$8, $9, $8
	in	$9
	add	$8, $9, $8
	sw	$8, 16($zero)
	lw.s	$f1, 16($zero)
	lui.s	$f2, 0x3c8e	# 0.017453の上位16ビット
	lli.s	$f2, 0xfa35	# 0.017453の下位16ビット
	mul.s	$f1, $f1, $f2
	sw.s	$f1, 48($sp)
	sw	$ra, 52($sp)
	addi	$sp, $sp, 56
	jal	sin..6893
	addi	$sp, $sp, -56
	lw	$ra, 52($sp)
	neg.s	$f1, $f1
	li	$8, 348
	sw.s	$f1, 0($8)
	in	$8
	sll	$8, $8, 24
	in	$9
	sll	$9, $9, 16
	add	$8, $9, $8
	in	$9
	sll	$9, $9, 8
	add	$8, $9, $8
	in	$9
	add	$8, $9, $8
	sw	$8, 16($zero)
	lw.s	$f1, 16($zero)
	lui.s	$f2, 0x3c8e	# 0.017453の上位16ビット
	lli.s	$f2, 0xfa35	# 0.017453の下位16ビット
	mul.s	$f1, $f1, $f2
	lw.s	$f2, 48($sp)
	sw.s	$f1, 52($sp)
	mv.s	$f1, $f2
	sw	$ra, 56($sp)
	addi	$sp, $sp, 60
	jal	cos..6891
	addi	$sp, $sp, -60
	lw	$ra, 56($sp)
	lw.s	$f2, 52($sp)
	sw.s	$f1, 56($sp)
	mv.s	$f1, $f2
	sw	$ra, 60($sp)
	addi	$sp, $sp, 64
	jal	sin..6893
	addi	$sp, $sp, -64
	lw	$ra, 60($sp)
	lw.s	$f2, 56($sp)
	mul.s	$f1, $f2, $f1
	li	$8, 344
	sw.s	$f1, 0($8)
	lw.s	$f1, 52($sp)
	sw	$ra, 60($sp)
	addi	$sp, $sp, 64
	jal	cos..6891
	addi	$sp, $sp, -64
	lw	$ra, 60($sp)
	lw.s	$f2, 56($sp)
	mul.s	$f1, $f2, $f1
	li	$8, 352
	sw.s	$f1, 0($8)
	in	$8
	sll	$8, $8, 24
	in	$9
	sll	$9, $9, 16
	add	$8, $9, $8
	in	$9
	sll	$9, $9, 8
	add	$8, $9, $8
	in	$9
	add	$8, $9, $8
	sw	$8, 16($zero)
	lw.s	$f1, 16($zero)
	li	$8, 356
	sw.s	$f1, 0($8)
	li	$8, 0
	sw	$ra, 60($sp)
	addi	$sp, $sp, 64
	jal	read_object..7057
	addi	$sp, $sp, -64
	lw	$ra, 60($sp)
	li	$8, 0
	sw	$ra, 60($sp)
	addi	$sp, $sp, 64
	jal	read_and_network..7065
	addi	$sp, $sp, -64
	lw	$ra, 60($sp)
	li	$8, 0
	sw	$ra, 60($sp)
	addi	$sp, $sp, 64
	jal	read_or_network..7063
	addi	$sp, $sp, -64
	lw	$ra, 60($sp)
	li	$9, 568
	sw	$8, 0($9)
	li	$8, 80
	out	$8
	li	$8, 51
	out	$8
	li	$8, 10
	out	$8
	li	$8, 648
	lw	$8, 0($8)
	outint	$8
	li	$8, 32
	out	$8
	li	$8, 652
	lw	$8, 0($8)
	outint	$8
	li	$8, 32
	out	$8
	outint	$6
	li	$8, 10
	out	$8
	li	$8, 4
	sw	$ra, 60($sp)
	addi	$sp, $sp, 64
	jal	create_dirvecs..7376
	addi	$sp, $sp, -64
	lw	$ra, 60($sp)
	li	$8, 9
	li	$9, 0
	li	$10, 0
	sw	$ra, 60($sp)
	addi	$sp, $sp, 64
	jal	calc_dirvec_rows..7367
	addi	$sp, $sp, -64
	lw	$ra, 60($sp)
	li	$8, 4
	sw	$ra, 60($sp)
	addi	$sp, $sp, 64
	jal	init_vecset_constants..7381
	addi	$sp, $sp, -64
	lw	$ra, 60($sp)
	lw	$8, 0($sp)
	lw	$9, 0($8)
	li	$10, 344
	lw.s	$f1, 0($10)
	mv	$10, $9
	sw.s	$f1, 0($10)
	li	$10, 348
	lw.s	$f1, 0($10)
	addi	$10, $9, 4
	sw.s	$f1, 0($10)
	li	$10, 352
	lw.s	$f1, 0($10)
	addi	$9, $9, 8
	sw.s	$f1, 0($9)
	li	$9, 32
	lw	$9, 0($9)
	addi	$9, $9, -1
	sw	$ra, 60($sp)
	addi	$sp, $sp, 64
	jal	iter_setup_dirvec_constants..7162
	addi	$sp, $sp, -64
	lw	$ra, 60($sp)
	li	$8, 32
	lw	$8, 0($8)
	addi	$8, $8, -1
	ble	$0, $8, ble_then.28998
	j	ble_cont.28999
ble_then.28998:
	sll	$9, $8, 2
	addi	$9, $9, 80
	lw	$9, 0($9)
	lw	$10, 8($9)
	beq	$10, $2, beq_then.29000
	j	beq_cont.29001
beq_then.29000:
	lw	$10, 28($9)
	lw.s	$f1, 0($10)
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	ble.s	$f2, $f1, ble.s_then.29002
	li	$10, 1
	j	ble.s_cont.29003
ble.s_then.29002:
	li	$10, 0
ble.s_cont.29003:
	beq	$10, $0, beq_then.29004
	lw	$10, 4($9)
	beq	$10, $1, beq_then.29006
	beq	$10, $2, beq_then.29008
	j	beq_cont.29009
beq_then.29008:
	sll	$8, $8, 2
	addi	$8, $8, 1
	li	$10, 1768
	lw	$10, 0($10)
	lui.s	$f1, 0x3f80	# 1.000000の上位16ビット
	lw	$11, 28($9)
	lw.s	$f2, 0($11)
	sub.s	$f1, $f1, $f2
	lw	$11, 16($9)
	li	$12, 344
	lw.s	$f2, 0($12)
	mv	$12, $11
	lw.s	$f3, 0($12)
	mul.s	$f2, $f2, $f3
	li	$12, 348
	lw.s	$f3, 0($12)
	addi	$12, $11, 4
	lw.s	$f4, 0($12)
	mul.s	$f3, $f3, $f4
	add.s	$f2, $f2, $f3
	li	$12, 352
	lw.s	$f3, 0($12)
	addi	$11, $11, 8
	lw.s	$f4, 0($11)
	mul.s	$f3, $f3, $f4
	add.s	$f2, $f2, $f3
	lui.s	$f3, 0x4000	# 2.000000の上位16ビット
	lw	$11, 16($9)
	lw.s	$f4, 0($11)
	mul.s	$f3, $f3, $f4
	mul.s	$f3, $f3, $f2
	li	$11, 344
	lw.s	$f4, 0($11)
	sub.s	$f3, $f3, $f4
	lui.s	$f4, 0x4000	# 2.000000の上位16ビット
	lw	$11, 16($9)
	addi	$11, $11, 4
	lw.s	$f5, 0($11)
	mul.s	$f4, $f4, $f5
	mul.s	$f4, $f4, $f2
	li	$11, 348
	lw.s	$f5, 0($11)
	sub.s	$f4, $f4, $f5
	lui.s	$f5, 0x4000	# 2.000000の上位16ビット
	lw	$9, 16($9)
	addi	$9, $9, 8
	lw.s	$f6, 0($9)
	mul.s	$f5, $f5, $f6
	mul.s	$f2, $f5, $f2
	li	$9, 352
	lw.s	$f5, 0($9)
	sub.s	$f2, $f2, $f5
	lui.s	$f5, 0x0	# 0.000000の上位16ビット
	li	$9, 2996
	sw.s	$f5, 8($9)
	sw.s	$f5, 4($9)
	sw.s	$f5, 0($9)
	li	$9, 2996
	li	$11, 32
	lw	$11, 0($11)
	mv	$12, $gp
	sw	$10, 60($sp)
	sw	$8, 64($sp)
	sw.s	$f1, 68($sp)
	sw.s	$f2, 72($sp)
	sw.s	$f4, 76($sp)
	sw.s	$f3, 80($sp)
	sw	$9, 84($sp)
	sw	$12, 88($sp)
	mv	$8, $11
	sw	$ra, 92($sp)
	addi	$sp, $sp, 96
	jal	create_array_loop
	addi	$sp, $sp, -96
	lw	$ra, 92($sp)
	lw	$8, 88($sp)
	li	$9, 3008
	sw	$8, 4($9)
	lw	$8, 84($sp)
	sw	$8, 0($9)
	li	$8, 3008
	li	$9, 2996
	lw.s	$f1, 80($sp)
	sw.s	$f1, 0($9)
	li	$9, 3000
	lw.s	$f1, 76($sp)
	sw.s	$f1, 0($9)
	li	$9, 3004
	lw.s	$f1, 72($sp)
	sw.s	$f1, 0($9)
	li	$9, 32
	lw	$9, 0($9)
	addi	$9, $9, -1
	sw	$8, 92($sp)
	sw	$ra, 96($sp)
	addi	$sp, $sp, 100
	jal	iter_setup_dirvec_constants..7162
	addi	$sp, $sp, -100
	lw	$ra, 96($sp)
	li	$8, 3016
	lw.s	$f1, 68($sp)
	sw.s	$f1, 8($8)
	lw	$9, 92($sp)
	sw	$9, 4($8)
	lw	$9, 64($sp)
	sw	$9, 0($8)
	li	$8, 3016
	lw	$9, 60($sp)
	sll	$10, $9, 2
	addi	$10, $10, 1048
	sw	$8, 0($10)
	addi	$8, $9, 1
	li	$9, 1768
	sw	$8, 0($9)
beq_cont.29009:
	j	beq_cont.29007
beq_then.29006:
	sll	$8, $8, 2
	li	$10, 1768
	lw	$10, 0($10)
	lui.s	$f1, 0x3f80	# 1.000000の上位16ビット
	lw	$9, 28($9)
	lw.s	$f2, 0($9)
	sub.s	$f1, $f1, $f2
	li	$9, 344
	lw.s	$f2, 0($9)
	neg.s	$f2, $f2
	li	$9, 348
	lw.s	$f3, 0($9)
	neg.s	$f3, $f3
	li	$9, 352
	lw.s	$f4, 0($9)
	neg.s	$f4, $f4
	addi	$9, $8, 1
	li	$11, 344
	lw.s	$f5, 0($11)
	lui.s	$f6, 0x0	# 0.000000の上位16ビット
	li	$11, 3028
	sw.s	$f6, 8($11)
	sw.s	$f6, 4($11)
	sw.s	$f6, 0($11)
	li	$11, 3028
	li	$12, 32
	lw	$12, 0($12)
	mv	$13, $gp
	sw.s	$f2, 96($sp)
	sw	$8, 100($sp)
	sw	$10, 104($sp)
	sw	$9, 108($sp)
	sw.s	$f1, 112($sp)
	sw.s	$f4, 116($sp)
	sw.s	$f3, 120($sp)
	sw.s	$f5, 124($sp)
	sw	$11, 128($sp)
	sw	$13, 132($sp)
	mv	$9, $11
	mv	$8, $12
	sw	$ra, 136($sp)
	addi	$sp, $sp, 140
	jal	create_array_loop
	addi	$sp, $sp, -140
	lw	$ra, 136($sp)
	lw	$8, 132($sp)
	li	$9, 3040
	sw	$8, 4($9)
	lw	$8, 128($sp)
	sw	$8, 0($9)
	li	$8, 3040
	li	$9, 3028
	lw.s	$f1, 124($sp)
	sw.s	$f1, 0($9)
	li	$9, 3032
	lw.s	$f1, 120($sp)
	sw.s	$f1, 0($9)
	li	$9, 3036
	lw.s	$f2, 116($sp)
	sw.s	$f2, 0($9)
	li	$9, 32
	lw	$9, 0($9)
	addi	$9, $9, -1
	sw	$8, 136($sp)
	sw	$ra, 140($sp)
	addi	$sp, $sp, 144
	jal	iter_setup_dirvec_constants..7162
	addi	$sp, $sp, -144
	lw	$ra, 140($sp)
	li	$8, 3048
	lw.s	$f1, 112($sp)
	sw.s	$f1, 8($8)
	lw	$9, 136($sp)
	sw	$9, 4($8)
	lw	$9, 108($sp)
	sw	$9, 0($8)
	li	$8, 3048
	lw	$9, 104($sp)
	sll	$10, $9, 2
	addi	$10, $10, 1048
	sw	$8, 0($10)
	addi	$8, $9, 1
	lw	$10, 100($sp)
	addi	$11, $10, 2
	li	$12, 348
	lw.s	$f2, 0($12)
	lui.s	$f3, 0x0	# 0.000000の上位16ビット
	li	$12, 3060
	sw.s	$f3, 8($12)
	sw.s	$f3, 4($12)
	sw.s	$f3, 0($12)
	li	$12, 3060
	li	$13, 32
	lw	$13, 0($13)
	mv	$14, $gp
	sw	$8, 140($sp)
	sw	$11, 144($sp)
	sw.s	$f2, 148($sp)
	sw	$12, 152($sp)
	sw	$14, 156($sp)
	mv	$9, $12
	mv	$8, $13
	sw	$ra, 160($sp)
	addi	$sp, $sp, 164
	jal	create_array_loop
	addi	$sp, $sp, -164
	lw	$ra, 160($sp)
	lw	$8, 156($sp)
	li	$9, 3072
	sw	$8, 4($9)
	lw	$8, 152($sp)
	sw	$8, 0($9)
	li	$8, 3072
	li	$9, 3060
	lw.s	$f1, 96($sp)
	sw.s	$f1, 0($9)
	li	$9, 3064
	lw.s	$f2, 148($sp)
	sw.s	$f2, 0($9)
	li	$9, 3068
	lw.s	$f2, 116($sp)
	sw.s	$f2, 0($9)
	li	$9, 32
	lw	$9, 0($9)
	addi	$9, $9, -1
	sw	$8, 160($sp)
	sw	$ra, 164($sp)
	addi	$sp, $sp, 168
	jal	iter_setup_dirvec_constants..7162
	addi	$sp, $sp, -168
	lw	$ra, 164($sp)
	li	$8, 3080
	lw.s	$f1, 112($sp)
	sw.s	$f1, 8($8)
	lw	$9, 160($sp)
	sw	$9, 4($8)
	lw	$9, 144($sp)
	sw	$9, 0($8)
	li	$8, 3080
	lw	$9, 140($sp)
	sll	$9, $9, 2
	addi	$9, $9, 1048
	sw	$8, 0($9)
	lw	$8, 104($sp)
	addi	$9, $8, 2
	lw	$10, 100($sp)
	addi	$10, $10, 3
	li	$11, 352
	lw.s	$f2, 0($11)
	lui.s	$f3, 0x0	# 0.000000の上位16ビット
	li	$11, 3092
	sw.s	$f3, 8($11)
	sw.s	$f3, 4($11)
	sw.s	$f3, 0($11)
	li	$11, 3092
	li	$12, 32
	lw	$12, 0($12)
	mv	$13, $gp
	sw	$9, 164($sp)
	sw	$10, 168($sp)
	sw.s	$f2, 172($sp)
	sw	$11, 176($sp)
	sw	$13, 180($sp)
	mv	$9, $11
	mv	$8, $12
	sw	$ra, 184($sp)
	addi	$sp, $sp, 188
	jal	create_array_loop
	addi	$sp, $sp, -188
	lw	$ra, 184($sp)
	lw	$8, 180($sp)
	li	$9, 3104
	sw	$8, 4($9)
	lw	$8, 176($sp)
	sw	$8, 0($9)
	li	$8, 3104
	li	$9, 3092
	lw.s	$f1, 96($sp)
	sw.s	$f1, 0($9)
	li	$9, 3096
	lw.s	$f1, 120($sp)
	sw.s	$f1, 0($9)
	li	$9, 3100
	lw.s	$f1, 172($sp)
	sw.s	$f1, 0($9)
	li	$9, 32
	lw	$9, 0($9)
	addi	$9, $9, -1
	sw	$8, 184($sp)
	sw	$ra, 188($sp)
	addi	$sp, $sp, 192
	jal	iter_setup_dirvec_constants..7162
	addi	$sp, $sp, -192
	lw	$ra, 188($sp)
	li	$8, 3112
	lw.s	$f1, 112($sp)
	sw.s	$f1, 8($8)
	lw	$9, 184($sp)
	sw	$9, 4($8)
	lw	$9, 168($sp)
	sw	$9, 0($8)
	li	$8, 3112
	lw	$9, 164($sp)
	sll	$9, $9, 2
	addi	$9, $9, 1048
	sw	$8, 0($9)
	lw	$8, 104($sp)
	addi	$8, $8, 3
	li	$9, 1768
	sw	$8, 0($9)
beq_cont.29007:
	j	beq_cont.29005
beq_then.29004:
beq_cont.29005:
beq_cont.29001:
ble_cont.28999:
	li	$10, 0
	li	$8, 664
	lw.s	$f1, 0($8)
	li	$8, 660
	lw	$8, 0($8)
	sub	$8, $0, $8
	itof	$f2, $8
	mul.s	$f1, $f1, $f2
	li	$8, 704
	lw.s	$f2, 0($8)
	mul.s	$f2, $f1, $f2
	li	$8, 716
	lw.s	$f3, 0($8)
	add.s	$f2, $f2, $f3
	li	$8, 708
	lw.s	$f3, 0($8)
	mul.s	$f3, $f1, $f3
	li	$8, 720
	lw.s	$f4, 0($8)
	add.s	$f3, $f3, $f4
	li	$8, 712
	lw.s	$f4, 0($8)
	mul.s	$f1, $f1, $f4
	li	$8, 724
	lw.s	$f4, 0($8)
	add.s	$f1, $f1, $f4
	li	$8, 648
	lw	$8, 0($8)
	addi	$9, $8, -1
	lw	$8, 16($sp)
	mv.s	$f63, $f3
	mv.s	$f3, $f1
	mv.s	$f1, $f2
	mv.s	$f2, $f63
	sw	$ra, 188($sp)
	addi	$sp, $sp, 192
	jal	pretrace_pixels..7319
	addi	$sp, $sp, -192
	lw	$ra, 188($sp)
	li	$8, 0
	li	$12, 2
	lw	$9, 8($sp)
	lw	$10, 16($sp)
	lw	$11, 24($sp)
	sw	$ra, 188($sp)
	addi	$sp, $sp, 192
	jal	scan_line..7336
	addi	$sp, $sp, -192
	lw	$ra, 188($sp)
	noop
create_array_loop:
	beq	$8, $0, beq_then.29010
	sw	$9, 0($gp)
	addi	$8, $8, -1
	addi	$gp, $gp, 4
	j	create_array_loop
beq_then.29010:
	jr	$ra
create_float_array_loop:
	beq	$8, $0, beq_then.29012
	sw.s	$f1, 0($gp)
	addi	$8, $8, -1
	addi	$gp, $gp, 4
	j	create_float_array_loop
beq_then.29012:
	jr	$ra
cos..6891:
	lui.s	$f2, 0x4049	# 3.141593の上位16ビット
	lli.s	$f2, 0xfdb	# 3.141593の下位16ビット
	ble.s	$f0, $f1, ble.s_then.29014
	neg.s	$f1, $f1
	j	cos..6891
ble.s_then.29014:
	ble.s	$f1, $f2, ble.s_then.29015
	lui.s	$f3, 0x40c9	# 6.283185の上位16ビット
	lli.s	$f3, 0xfdb	# 6.283185の下位16ビット
	ble.s	$f1, $f3, ble.s_then.29016
	lui.s	$f2, 0x40c9	# 6.283185の上位16ビット
	lli.s	$f2, 0xfdb	# 6.283185の下位16ビット
	sub.s	$f1, $f1, $f2
	j	cos..6891
ble.s_then.29016:
	sub.s	$f1, $f1, $f2
	sw	$ra, 0($sp)
	addi	$sp, $sp, 4
	jal	cos..6891
	addi	$sp, $sp, -4
	lw	$ra, 0($sp)
	neg.s	$f1, $f1
	jr	$ra
ble.s_then.29015:
	mul.s	$f1, $f1, $f1
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	lui.s	$f3, 0x3f00	# 0.500000の上位16ビット
	lui.s	$f4, 0x3d2a	# 0.041667の上位16ビット
	lli.s	$f4, 0xaaab	# 0.041667の下位16ビット
	lui.s	$f5, 0x3ab6	# 0.001389の上位16ビット
	lli.s	$f5, 0xb61	# 0.001389の下位16ビット
	lui.s	$f6, 0x37d0	# 0.000025の上位16ビット
	lli.s	$f6, 0xd01	# 0.000025の下位16ビット
	mul.s	$f6, $f1, $f6
	sub.s	$f5, $f5, $f6
	mul.s	$f5, $f1, $f5
	sub.s	$f4, $f4, $f5
	mul.s	$f4, $f1, $f4
	sub.s	$f3, $f3, $f4
	mul.s	$f1, $f1, $f3
	sub.s	$f1, $f2, $f1
	jr	$ra
sin..6893:
	lui.s	$f2, 0x4049	# 3.141593の上位16ビット
	lli.s	$f2, 0xfdb	# 3.141593の下位16ビット
	ble.s	$f0, $f1, ble.s_then.29017
	neg.s	$f1, $f1
	sw	$ra, 0($sp)
	addi	$sp, $sp, 4
	jal	sin..6893
	addi	$sp, $sp, -4
	lw	$ra, 0($sp)
	neg.s	$f1, $f1
	jr	$ra
ble.s_then.29017:
	ble.s	$f1, $f2, ble.s_then.29018
	lui.s	$f3, 0x40c9	# 6.283185の上位16ビット
	lli.s	$f3, 0xfdb	# 6.283185の下位16ビット
	ble.s	$f1, $f3, ble.s_then.29019
	lui.s	$f2, 0x40c9	# 6.283185の上位16ビット
	lli.s	$f2, 0xfdb	# 6.283185の下位16ビット
	sub.s	$f1, $f1, $f2
	j	sin..6893
ble.s_then.29019:
	sub.s	$f1, $f1, $f2
	sw	$ra, 0($sp)
	addi	$sp, $sp, 4
	jal	sin..6893
	addi	$sp, $sp, -4
	lw	$ra, 0($sp)
	neg.s	$f1, $f1
	jr	$ra
ble.s_then.29018:
	mul.s	$f2, $f1, $f1
	lui.s	$f3, 0x3f80	# 1.000000の上位16ビット
	lui.s	$f4, 0x3e2a	# 0.166667の上位16ビット
	lli.s	$f4, 0xaaab	# 0.166667の下位16ビット
	lui.s	$f5, 0x3c08	# 0.008333の上位16ビット
	lli.s	$f5, 0x8889	# 0.008333の下位16ビット
	lui.s	$f6, 0x3950	# 0.000198の上位16ビット
	lli.s	$f6, 0xd01	# 0.000198の下位16ビット
	mul.s	$f6, $f2, $f6
	sub.s	$f5, $f5, $f6
	mul.s	$f5, $f2, $f5
	sub.s	$f4, $f4, $f5
	mul.s	$f2, $f2, $f4
	sub.s	$f2, $f3, $f2
	mul.s	$f1, $f1, $f2
	jr	$ra
tan..6895:
	lui.s	$f2, 0x4049	# 3.141593の上位16ビット
	lli.s	$f2, 0xfdb	# 3.141593の下位16ビット
	ble.s	$f0, $f1, ble.s_then.29020
	neg.s	$f1, $f1
	sw	$ra, 0($sp)
	addi	$sp, $sp, 4
	jal	tan..6895
	addi	$sp, $sp, -4
	lw	$ra, 0($sp)
	neg.s	$f1, $f1
	jr	$ra
ble.s_then.29020:
	lui.s	$f3, 0x3fc9	# 1.570796の上位16ビット
	lli.s	$f3, 0xfdb	# 1.570796の下位16ビット
	ble.s	$f1, $f3, ble.s_then.29021
	sub.s	$f1, $f1, $f2
	j	tan..6895
ble.s_then.29021:
	mul.s	$f2, $f1, $f1
	lui.s	$f3, 0x3f80	# 1.000000の上位16ビット
	lui.s	$f4, 0x3eaa	# 0.333333の上位16ビット
	lli.s	$f4, 0xaaab	# 0.333333の下位16ビット
	lui.s	$f5, 0x3e08	# 0.133333の上位16ビット
	lli.s	$f5, 0x8889	# 0.133333の下位16ビット
	lui.s	$f6, 0x3d5d	# 0.053968の上位16ビット
	lli.s	$f6, 0xdd1	# 0.053968の下位16ビット
	mul.s	$f6, $f2, $f6
	add.s	$f5, $f5, $f6
	mul.s	$f5, $f2, $f5
	add.s	$f4, $f4, $f5
	mul.s	$f2, $f2, $f4
	add.s	$f2, $f3, $f2
	mul.s	$f1, $f1, $f2
	jr	$ra
read_object..7057:
	li	$9, 60
	ble	$9, $8, ble_then.29022
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$8, 0($sp)
	beq	$9, $7, beq_then.29023
	in	$10
	sll	$10, $10, 24
	in	$11
	sll	$11, $11, 16
	add	$10, $11, $10
	in	$11
	sll	$11, $11, 8
	add	$10, $11, $10
	in	$11
	add	$10, $11, $10
	in	$11
	sll	$11, $11, 24
	in	$12
	sll	$12, $12, 16
	add	$11, $12, $11
	in	$12
	sll	$12, $12, 8
	add	$11, $12, $11
	in	$12
	add	$11, $12, $11
	in	$12
	sll	$12, $12, 24
	in	$13
	sll	$13, $13, 16
	add	$12, $13, $12
	in	$13
	sll	$13, $13, 8
	add	$12, $13, $12
	in	$13
	add	$12, $13, $12
	li	$13, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$14, $gp
	sw	$9, 4($sp)
	sw	$11, 8($sp)
	sw	$10, 12($sp)
	sw	$12, 16($sp)
	sw	$14, 20($sp)
	mv	$8, $13
	sw	$ra, 24($sp)
	addi	$sp, $sp, 28
	jal	create_float_array_loop
	addi	$sp, $sp, -28
	lw	$ra, 24($sp)
	lw	$8, 20($sp)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	mv	$9, $8
	sw.s	$f1, 0($9)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	addi	$9, $8, 4
	sw.s	$f1, 0($9)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	addi	$9, $8, 8
	sw.s	$f1, 0($9)
	li	$9, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$8, 24($sp)
	sw	$10, 28($sp)
	mv	$8, $9
	sw	$ra, 32($sp)
	addi	$sp, $sp, 36
	jal	create_float_array_loop
	addi	$sp, $sp, -36
	lw	$ra, 32($sp)
	lw	$8, 28($sp)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	mv	$9, $8
	sw.s	$f1, 0($9)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	addi	$9, $8, 4
	sw.s	$f1, 0($9)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	addi	$9, $8, 8
	sw.s	$f1, 0($9)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	ble.s	$f0, $f1, ble.s_then.29025
	li	$9, 1
	j	ble.s_cont.29026
ble.s_then.29025:
	li	$9, 0
ble.s_cont.29026:
	li	$10, 2
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$11, $gp
	sw	$8, 32($sp)
	sw	$9, 36($sp)
	sw	$11, 40($sp)
	mv	$8, $10
	sw	$ra, 44($sp)
	addi	$sp, $sp, 48
	jal	create_float_array_loop
	addi	$sp, $sp, -48
	lw	$ra, 44($sp)
	lw	$8, 40($sp)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	mv	$9, $8
	sw.s	$f1, 0($9)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	addi	$9, $8, 4
	sw.s	$f1, 0($9)
	li	$9, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$8, 44($sp)
	sw	$10, 48($sp)
	mv	$8, $9
	sw	$ra, 52($sp)
	addi	$sp, $sp, 56
	jal	create_float_array_loop
	addi	$sp, $sp, -56
	lw	$ra, 52($sp)
	lw	$8, 48($sp)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	mv	$9, $8
	sw.s	$f1, 0($9)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	addi	$9, $8, 4
	sw.s	$f1, 0($9)
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	sw	$9, 16($zero)
	lw.s	$f1, 16($zero)
	addi	$9, $8, 8
	sw.s	$f1, 0($9)
	li	$9, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$8, 52($sp)
	sw	$10, 56($sp)
	mv	$8, $9
	sw	$ra, 60($sp)
	addi	$sp, $sp, 64
	jal	create_float_array_loop
	addi	$sp, $sp, -64
	lw	$ra, 60($sp)
	lw	$8, 56($sp)
	lw	$9, 16($sp)
	beq	$9, $0, beq_then.29027
	in	$10
	sll	$10, $10, 24
	in	$11
	sll	$11, $11, 16
	add	$10, $11, $10
	in	$11
	sll	$11, $11, 8
	add	$10, $11, $10
	in	$11
	add	$10, $11, $10
	sw	$10, 16($zero)
	lw.s	$f1, 16($zero)
	lui.s	$f2, 0x3c8e	# 0.017453の上位16ビット
	lli.s	$f2, 0xfa35	# 0.017453の下位16ビット
	mul.s	$f1, $f1, $f2
	mv	$10, $8
	sw.s	$f1, 0($10)
	in	$10
	sll	$10, $10, 24
	in	$11
	sll	$11, $11, 16
	add	$10, $11, $10
	in	$11
	sll	$11, $11, 8
	add	$10, $11, $10
	in	$11
	add	$10, $11, $10
	sw	$10, 16($zero)
	lw.s	$f1, 16($zero)
	lui.s	$f2, 0x3c8e	# 0.017453の上位16ビット
	lli.s	$f2, 0xfa35	# 0.017453の下位16ビット
	mul.s	$f1, $f1, $f2
	addi	$10, $8, 4
	sw.s	$f1, 0($10)
	in	$10
	sll	$10, $10, 24
	in	$11
	sll	$11, $11, 16
	add	$10, $11, $10
	in	$11
	sll	$11, $11, 8
	add	$10, $11, $10
	in	$11
	add	$10, $11, $10
	sw	$10, 16($zero)
	lw.s	$f1, 16($zero)
	lui.s	$f2, 0x3c8e	# 0.017453の上位16ビット
	lli.s	$f2, 0xfa35	# 0.017453の下位16ビット
	mul.s	$f1, $f1, $f2
	addi	$10, $8, 8
	sw.s	$f1, 0($10)
	j	beq_cont.29028
beq_then.29027:
beq_cont.29028:
	lw	$10, 12($sp)
	beq	$10, $2, beq_then.29029
	lw	$11, 36($sp)
	j	beq_cont.29030
beq_then.29029:
	li	$11, 1
beq_cont.29030:
	li	$12, 4
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$13, $gp
	sw	$11, 60($sp)
	sw	$8, 64($sp)
	sw	$13, 68($sp)
	mv	$8, $12
	sw	$ra, 72($sp)
	addi	$sp, $sp, 76
	jal	create_float_array_loop
	addi	$sp, $sp, -76
	lw	$ra, 72($sp)
	lw	$8, 68($sp)
	mv	$9, $gp
	addi	$gp, $gp, 44
	sw	$8, 40($9)
	lw	$8, 64($sp)
	sw	$8, 36($9)
	lw	$10, 52($sp)
	sw	$10, 32($9)
	lw	$10, 44($sp)
	sw	$10, 28($9)
	lw	$10, 60($sp)
	sw	$10, 24($9)
	lw	$10, 32($sp)
	sw	$10, 20($9)
	lw	$10, 24($sp)
	sw	$10, 16($9)
	lw	$11, 16($sp)
	sw	$11, 12($9)
	lw	$12, 8($sp)
	sw	$12, 8($9)
	lw	$12, 12($sp)
	sw	$12, 4($9)
	lw	$13, 4($sp)
	sw	$13, 0($9)
	lw	$13, 0($sp)
	sll	$14, $13, 2
	addi	$14, $14, 80
	sw	$9, 0($14)
	beq	$12, $3, beq_then.29031
	beq	$12, $2, beq_then.29033
	j	beq_cont.29034
beq_then.29033:
	lw	$9, 36($sp)
	beq	$9, $0, beq_then.29035
	li	$9, 0
	j	beq_cont.29036
beq_then.29035:
	li	$9, 1
beq_cont.29036:
	mv	$12, $10
	lw.s	$f1, 0($12)
	mul.s	$f1, $f1, $f1
	addi	$12, $10, 4
	lw.s	$f2, 0($12)
	mul.s	$f2, $f2, $f2
	add.s	$f1, $f1, $f2
	addi	$12, $10, 8
	lw.s	$f2, 0($12)
	mul.s	$f2, $f2, $f2
	add.s	$f1, $f1, $f2
	sqrt.s	$f1, $f1
	beq.s	$f1, $f0, beq.s_then.29037
	li	$12, 0
	j	beq.s_cont.29038
beq.s_then.29037:
	li	$12, 1
beq.s_cont.29038:
	beq	$12, $0, beq_then.29039
	lui.s	$f1, 0x3f80	# 1.000000の上位16ビット
	j	beq_cont.29040
beq_then.29039:
	beq	$9, $0, beq_then.29041
	inv.s	$f1, $f1
	neg.s	$f1, $f1
	j	beq_cont.29042
beq_then.29041:
	inv.s	$f1, $f1
beq_cont.29042:
beq_cont.29040:
	mv	$9, $10
	lw.s	$f2, 0($9)
	mul.s	$f2, $f2, $f1
	mv	$9, $10
	sw.s	$f2, 0($9)
	addi	$9, $10, 4
	lw.s	$f2, 0($9)
	mul.s	$f2, $f2, $f1
	addi	$9, $10, 4
	sw.s	$f2, 0($9)
	addi	$9, $10, 8
	lw.s	$f2, 0($9)
	mul.s	$f1, $f2, $f1
	addi	$9, $10, 8
	sw.s	$f1, 0($9)
beq_cont.29034:
	j	beq_cont.29032
beq_then.29031:
	mv	$9, $10
	lw.s	$f1, 0($9)
	beq.s	$f1, $f0, beq.s_then.29043
	li	$9, 0
	j	beq.s_cont.29044
beq.s_then.29043:
	li	$9, 1
beq.s_cont.29044:
	beq	$9, $0, beq_then.29045
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29046
beq_then.29045:
	beq.s	$f1, $f0, beq.s_then.29047
	li	$9, 0
	j	beq.s_cont.29048
beq.s_then.29047:
	li	$9, 1
beq.s_cont.29048:
	beq	$9, $0, beq_then.29049
	lui.s	$f2, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29050
beq_then.29049:
	ble.s	$f1, $f0, ble.s_then.29051
	li	$9, 1
	j	ble.s_cont.29052
ble.s_then.29051:
	li	$9, 0
ble.s_cont.29052:
	beq	$9, $0, beq_then.29053
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	j	beq_cont.29054
beq_then.29053:
	lui.s	$f2, 0xbf80	# -1.000000の上位16ビット
beq_cont.29054:
beq_cont.29050:
	mul.s	$f1, $f1, $f1
	inv.s	$f1, $f1
	mul.s	$f1, $f2, $f1
beq_cont.29046:
	mv	$9, $10
	sw.s	$f1, 0($9)
	addi	$9, $10, 4
	lw.s	$f1, 0($9)
	beq.s	$f1, $f0, beq.s_then.29055
	li	$9, 0
	j	beq.s_cont.29056
beq.s_then.29055:
	li	$9, 1
beq.s_cont.29056:
	beq	$9, $0, beq_then.29057
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29058
beq_then.29057:
	beq.s	$f1, $f0, beq.s_then.29059
	li	$9, 0
	j	beq.s_cont.29060
beq.s_then.29059:
	li	$9, 1
beq.s_cont.29060:
	beq	$9, $0, beq_then.29061
	lui.s	$f2, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29062
beq_then.29061:
	ble.s	$f1, $f0, ble.s_then.29063
	li	$9, 1
	j	ble.s_cont.29064
ble.s_then.29063:
	li	$9, 0
ble.s_cont.29064:
	beq	$9, $0, beq_then.29065
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	j	beq_cont.29066
beq_then.29065:
	lui.s	$f2, 0xbf80	# -1.000000の上位16ビット
beq_cont.29066:
beq_cont.29062:
	mul.s	$f1, $f1, $f1
	inv.s	$f1, $f1
	mul.s	$f1, $f2, $f1
beq_cont.29058:
	addi	$9, $10, 4
	sw.s	$f1, 0($9)
	addi	$9, $10, 8
	lw.s	$f1, 0($9)
	beq.s	$f1, $f0, beq.s_then.29067
	li	$9, 0
	j	beq.s_cont.29068
beq.s_then.29067:
	li	$9, 1
beq.s_cont.29068:
	beq	$9, $0, beq_then.29069
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29070
beq_then.29069:
	beq.s	$f1, $f0, beq.s_then.29071
	li	$9, 0
	j	beq.s_cont.29072
beq.s_then.29071:
	li	$9, 1
beq.s_cont.29072:
	beq	$9, $0, beq_then.29073
	lui.s	$f2, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29074
beq_then.29073:
	ble.s	$f1, $f0, ble.s_then.29075
	li	$9, 1
	j	ble.s_cont.29076
ble.s_then.29075:
	li	$9, 0
ble.s_cont.29076:
	beq	$9, $0, beq_then.29077
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	j	beq_cont.29078
beq_then.29077:
	lui.s	$f2, 0xbf80	# -1.000000の上位16ビット
beq_cont.29078:
beq_cont.29074:
	mul.s	$f1, $f1, $f1
	inv.s	$f1, $f1
	mul.s	$f1, $f2, $f1
beq_cont.29070:
	addi	$9, $10, 8
	sw.s	$f1, 0($9)
beq_cont.29032:
	beq	$11, $0, beq_then.29079
	mv	$9, $8
	lw.s	$f1, 0($9)
	sw	$ra, 72($sp)
	addi	$sp, $sp, 76
	jal	cos..6891
	addi	$sp, $sp, -76
	lw	$ra, 72($sp)
	lw	$8, 64($sp)
	mv	$9, $8
	lw.s	$f2, 0($9)
	sw.s	$f1, 72($sp)
	mv.s	$f1, $f2
	sw	$ra, 76($sp)
	addi	$sp, $sp, 80
	jal	sin..6893
	addi	$sp, $sp, -80
	lw	$ra, 76($sp)
	lw	$8, 64($sp)
	addi	$9, $8, 4
	lw.s	$f2, 0($9)
	sw.s	$f1, 76($sp)
	mv.s	$f1, $f2
	sw	$ra, 80($sp)
	addi	$sp, $sp, 84
	jal	cos..6891
	addi	$sp, $sp, -84
	lw	$ra, 80($sp)
	lw	$8, 64($sp)
	addi	$9, $8, 4
	lw.s	$f2, 0($9)
	sw.s	$f1, 80($sp)
	mv.s	$f1, $f2
	sw	$ra, 84($sp)
	addi	$sp, $sp, 88
	jal	sin..6893
	addi	$sp, $sp, -88
	lw	$ra, 84($sp)
	lw	$8, 64($sp)
	addi	$9, $8, 8
	lw.s	$f2, 0($9)
	sw.s	$f1, 84($sp)
	mv.s	$f1, $f2
	sw	$ra, 88($sp)
	addi	$sp, $sp, 92
	jal	cos..6891
	addi	$sp, $sp, -92
	lw	$ra, 88($sp)
	lw	$8, 64($sp)
	addi	$9, $8, 8
	lw.s	$f2, 0($9)
	sw.s	$f1, 88($sp)
	mv.s	$f1, $f2
	sw	$ra, 92($sp)
	addi	$sp, $sp, 96
	jal	sin..6893
	addi	$sp, $sp, -96
	lw	$ra, 92($sp)
	lw.s	$f2, 88($sp)
	lw.s	$f3, 80($sp)
	mul.s	$f4, $f3, $f2
	lw.s	$f5, 84($sp)
	lw.s	$f6, 76($sp)
	mul.s	$f7, $f6, $f5
	mul.s	$f7, $f7, $f2
	lw.s	$f8, 72($sp)
	mul.s	$f9, $f8, $f1
	sub.s	$f7, $f7, $f9
	mul.s	$f9, $f8, $f5
	mul.s	$f9, $f9, $f2
	mul.s	$f10, $f6, $f1
	add.s	$f9, $f9, $f10
	mul.s	$f10, $f3, $f1
	mul.s	$f11, $f6, $f5
	mul.s	$f11, $f11, $f1
	mul.s	$f12, $f8, $f2
	add.s	$f11, $f11, $f12
	mul.s	$f12, $f8, $f5
	mul.s	$f1, $f12, $f1
	mul.s	$f2, $f6, $f2
	sub.s	$f1, $f1, $f2
	neg.s	$f2, $f5
	mul.s	$f5, $f6, $f3
	mul.s	$f3, $f8, $f3
	lw	$8, 24($sp)
	mv	$9, $8
	lw.s	$f6, 0($9)
	addi	$9, $8, 4
	lw.s	$f8, 0($9)
	addi	$9, $8, 8
	lw.s	$f12, 0($9)
	mul.s	$f13, $f4, $f4
	mul.s	$f13, $f6, $f13
	mul.s	$f14, $f10, $f10
	mul.s	$f14, $f8, $f14
	add.s	$f13, $f13, $f14
	mul.s	$f14, $f2, $f2
	mul.s	$f14, $f12, $f14
	add.s	$f13, $f13, $f14
	mv	$9, $8
	sw.s	$f13, 0($9)
	mul.s	$f13, $f7, $f7
	mul.s	$f13, $f6, $f13
	mul.s	$f14, $f11, $f11
	mul.s	$f14, $f8, $f14
	add.s	$f13, $f13, $f14
	mul.s	$f14, $f5, $f5
	mul.s	$f14, $f12, $f14
	add.s	$f13, $f13, $f14
	addi	$9, $8, 4
	sw.s	$f13, 0($9)
	mul.s	$f13, $f9, $f9
	mul.s	$f13, $f6, $f13
	mul.s	$f14, $f1, $f1
	mul.s	$f14, $f8, $f14
	add.s	$f13, $f13, $f14
	mul.s	$f14, $f3, $f3
	mul.s	$f14, $f12, $f14
	add.s	$f13, $f13, $f14
	addi	$8, $8, 8
	sw.s	$f13, 0($8)
	lui.s	$f13, 0x4000	# 2.000000の上位16ビット
	mul.s	$f14, $f6, $f7
	mul.s	$f14, $f14, $f9
	mul.s	$f15, $f8, $f11
	mul.s	$f15, $f15, $f1
	add.s	$f14, $f14, $f15
	mul.s	$f15, $f12, $f5
	mul.s	$f15, $f15, $f3
	add.s	$f14, $f14, $f15
	mul.s	$f13, $f13, $f14
	lw	$8, 64($sp)
	mv	$9, $8
	sw.s	$f13, 0($9)
	lui.s	$f13, 0x4000	# 2.000000の上位16ビット
	mul.s	$f14, $f6, $f4
	mul.s	$f9, $f14, $f9
	mul.s	$f14, $f8, $f10
	mul.s	$f1, $f14, $f1
	add.s	$f1, $f9, $f1
	mul.s	$f9, $f12, $f2
	mul.s	$f3, $f9, $f3
	add.s	$f1, $f1, $f3
	mul.s	$f1, $f13, $f1
	addi	$9, $8, 4
	sw.s	$f1, 0($9)
	lui.s	$f1, 0x4000	# 2.000000の上位16ビット
	mul.s	$f3, $f6, $f4
	mul.s	$f3, $f3, $f7
	mul.s	$f4, $f8, $f10
	mul.s	$f4, $f4, $f11
	add.s	$f3, $f3, $f4
	mul.s	$f2, $f12, $f2
	mul.s	$f2, $f2, $f5
	add.s	$f2, $f3, $f2
	mul.s	$f1, $f1, $f2
	addi	$8, $8, 8
	sw.s	$f1, 0($8)
	j	beq_cont.29080
beq_then.29079:
beq_cont.29080:
	li	$8, 1
	j	beq_cont.29024
beq_then.29023:
	li	$8, 0
beq_cont.29024:
	beq	$8, $0, beq_then.29081
	lw	$8, 0($sp)
	addi	$8, $8, 1
	j	read_object..7057
beq_then.29081:
	li	$8, 32
	lw	$9, 0($sp)
	sw	$9, 0($8)
	jr	$ra
ble_then.29022:
	jr	$ra
read_net_item..7061:
	in	$9
	sll	$9, $9, 24
	in	$10
	sll	$10, $10, 16
	add	$9, $10, $9
	in	$10
	sll	$10, $10, 8
	add	$9, $10, $9
	in	$10
	add	$9, $10, $9
	beq	$9, $7, beq_then.29084
	addi	$10, $8, 1
	sw	$9, 0($sp)
	sw	$8, 4($sp)
	mv	$8, $10
	sw	$ra, 8($sp)
	addi	$sp, $sp, 12
	jal	read_net_item..7061
	addi	$sp, $sp, -12
	lw	$ra, 8($sp)
	lw	$9, 4($sp)
	sll	$9, $9, 2
	add	$9, $8, $9
	lw	$10, 0($sp)
	sw	$10, 0($9)
	jr	$ra
beq_then.29084:
	addi	$8, $8, 1
	li	$9, -1
	mv	$10, $gp
	sw	$10, 8($sp)
	sw	$ra, 12($sp)
	addi	$sp, $sp, 16
	jal	create_array_loop
	addi	$sp, $sp, -16
	lw	$ra, 12($sp)
	lw	$8, 8($sp)
	jr	$ra
read_or_network..7063:
	li	$9, 0
	sw	$8, 0($sp)
	mv	$8, $9
	sw	$ra, 4($sp)
	addi	$sp, $sp, 8
	jal	read_net_item..7061
	addi	$sp, $sp, -8
	lw	$ra, 4($sp)
	mv	$9, $8
	mv	$8, $9
	lw	$8, 0($8)
	beq	$8, $7, beq_then.29085
	lw	$8, 0($sp)
	addi	$10, $8, 1
	sw	$9, 4($sp)
	mv	$8, $10
	sw	$ra, 8($sp)
	addi	$sp, $sp, 12
	jal	read_or_network..7063
	addi	$sp, $sp, -12
	lw	$ra, 8($sp)
	lw	$9, 0($sp)
	sll	$9, $9, 2
	add	$9, $8, $9
	lw	$10, 4($sp)
	sw	$10, 0($9)
	jr	$ra
beq_then.29085:
	lw	$8, 0($sp)
	addi	$8, $8, 1
	mv	$10, $gp
	sw	$10, 8($sp)
	sw	$ra, 12($sp)
	addi	$sp, $sp, 16
	jal	create_array_loop
	addi	$sp, $sp, -16
	lw	$ra, 12($sp)
	lw	$8, 8($sp)
	jr	$ra
read_and_network..7065:
	li	$9, 0
	sw	$8, 0($sp)
	mv	$8, $9
	sw	$ra, 4($sp)
	addi	$sp, $sp, 8
	jal	read_net_item..7061
	addi	$sp, $sp, -8
	lw	$ra, 4($sp)
	mv	$9, $8
	lw	$9, 0($9)
	beq	$9, $7, beq_then.29086
	lw	$9, 0($sp)
	sll	$10, $9, 2
	addi	$10, $10, 364
	sw	$8, 0($10)
	addi	$8, $9, 1
	j	read_and_network..7065
beq_then.29086:
	jr	$ra
iter_setup_dirvec_constants..7162:
	ble	$0, $9, ble_then.29088
	jr	$ra
ble_then.29088:
	sll	$10, $9, 2
	addi	$10, $10, 80
	lw	$10, 0($10)
	lw	$11, 4($8)
	lw	$12, 0($8)
	lw	$13, 4($10)
	sw	$8, 0($sp)
	beq	$13, $1, beq_then.29090
	beq	$13, $2, beq_then.29092
	li	$13, 5
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$14, $gp
	sw	$11, 4($sp)
	sw	$9, 8($sp)
	sw	$10, 12($sp)
	sw	$12, 16($sp)
	sw	$14, 20($sp)
	mv	$8, $13
	sw	$ra, 24($sp)
	addi	$sp, $sp, 28
	jal	create_float_array_loop
	addi	$sp, $sp, -28
	lw	$ra, 24($sp)
	lw	$8, 20($sp)
	lw	$9, 16($sp)
	mv	$10, $9
	lw.s	$f1, 0($10)
	addi	$10, $9, 4
	lw.s	$f2, 0($10)
	addi	$10, $9, 8
	lw.s	$f3, 0($10)
	mul.s	$f4, $f1, $f1
	lw	$10, 12($sp)
	lw	$11, 16($10)
	lw.s	$f5, 0($11)
	mul.s	$f4, $f4, $f5
	mul.s	$f5, $f2, $f2
	lw	$11, 16($10)
	addi	$11, $11, 4
	lw.s	$f6, 0($11)
	mul.s	$f5, $f5, $f6
	add.s	$f4, $f4, $f5
	mul.s	$f5, $f3, $f3
	lw	$11, 16($10)
	addi	$11, $11, 8
	lw.s	$f6, 0($11)
	mul.s	$f5, $f5, $f6
	add.s	$f4, $f4, $f5
	lw	$11, 12($10)
	beq	$11, $0, beq_then.29094
	mul.s	$f5, $f2, $f3
	lw	$11, 36($10)
	lw.s	$f6, 0($11)
	mul.s	$f5, $f5, $f6
	add.s	$f4, $f4, $f5
	mul.s	$f3, $f3, $f1
	lw	$11, 36($10)
	addi	$11, $11, 4
	lw.s	$f5, 0($11)
	mul.s	$f3, $f3, $f5
	add.s	$f3, $f4, $f3
	mul.s	$f1, $f1, $f2
	lw	$11, 36($10)
	addi	$11, $11, 8
	lw.s	$f2, 0($11)
	mul.s	$f1, $f1, $f2
	add.s	$f1, $f3, $f1
	j	beq_cont.29095
beq_then.29094:
	mv.s	$f1, $f4
beq_cont.29095:
	mv	$11, $9
	lw.s	$f2, 0($11)
	lw	$11, 16($10)
	lw.s	$f3, 0($11)
	mul.s	$f2, $f2, $f3
	neg.s	$f2, $f2
	addi	$11, $9, 4
	lw.s	$f3, 0($11)
	lw	$11, 16($10)
	addi	$11, $11, 4
	lw.s	$f4, 0($11)
	mul.s	$f3, $f3, $f4
	neg.s	$f3, $f3
	addi	$11, $9, 8
	lw.s	$f4, 0($11)
	lw	$11, 16($10)
	addi	$11, $11, 8
	lw.s	$f5, 0($11)
	mul.s	$f4, $f4, $f5
	neg.s	$f4, $f4
	mv	$11, $8
	sw.s	$f1, 0($11)
	lw	$11, 12($10)
	beq	$11, $0, beq_then.29096
	addi	$11, $9, 8
	lw.s	$f5, 0($11)
	lw	$11, 36($10)
	addi	$11, $11, 4
	lw.s	$f6, 0($11)
	mul.s	$f5, $f5, $f6
	addi	$11, $9, 4
	lw.s	$f6, 0($11)
	lw	$11, 36($10)
	addi	$11, $11, 8
	lw.s	$f7, 0($11)
	mul.s	$f6, $f6, $f7
	add.s	$f5, $f5, $f6
	lui.s	$f6, 0x3f00	# 0.500000の上位16ビット
	mul.s	$f5, $f5, $f6
	sub.s	$f2, $f2, $f5
	addi	$11, $8, 4
	sw.s	$f2, 0($11)
	addi	$11, $9, 8
	lw.s	$f2, 0($11)
	lw	$11, 36($10)
	lw.s	$f5, 0($11)
	mul.s	$f2, $f2, $f5
	mv	$11, $9
	lw.s	$f5, 0($11)
	lw	$11, 36($10)
	addi	$11, $11, 8
	lw.s	$f6, 0($11)
	mul.s	$f5, $f5, $f6
	add.s	$f2, $f2, $f5
	lui.s	$f5, 0x3f00	# 0.500000の上位16ビット
	mul.s	$f2, $f2, $f5
	sub.s	$f2, $f3, $f2
	addi	$11, $8, 8
	sw.s	$f2, 0($11)
	addi	$11, $9, 4
	lw.s	$f2, 0($11)
	lw	$11, 36($10)
	lw.s	$f3, 0($11)
	mul.s	$f2, $f2, $f3
	lw.s	$f3, 0($9)
	lw	$9, 36($10)
	addi	$9, $9, 4
	lw.s	$f5, 0($9)
	mul.s	$f3, $f3, $f5
	add.s	$f2, $f2, $f3
	lui.s	$f3, 0x3f00	# 0.500000の上位16ビット
	mul.s	$f2, $f2, $f3
	sub.s	$f2, $f4, $f2
	addi	$9, $8, 12
	sw.s	$f2, 0($9)
	j	beq_cont.29097
beq_then.29096:
	addi	$9, $8, 4
	sw.s	$f2, 0($9)
	addi	$9, $8, 8
	sw.s	$f3, 0($9)
	addi	$9, $8, 12
	sw.s	$f4, 0($9)
beq_cont.29097:
	beq.s	$f1, $f0, beq.s_then.29098
	li	$9, 0
	j	beq.s_cont.29099
beq.s_then.29098:
	li	$9, 1
beq.s_cont.29099:
	beq	$9, $0, beq_then.29100
	li	$9, 0
	j	beq_cont.29101
beq_then.29100:
	li	$9, 1
beq_cont.29101:
	beq	$9, $0, beq_then.29102
	inv.s	$f1, $f1
	addi	$9, $8, 16
	sw.s	$f1, 0($9)
	j	beq_cont.29103
beq_then.29102:
beq_cont.29103:
	lw	$9, 8($sp)
	sll	$10, $9, 2
	lw	$11, 4($sp)
	add	$10, $11, $10
	sw	$8, 0($10)
	j	beq_cont.29093
beq_then.29092:
	li	$13, 4
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$14, $gp
	sw	$11, 4($sp)
	sw	$9, 8($sp)
	sw	$10, 12($sp)
	sw	$12, 16($sp)
	sw	$14, 24($sp)
	mv	$8, $13
	sw	$ra, 28($sp)
	addi	$sp, $sp, 32
	jal	create_float_array_loop
	addi	$sp, $sp, -32
	lw	$ra, 28($sp)
	lw	$8, 24($sp)
	lw	$9, 16($sp)
	mv	$10, $9
	lw.s	$f1, 0($10)
	lw	$10, 12($sp)
	lw	$11, 16($10)
	lw.s	$f2, 0($11)
	mul.s	$f1, $f1, $f2
	addi	$11, $9, 4
	lw.s	$f2, 0($11)
	lw	$11, 16($10)
	addi	$11, $11, 4
	lw.s	$f3, 0($11)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	addi	$9, $9, 8
	lw.s	$f2, 0($9)
	lw	$9, 16($10)
	addi	$9, $9, 8
	lw.s	$f3, 0($9)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	ble.s	$f1, $f0, ble.s_then.29104
	li	$9, 1
	j	ble.s_cont.29105
ble.s_then.29104:
	li	$9, 0
ble.s_cont.29105:
	beq	$9, $0, beq_then.29106
	inv.s	$f2, $f1
	neg.s	$f2, $f2
	mv	$9, $8
	sw.s	$f2, 0($9)
	lw	$9, 16($10)
	lw.s	$f2, 0($9)
	inv.s	$f3, $f1
	mul.s	$f2, $f2, $f3
	neg.s	$f2, $f2
	addi	$9, $8, 4
	sw.s	$f2, 0($9)
	lw	$9, 16($10)
	addi	$9, $9, 4
	lw.s	$f2, 0($9)
	inv.s	$f3, $f1
	mul.s	$f2, $f2, $f3
	neg.s	$f2, $f2
	addi	$9, $8, 8
	sw.s	$f2, 0($9)
	lw	$9, 16($10)
	addi	$9, $9, 8
	lw.s	$f2, 0($9)
	inv.s	$f1, $f1
	mul.s	$f1, $f2, $f1
	neg.s	$f1, $f1
	addi	$9, $8, 12
	sw.s	$f1, 0($9)
	j	beq_cont.29107
beq_then.29106:
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$9, $8
	sw.s	$f1, 0($9)
beq_cont.29107:
	lw	$9, 8($sp)
	sll	$10, $9, 2
	lw	$11, 4($sp)
	add	$10, $11, $10
	sw	$8, 0($10)
beq_cont.29093:
	j	beq_cont.29091
beq_then.29090:
	li	$13, 6
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$14, $gp
	sw	$11, 4($sp)
	sw	$9, 8($sp)
	sw	$10, 12($sp)
	sw	$12, 16($sp)
	sw	$14, 28($sp)
	mv	$8, $13
	sw	$ra, 32($sp)
	addi	$sp, $sp, 36
	jal	create_float_array_loop
	addi	$sp, $sp, -36
	lw	$ra, 32($sp)
	lw	$8, 28($sp)
	lw	$9, 16($sp)
	mv	$10, $9
	lw.s	$f1, 0($10)
	beq.s	$f1, $f0, beq.s_then.29108
	li	$10, 0
	j	beq.s_cont.29109
beq.s_then.29108:
	li	$10, 1
beq.s_cont.29109:
	beq	$10, $0, beq_then.29110
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	addi	$10, $8, 4
	sw.s	$f1, 0($10)
	j	beq_cont.29111
beq_then.29110:
	lw	$10, 12($sp)
	lw	$11, 24($10)
	mv	$12, $9
	lw.s	$f1, 0($12)
	ble.s	$f0, $f1, ble.s_then.29112
	li	$12, 1
	j	ble.s_cont.29113
ble.s_then.29112:
	li	$12, 0
ble.s_cont.29113:
	beq	$11, $12, beq_then.29114
	li	$11, 1
	j	beq_cont.29115
beq_then.29114:
	li	$11, 0
beq_cont.29115:
	lw	$12, 16($10)
	lw.s	$f1, 0($12)
	beq	$11, $0, beq_then.29116
	j	beq_cont.29117
beq_then.29116:
	neg.s	$f1, $f1
beq_cont.29117:
	mv	$11, $8
	sw.s	$f1, 0($11)
	mv	$11, $9
	lw.s	$f1, 0($11)
	inv.s	$f1, $f1
	addi	$11, $8, 4
	sw.s	$f1, 0($11)
beq_cont.29111:
	addi	$10, $9, 4
	lw.s	$f1, 0($10)
	beq.s	$f1, $f0, beq.s_then.29118
	li	$10, 0
	j	beq.s_cont.29119
beq.s_then.29118:
	li	$10, 1
beq.s_cont.29119:
	beq	$10, $0, beq_then.29120
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	addi	$10, $8, 12
	sw.s	$f1, 0($10)
	j	beq_cont.29121
beq_then.29120:
	lw	$10, 12($sp)
	lw	$11, 24($10)
	addi	$12, $9, 4
	lw.s	$f1, 0($12)
	ble.s	$f0, $f1, ble.s_then.29122
	li	$12, 1
	j	ble.s_cont.29123
ble.s_then.29122:
	li	$12, 0
ble.s_cont.29123:
	beq	$11, $12, beq_then.29124
	li	$11, 1
	j	beq_cont.29125
beq_then.29124:
	li	$11, 0
beq_cont.29125:
	lw	$12, 16($10)
	addi	$12, $12, 4
	lw.s	$f1, 0($12)
	beq	$11, $0, beq_then.29126
	j	beq_cont.29127
beq_then.29126:
	neg.s	$f1, $f1
beq_cont.29127:
	addi	$11, $8, 8
	sw.s	$f1, 0($11)
	addi	$11, $9, 4
	lw.s	$f1, 0($11)
	inv.s	$f1, $f1
	addi	$11, $8, 12
	sw.s	$f1, 0($11)
beq_cont.29121:
	addi	$10, $9, 8
	lw.s	$f1, 0($10)
	beq.s	$f1, $f0, beq.s_then.29128
	li	$10, 0
	j	beq.s_cont.29129
beq.s_then.29128:
	li	$10, 1
beq.s_cont.29129:
	beq	$10, $0, beq_then.29130
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	addi	$9, $8, 20
	sw.s	$f1, 0($9)
	j	beq_cont.29131
beq_then.29130:
	lw	$10, 12($sp)
	lw	$11, 24($10)
	addi	$12, $9, 8
	lw.s	$f1, 0($12)
	ble.s	$f0, $f1, ble.s_then.29132
	li	$12, 1
	j	ble.s_cont.29133
ble.s_then.29132:
	li	$12, 0
ble.s_cont.29133:
	beq	$11, $12, beq_then.29134
	li	$11, 1
	j	beq_cont.29135
beq_then.29134:
	li	$11, 0
beq_cont.29135:
	lw	$10, 16($10)
	addi	$10, $10, 8
	lw.s	$f1, 0($10)
	beq	$11, $0, beq_then.29136
	j	beq_cont.29137
beq_then.29136:
	neg.s	$f1, $f1
beq_cont.29137:
	addi	$10, $8, 16
	sw.s	$f1, 0($10)
	addi	$9, $9, 8
	lw.s	$f1, 0($9)
	inv.s	$f1, $f1
	addi	$9, $8, 20
	sw.s	$f1, 0($9)
beq_cont.29131:
	lw	$9, 8($sp)
	sll	$10, $9, 2
	lw	$11, 4($sp)
	add	$10, $11, $10
	sw	$8, 0($10)
beq_cont.29091:
	addi	$9, $9, -1
	lw	$8, 0($sp)
	j	iter_setup_dirvec_constants..7162
setup_startp_constants..7167:
	ble	$0, $9, ble_then.29138
	jr	$ra
ble_then.29138:
	sll	$10, $9, 2
	addi	$10, $10, 80
	lw	$10, 0($10)
	lw	$11, 40($10)
	lw	$12, 4($10)
	mv	$13, $8
	lw.s	$f1, 0($13)
	lw	$13, 20($10)
	lw.s	$f2, 0($13)
	sub.s	$f1, $f1, $f2
	mv	$13, $11
	sw.s	$f1, 0($13)
	addi	$13, $8, 4
	lw.s	$f1, 0($13)
	lw	$13, 20($10)
	addi	$13, $13, 4
	lw.s	$f2, 0($13)
	sub.s	$f1, $f1, $f2
	addi	$13, $11, 4
	sw.s	$f1, 0($13)
	addi	$13, $8, 8
	lw.s	$f1, 0($13)
	lw	$13, 20($10)
	addi	$13, $13, 8
	lw.s	$f2, 0($13)
	sub.s	$f1, $f1, $f2
	addi	$13, $11, 8
	sw.s	$f1, 0($13)
	beq	$12, $2, beq_then.29140
	ble	$12, $2, ble_then.29142
	mv	$13, $11
	lw.s	$f1, 0($13)
	addi	$13, $11, 4
	lw.s	$f2, 0($13)
	addi	$13, $11, 8
	lw.s	$f3, 0($13)
	mul.s	$f4, $f1, $f1
	lw	$13, 16($10)
	lw.s	$f5, 0($13)
	mul.s	$f4, $f4, $f5
	mul.s	$f5, $f2, $f2
	lw	$13, 16($10)
	addi	$13, $13, 4
	lw.s	$f6, 0($13)
	mul.s	$f5, $f5, $f6
	add.s	$f4, $f4, $f5
	mul.s	$f5, $f3, $f3
	lw	$13, 16($10)
	addi	$13, $13, 8
	lw.s	$f6, 0($13)
	mul.s	$f5, $f5, $f6
	add.s	$f4, $f4, $f5
	lw	$13, 12($10)
	beq	$13, $0, beq_then.29144
	mul.s	$f5, $f2, $f3
	lw	$13, 36($10)
	lw.s	$f6, 0($13)
	mul.s	$f5, $f5, $f6
	add.s	$f4, $f4, $f5
	mul.s	$f3, $f3, $f1
	lw	$13, 36($10)
	addi	$13, $13, 4
	lw.s	$f5, 0($13)
	mul.s	$f3, $f3, $f5
	add.s	$f3, $f4, $f3
	mul.s	$f1, $f1, $f2
	lw	$10, 36($10)
	addi	$10, $10, 8
	lw.s	$f2, 0($10)
	mul.s	$f1, $f1, $f2
	add.s	$f1, $f3, $f1
	j	beq_cont.29145
beq_then.29144:
	mv.s	$f1, $f4
beq_cont.29145:
	beq	$12, $3, beq_then.29146
	j	beq_cont.29147
beq_then.29146:
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f1, $f1, $f2
beq_cont.29147:
	addi	$10, $11, 12
	sw.s	$f1, 0($10)
	j	ble_cont.29143
ble_then.29142:
ble_cont.29143:
	j	beq_cont.29141
beq_then.29140:
	lw	$10, 16($10)
	mv	$12, $11
	lw.s	$f1, 0($12)
	addi	$12, $11, 4
	lw.s	$f2, 0($12)
	addi	$12, $11, 8
	lw.s	$f3, 0($12)
	mv	$12, $10
	lw.s	$f4, 0($12)
	mul.s	$f1, $f4, $f1
	addi	$12, $10, 4
	lw.s	$f4, 0($12)
	mul.s	$f2, $f4, $f2
	add.s	$f1, $f1, $f2
	addi	$10, $10, 8
	lw.s	$f2, 0($10)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	addi	$10, $11, 12
	sw.s	$f1, 0($10)
beq_cont.29141:
	addi	$9, $9, -1
	j	setup_startp_constants..7167
check_all_inside..7192:
	sll	$10, $8, 2
	add	$10, $9, $10
	lw	$10, 0($10)
	beq	$10, $7, beq_then.29148
	sll	$10, $10, 2
	addi	$10, $10, 80
	lw	$10, 0($10)
	lw	$11, 20($10)
	lw.s	$f4, 0($11)
	sub.s	$f4, $f1, $f4
	lw	$11, 20($10)
	addi	$11, $11, 4
	lw.s	$f5, 0($11)
	sub.s	$f5, $f2, $f5
	lw	$11, 20($10)
	addi	$11, $11, 8
	lw.s	$f6, 0($11)
	sub.s	$f6, $f3, $f6
	lw	$11, 4($10)
	beq	$11, $1, beq_then.29149
	beq	$11, $2, beq_then.29151
	mul.s	$f7, $f4, $f4
	lw	$11, 16($10)
	lw.s	$f8, 0($11)
	mul.s	$f7, $f7, $f8
	mul.s	$f8, $f5, $f5
	lw	$11, 16($10)
	addi	$11, $11, 4
	lw.s	$f9, 0($11)
	mul.s	$f8, $f8, $f9
	add.s	$f7, $f7, $f8
	mul.s	$f8, $f6, $f6
	lw	$11, 16($10)
	addi	$11, $11, 8
	lw.s	$f9, 0($11)
	mul.s	$f8, $f8, $f9
	add.s	$f7, $f7, $f8
	lw	$11, 12($10)
	beq	$11, $0, beq_then.29153
	mul.s	$f8, $f5, $f6
	lw	$11, 36($10)
	lw.s	$f9, 0($11)
	mul.s	$f8, $f8, $f9
	add.s	$f7, $f7, $f8
	mul.s	$f6, $f6, $f4
	lw	$11, 36($10)
	addi	$11, $11, 4
	lw.s	$f8, 0($11)
	mul.s	$f6, $f6, $f8
	add.s	$f6, $f7, $f6
	mul.s	$f4, $f4, $f5
	lw	$11, 36($10)
	addi	$11, $11, 8
	lw.s	$f5, 0($11)
	mul.s	$f4, $f4, $f5
	add.s	$f4, $f6, $f4
	j	beq_cont.29154
beq_then.29153:
	mv.s	$f4, $f7
beq_cont.29154:
	lw	$11, 4($10)
	beq	$11, $3, beq_then.29155
	j	beq_cont.29156
beq_then.29155:
	lui.s	$f5, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f4, $f4, $f5
beq_cont.29156:
	lw	$10, 24($10)
	ble.s	$f0, $f4, ble.s_then.29157
	li	$11, 1
	j	ble.s_cont.29158
ble.s_then.29157:
	li	$11, 0
ble.s_cont.29158:
	beq	$10, $11, beq_then.29159
	li	$10, 1
	j	beq_cont.29160
beq_then.29159:
	li	$10, 0
beq_cont.29160:
	beq	$10, $0, beq_then.29161
	li	$10, 0
	j	beq_cont.29162
beq_then.29161:
	li	$10, 1
beq_cont.29162:
	j	beq_cont.29152
beq_then.29151:
	lw	$11, 16($10)
	mv	$12, $11
	lw.s	$f7, 0($12)
	mul.s	$f4, $f7, $f4
	addi	$12, $11, 4
	lw.s	$f7, 0($12)
	mul.s	$f5, $f7, $f5
	add.s	$f4, $f4, $f5
	addi	$11, $11, 8
	lw.s	$f5, 0($11)
	mul.s	$f5, $f5, $f6
	add.s	$f4, $f4, $f5
	lw	$10, 24($10)
	ble.s	$f0, $f4, ble.s_then.29163
	li	$11, 1
	j	ble.s_cont.29164
ble.s_then.29163:
	li	$11, 0
ble.s_cont.29164:
	beq	$10, $11, beq_then.29165
	li	$10, 1
	j	beq_cont.29166
beq_then.29165:
	li	$10, 0
beq_cont.29166:
	beq	$10, $0, beq_then.29167
	li	$10, 0
	j	beq_cont.29168
beq_then.29167:
	li	$10, 1
beq_cont.29168:
beq_cont.29152:
	j	beq_cont.29150
beq_then.29149:
	abs.s	$f4, $f4
	lw	$11, 16($10)
	lw.s	$f7, 0($11)
	ble.s	$f7, $f4, ble.s_then.29169
	li	$11, 1
	j	ble.s_cont.29170
ble.s_then.29169:
	li	$11, 0
ble.s_cont.29170:
	beq	$11, $0, beq_then.29171
	abs.s	$f4, $f5
	lw	$11, 16($10)
	addi	$11, $11, 4
	lw.s	$f5, 0($11)
	ble.s	$f5, $f4, ble.s_then.29173
	li	$11, 1
	j	ble.s_cont.29174
ble.s_then.29173:
	li	$11, 0
ble.s_cont.29174:
	beq	$11, $0, beq_then.29175
	abs.s	$f4, $f6
	lw	$11, 16($10)
	addi	$11, $11, 8
	lw.s	$f5, 0($11)
	ble.s	$f5, $f4, ble.s_then.29177
	li	$11, 1
	j	ble.s_cont.29178
ble.s_then.29177:
	li	$11, 0
ble.s_cont.29178:
	j	beq_cont.29176
beq_then.29175:
	li	$11, 0
beq_cont.29176:
	j	beq_cont.29172
beq_then.29171:
	li	$11, 0
beq_cont.29172:
	beq	$11, $0, beq_then.29179
	lw	$10, 24($10)
	j	beq_cont.29180
beq_then.29179:
	lw	$10, 24($10)
	beq	$10, $0, beq_then.29181
	li	$10, 0
	j	beq_cont.29182
beq_then.29181:
	li	$10, 1
beq_cont.29182:
beq_cont.29180:
beq_cont.29150:
	beq	$10, $0, beq_then.29183
	li	$8, 0
	jr	$ra
beq_then.29183:
	addi	$8, $8, 1
	j	check_all_inside..7192
beq_then.29148:
	li	$8, 1
	jr	$ra
shadow_check_and_group..7198:
	li	$10, 1020
	sll	$11, $8, 2
	add	$11, $9, $11
	lw	$11, 0($11)
	beq	$11, $7, beq_then.29184
	sll	$11, $8, 2
	add	$11, $9, $11
	lw	$11, 0($11)
	sll	$12, $11, 2
	addi	$12, $12, 80
	lw	$12, 0($12)
	li	$13, 584
	lw.s	$f1, 0($13)
	lw	$13, 20($12)
	lw.s	$f2, 0($13)
	sub.s	$f1, $f1, $f2
	li	$13, 588
	lw.s	$f2, 0($13)
	lw	$13, 20($12)
	addi	$13, $13, 4
	lw.s	$f3, 0($13)
	sub.s	$f2, $f2, $f3
	li	$13, 592
	lw.s	$f3, 0($13)
	lw	$13, 20($12)
	addi	$13, $13, 8
	lw.s	$f4, 0($13)
	sub.s	$f3, $f3, $f4
	lw	$13, 4($10)
	sll	$14, $11, 2
	add	$13, $13, $14
	lw	$13, 0($13)
	lw	$14, 4($12)
	beq	$14, $1, beq_then.29185
	beq	$14, $2, beq_then.29187
	mv	$10, $13
	lw.s	$f4, 0($10)
	beq.s	$f4, $f0, beq.s_then.29189
	li	$10, 0
	j	beq.s_cont.29190
beq.s_then.29189:
	li	$10, 1
beq.s_cont.29190:
	beq	$10, $0, beq_then.29191
	li	$10, 0
	j	beq_cont.29192
beq_then.29191:
	addi	$10, $13, 4
	lw.s	$f5, 0($10)
	mul.s	$f5, $f5, $f1
	addi	$10, $13, 8
	lw.s	$f6, 0($10)
	mul.s	$f6, $f6, $f2
	add.s	$f5, $f5, $f6
	addi	$10, $13, 12
	lw.s	$f6, 0($10)
	mul.s	$f6, $f6, $f3
	add.s	$f5, $f5, $f6
	mul.s	$f6, $f1, $f1
	lw	$10, 16($12)
	lw.s	$f7, 0($10)
	mul.s	$f6, $f6, $f7
	mul.s	$f7, $f2, $f2
	lw	$10, 16($12)
	addi	$10, $10, 4
	lw.s	$f8, 0($10)
	mul.s	$f7, $f7, $f8
	add.s	$f6, $f6, $f7
	mul.s	$f7, $f3, $f3
	lw	$10, 16($12)
	addi	$10, $10, 8
	lw.s	$f8, 0($10)
	mul.s	$f7, $f7, $f8
	add.s	$f6, $f6, $f7
	lw	$10, 12($12)
	beq	$10, $0, beq_then.29193
	mul.s	$f7, $f2, $f3
	lw	$10, 36($12)
	lw.s	$f8, 0($10)
	mul.s	$f7, $f7, $f8
	add.s	$f6, $f6, $f7
	mul.s	$f3, $f3, $f1
	lw	$10, 36($12)
	addi	$10, $10, 4
	lw.s	$f7, 0($10)
	mul.s	$f3, $f3, $f7
	add.s	$f3, $f6, $f3
	mul.s	$f1, $f1, $f2
	lw	$10, 36($12)
	addi	$10, $10, 8
	lw.s	$f2, 0($10)
	mul.s	$f1, $f1, $f2
	add.s	$f1, $f3, $f1
	j	beq_cont.29194
beq_then.29193:
	mv.s	$f1, $f6
beq_cont.29194:
	lw	$10, 4($12)
	beq	$10, $3, beq_then.29195
	j	beq_cont.29196
beq_then.29195:
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f1, $f1, $f2
beq_cont.29196:
	mul.s	$f2, $f5, $f5
	mul.s	$f1, $f4, $f1
	sub.s	$f1, $f2, $f1
	ble.s	$f1, $f0, ble.s_then.29197
	li	$10, 1
	j	ble.s_cont.29198
ble.s_then.29197:
	li	$10, 0
ble.s_cont.29198:
	beq	$10, $0, beq_then.29199
	lw	$10, 24($12)
	beq	$10, $0, beq_then.29201
	sqrt.s	$f1, $f1
	add.s	$f1, $f5, $f1
	addi	$10, $13, 16
	lw.s	$f2, 0($10)
	mul.s	$f1, $f1, $f2
	li	$10, 572
	sw.s	$f1, 0($10)
	j	beq_cont.29202
beq_then.29201:
	sqrt.s	$f1, $f1
	sub.s	$f1, $f5, $f1
	addi	$10, $13, 16
	lw.s	$f2, 0($10)
	mul.s	$f1, $f1, $f2
	li	$10, 572
	sw.s	$f1, 0($10)
beq_cont.29202:
	li	$10, 1
	j	beq_cont.29200
beq_then.29199:
	li	$10, 0
beq_cont.29200:
beq_cont.29192:
	j	beq_cont.29188
beq_then.29187:
	mv	$10, $13
	lw.s	$f4, 0($10)
	ble.s	$f0, $f4, ble.s_then.29203
	li	$10, 1
	j	ble.s_cont.29204
ble.s_then.29203:
	li	$10, 0
ble.s_cont.29204:
	beq	$10, $0, beq_then.29205
	addi	$10, $13, 4
	lw.s	$f4, 0($10)
	mul.s	$f1, $f4, $f1
	addi	$10, $13, 8
	lw.s	$f4, 0($10)
	mul.s	$f2, $f4, $f2
	add.s	$f1, $f1, $f2
	addi	$10, $13, 12
	lw.s	$f2, 0($10)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	li	$10, 572
	sw.s	$f1, 0($10)
	li	$10, 1
	j	beq_cont.29206
beq_then.29205:
	li	$10, 0
beq_cont.29206:
beq_cont.29188:
	j	beq_cont.29186
beq_then.29185:
	lw	$10, 0($10)
	mv	$14, $13
	lw.s	$f4, 0($14)
	sub.s	$f4, $f4, $f1
	addi	$14, $13, 4
	lw.s	$f5, 0($14)
	mul.s	$f4, $f4, $f5
	addi	$14, $10, 4
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f2
	abs.s	$f5, $f5
	lw	$14, 16($12)
	addi	$14, $14, 4
	lw.s	$f6, 0($14)
	ble.s	$f6, $f5, ble.s_then.29207
	li	$14, 1
	j	ble.s_cont.29208
ble.s_then.29207:
	li	$14, 0
ble.s_cont.29208:
	beq	$14, $0, beq_then.29209
	addi	$14, $10, 8
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f3
	abs.s	$f5, $f5
	lw	$14, 16($12)
	addi	$14, $14, 8
	lw.s	$f6, 0($14)
	ble.s	$f6, $f5, ble.s_then.29211
	li	$14, 1
	j	ble.s_cont.29212
ble.s_then.29211:
	li	$14, 0
ble.s_cont.29212:
	beq	$14, $0, beq_then.29213
	addi	$14, $13, 4
	lw.s	$f5, 0($14)
	beq.s	$f5, $f0, beq.s_then.29215
	li	$14, 0
	j	beq.s_cont.29216
beq.s_then.29215:
	li	$14, 1
beq.s_cont.29216:
	beq	$14, $0, beq_then.29217
	li	$14, 0
	j	beq_cont.29218
beq_then.29217:
	li	$14, 1
beq_cont.29218:
	j	beq_cont.29214
beq_then.29213:
	li	$14, 0
beq_cont.29214:
	j	beq_cont.29210
beq_then.29209:
	li	$14, 0
beq_cont.29210:
	beq	$14, $0, beq_then.29219
	li	$10, 572
	sw.s	$f4, 0($10)
	li	$10, 1
	j	beq_cont.29220
beq_then.29219:
	addi	$14, $13, 8
	lw.s	$f4, 0($14)
	sub.s	$f4, $f4, $f2
	addi	$14, $13, 12
	lw.s	$f5, 0($14)
	mul.s	$f4, $f4, $f5
	mv	$14, $10
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f1
	abs.s	$f5, $f5
	lw	$14, 16($12)
	lw.s	$f6, 0($14)
	ble.s	$f6, $f5, ble.s_then.29221
	li	$14, 1
	j	ble.s_cont.29222
ble.s_then.29221:
	li	$14, 0
ble.s_cont.29222:
	beq	$14, $0, beq_then.29223
	addi	$14, $10, 8
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f3
	abs.s	$f5, $f5
	lw	$14, 16($12)
	addi	$14, $14, 8
	lw.s	$f6, 0($14)
	ble.s	$f6, $f5, ble.s_then.29225
	li	$14, 1
	j	ble.s_cont.29226
ble.s_then.29225:
	li	$14, 0
ble.s_cont.29226:
	beq	$14, $0, beq_then.29227
	addi	$14, $13, 12
	lw.s	$f5, 0($14)
	beq.s	$f5, $f0, beq.s_then.29229
	li	$14, 0
	j	beq.s_cont.29230
beq.s_then.29229:
	li	$14, 1
beq.s_cont.29230:
	beq	$14, $0, beq_then.29231
	li	$14, 0
	j	beq_cont.29232
beq_then.29231:
	li	$14, 1
beq_cont.29232:
	j	beq_cont.29228
beq_then.29227:
	li	$14, 0
beq_cont.29228:
	j	beq_cont.29224
beq_then.29223:
	li	$14, 0
beq_cont.29224:
	beq	$14, $0, beq_then.29233
	li	$10, 572
	sw.s	$f4, 0($10)
	li	$10, 2
	j	beq_cont.29234
beq_then.29233:
	addi	$14, $13, 16
	lw.s	$f4, 0($14)
	sub.s	$f3, $f4, $f3
	addi	$14, $13, 20
	lw.s	$f4, 0($14)
	mul.s	$f3, $f3, $f4
	mv	$14, $10
	lw.s	$f4, 0($14)
	mul.s	$f4, $f3, $f4
	add.s	$f1, $f4, $f1
	abs.s	$f1, $f1
	lw	$14, 16($12)
	lw.s	$f4, 0($14)
	ble.s	$f4, $f1, ble.s_then.29235
	li	$14, 1
	j	ble.s_cont.29236
ble.s_then.29235:
	li	$14, 0
ble.s_cont.29236:
	beq	$14, $0, beq_then.29237
	addi	$10, $10, 4
	lw.s	$f1, 0($10)
	mul.s	$f1, $f3, $f1
	add.s	$f1, $f1, $f2
	abs.s	$f1, $f1
	lw	$10, 16($12)
	addi	$10, $10, 4
	lw.s	$f2, 0($10)
	ble.s	$f2, $f1, ble.s_then.29239
	li	$10, 1
	j	ble.s_cont.29240
ble.s_then.29239:
	li	$10, 0
ble.s_cont.29240:
	beq	$10, $0, beq_then.29241
	addi	$10, $13, 20
	lw.s	$f1, 0($10)
	beq.s	$f1, $f0, beq.s_then.29243
	li	$10, 0
	j	beq.s_cont.29244
beq.s_then.29243:
	li	$10, 1
beq.s_cont.29244:
	beq	$10, $0, beq_then.29245
	li	$10, 0
	j	beq_cont.29246
beq_then.29245:
	li	$10, 1
beq_cont.29246:
	j	beq_cont.29242
beq_then.29241:
	li	$10, 0
beq_cont.29242:
	j	beq_cont.29238
beq_then.29237:
	li	$10, 0
beq_cont.29238:
	beq	$10, $0, beq_then.29247
	li	$10, 572
	sw.s	$f3, 0($10)
	li	$10, 3
	j	beq_cont.29248
beq_then.29247:
	li	$10, 0
beq_cont.29248:
beq_cont.29234:
beq_cont.29220:
beq_cont.29186:
	li	$12, 572
	lw.s	$f1, 0($12)
	beq	$10, $0, beq_then.29249
	lui.s	$f2, 0xbe4c	# -0.200000の上位16ビット
	lli.s	$f2, 0xcccd	# -0.200000の下位16ビット
	ble.s	$f2, $f1, ble.s_then.29251
	li	$10, 1
	j	ble.s_cont.29252
ble.s_then.29251:
	li	$10, 0
ble.s_cont.29252:
	j	beq_cont.29250
beq_then.29249:
	li	$10, 0
beq_cont.29250:
	beq	$10, $0, beq_then.29253
	lui.s	$f2, 0x3c23	# 0.010000の上位16ビット
	lli.s	$f2, 0xd70a	# 0.010000の下位16ビット
	add.s	$f1, $f1, $f2
	li	$10, 344
	lw.s	$f2, 0($10)
	mul.s	$f2, $f2, $f1
	li	$10, 584
	lw.s	$f3, 0($10)
	add.s	$f2, $f2, $f3
	li	$10, 348
	lw.s	$f3, 0($10)
	mul.s	$f3, $f3, $f1
	li	$10, 588
	lw.s	$f4, 0($10)
	add.s	$f3, $f3, $f4
	li	$10, 352
	lw.s	$f4, 0($10)
	mul.s	$f1, $f4, $f1
	li	$10, 592
	lw.s	$f4, 0($10)
	add.s	$f1, $f1, $f4
	li	$10, 0
	sw	$9, 0($sp)
	sw	$8, 4($sp)
	mv	$8, $10
	mv.s	$f63, $f3
	mv.s	$f3, $f1
	mv.s	$f1, $f2
	mv.s	$f2, $f63
	sw	$ra, 8($sp)
	addi	$sp, $sp, 12
	jal	check_all_inside..7192
	addi	$sp, $sp, -12
	lw	$ra, 8($sp)
	beq	$8, $0, beq_then.29254
	li	$8, 1
	jr	$ra
beq_then.29254:
	lw	$8, 4($sp)
	addi	$8, $8, 1
	lw	$9, 0($sp)
	j	shadow_check_and_group..7198
beq_then.29253:
	sll	$10, $11, 2
	addi	$10, $10, 80
	lw	$10, 0($10)
	lw	$10, 24($10)
	beq	$10, $0, beq_then.29255
	addi	$8, $8, 1
	j	shadow_check_and_group..7198
beq_then.29255:
	li	$8, 0
	jr	$ra
beq_then.29184:
	li	$8, 0
	jr	$ra
shadow_check_one_or_group..7201:
	sll	$10, $8, 2
	add	$10, $9, $10
	lw	$10, 0($10)
	beq	$10, $7, beq_then.29256
	sll	$10, $10, 2
	addi	$10, $10, 364
	lw	$10, 0($10)
	li	$11, 0
	sw	$9, 0($sp)
	sw	$8, 4($sp)
	mv	$9, $10
	mv	$8, $11
	sw	$ra, 8($sp)
	addi	$sp, $sp, 12
	jal	shadow_check_and_group..7198
	addi	$sp, $sp, -12
	lw	$ra, 8($sp)
	beq	$8, $0, beq_then.29257
	li	$8, 1
	jr	$ra
beq_then.29257:
	lw	$8, 4($sp)
	addi	$8, $8, 1
	lw	$9, 0($sp)
	j	shadow_check_one_or_group..7201
beq_then.29256:
	li	$8, 0
	jr	$ra
shadow_check_one_or_matrix..7204:
	li	$10, 1020
	sll	$11, $8, 2
	add	$11, $9, $11
	lw	$11, 0($11)
	mv	$12, $11
	lw	$12, 0($12)
	beq	$12, $7, beq_then.29258
	li	$13, 99
	sw	$11, 0($sp)
	sw	$9, 4($sp)
	sw	$8, 8($sp)
	beq	$12, $13, beq_then.29259
	sll	$13, $12, 2
	addi	$13, $13, 80
	lw	$13, 0($13)
	li	$14, 584
	lw.s	$f1, 0($14)
	lw	$14, 20($13)
	lw.s	$f2, 0($14)
	sub.s	$f1, $f1, $f2
	li	$14, 588
	lw.s	$f2, 0($14)
	lw	$14, 20($13)
	addi	$14, $14, 4
	lw.s	$f3, 0($14)
	sub.s	$f2, $f2, $f3
	li	$14, 592
	lw.s	$f3, 0($14)
	lw	$14, 20($13)
	addi	$14, $14, 8
	lw.s	$f4, 0($14)
	sub.s	$f3, $f3, $f4
	lw	$14, 4($10)
	sll	$12, $12, 2
	add	$12, $14, $12
	lw	$12, 0($12)
	lw	$14, 4($13)
	beq	$14, $1, beq_then.29261
	beq	$14, $2, beq_then.29263
	mv	$10, $12
	lw.s	$f4, 0($10)
	beq.s	$f4, $f0, beq.s_then.29265
	li	$10, 0
	j	beq.s_cont.29266
beq.s_then.29265:
	li	$10, 1
beq.s_cont.29266:
	beq	$10, $0, beq_then.29267
	li	$10, 0
	j	beq_cont.29268
beq_then.29267:
	addi	$10, $12, 4
	lw.s	$f5, 0($10)
	mul.s	$f5, $f5, $f1
	addi	$10, $12, 8
	lw.s	$f6, 0($10)
	mul.s	$f6, $f6, $f2
	add.s	$f5, $f5, $f6
	addi	$10, $12, 12
	lw.s	$f6, 0($10)
	mul.s	$f6, $f6, $f3
	add.s	$f5, $f5, $f6
	mul.s	$f6, $f1, $f1
	lw	$10, 16($13)
	lw.s	$f7, 0($10)
	mul.s	$f6, $f6, $f7
	mul.s	$f7, $f2, $f2
	lw	$10, 16($13)
	addi	$10, $10, 4
	lw.s	$f8, 0($10)
	mul.s	$f7, $f7, $f8
	add.s	$f6, $f6, $f7
	mul.s	$f7, $f3, $f3
	lw	$10, 16($13)
	addi	$10, $10, 8
	lw.s	$f8, 0($10)
	mul.s	$f7, $f7, $f8
	add.s	$f6, $f6, $f7
	lw	$10, 12($13)
	beq	$10, $0, beq_then.29269
	mul.s	$f7, $f2, $f3
	lw	$10, 36($13)
	lw.s	$f8, 0($10)
	mul.s	$f7, $f7, $f8
	add.s	$f6, $f6, $f7
	mul.s	$f3, $f3, $f1
	lw	$10, 36($13)
	addi	$10, $10, 4
	lw.s	$f7, 0($10)
	mul.s	$f3, $f3, $f7
	add.s	$f3, $f6, $f3
	mul.s	$f1, $f1, $f2
	lw	$10, 36($13)
	addi	$10, $10, 8
	lw.s	$f2, 0($10)
	mul.s	$f1, $f1, $f2
	add.s	$f1, $f3, $f1
	j	beq_cont.29270
beq_then.29269:
	mv.s	$f1, $f6
beq_cont.29270:
	lw	$10, 4($13)
	beq	$10, $3, beq_then.29271
	j	beq_cont.29272
beq_then.29271:
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f1, $f1, $f2
beq_cont.29272:
	mul.s	$f2, $f5, $f5
	mul.s	$f1, $f4, $f1
	sub.s	$f1, $f2, $f1
	ble.s	$f1, $f0, ble.s_then.29273
	li	$10, 1
	j	ble.s_cont.29274
ble.s_then.29273:
	li	$10, 0
ble.s_cont.29274:
	beq	$10, $0, beq_then.29275
	lw	$10, 24($13)
	beq	$10, $0, beq_then.29277
	sqrt.s	$f1, $f1
	add.s	$f1, $f5, $f1
	addi	$10, $12, 16
	lw.s	$f2, 0($10)
	mul.s	$f1, $f1, $f2
	li	$10, 572
	sw.s	$f1, 0($10)
	j	beq_cont.29278
beq_then.29277:
	sqrt.s	$f1, $f1
	sub.s	$f1, $f5, $f1
	addi	$10, $12, 16
	lw.s	$f2, 0($10)
	mul.s	$f1, $f1, $f2
	li	$10, 572
	sw.s	$f1, 0($10)
beq_cont.29278:
	li	$10, 1
	j	beq_cont.29276
beq_then.29275:
	li	$10, 0
beq_cont.29276:
beq_cont.29268:
	j	beq_cont.29264
beq_then.29263:
	mv	$10, $12
	lw.s	$f4, 0($10)
	ble.s	$f0, $f4, ble.s_then.29279
	li	$10, 1
	j	ble.s_cont.29280
ble.s_then.29279:
	li	$10, 0
ble.s_cont.29280:
	beq	$10, $0, beq_then.29281
	addi	$10, $12, 4
	lw.s	$f4, 0($10)
	mul.s	$f1, $f4, $f1
	addi	$10, $12, 8
	lw.s	$f4, 0($10)
	mul.s	$f2, $f4, $f2
	add.s	$f1, $f1, $f2
	addi	$10, $12, 12
	lw.s	$f2, 0($10)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	li	$10, 572
	sw.s	$f1, 0($10)
	li	$10, 1
	j	beq_cont.29282
beq_then.29281:
	li	$10, 0
beq_cont.29282:
beq_cont.29264:
	j	beq_cont.29262
beq_then.29261:
	lw	$10, 0($10)
	mv	$14, $12
	lw.s	$f4, 0($14)
	sub.s	$f4, $f4, $f1
	addi	$14, $12, 4
	lw.s	$f5, 0($14)
	mul.s	$f4, $f4, $f5
	addi	$14, $10, 4
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f2
	abs.s	$f5, $f5
	lw	$14, 16($13)
	addi	$14, $14, 4
	lw.s	$f6, 0($14)
	ble.s	$f6, $f5, ble.s_then.29283
	li	$14, 1
	j	ble.s_cont.29284
ble.s_then.29283:
	li	$14, 0
ble.s_cont.29284:
	beq	$14, $0, beq_then.29285
	addi	$14, $10, 8
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f3
	abs.s	$f5, $f5
	lw	$14, 16($13)
	addi	$14, $14, 8
	lw.s	$f6, 0($14)
	ble.s	$f6, $f5, ble.s_then.29287
	li	$14, 1
	j	ble.s_cont.29288
ble.s_then.29287:
	li	$14, 0
ble.s_cont.29288:
	beq	$14, $0, beq_then.29289
	addi	$14, $12, 4
	lw.s	$f5, 0($14)
	beq.s	$f5, $f0, beq.s_then.29291
	li	$14, 0
	j	beq.s_cont.29292
beq.s_then.29291:
	li	$14, 1
beq.s_cont.29292:
	beq	$14, $0, beq_then.29293
	li	$14, 0
	j	beq_cont.29294
beq_then.29293:
	li	$14, 1
beq_cont.29294:
	j	beq_cont.29290
beq_then.29289:
	li	$14, 0
beq_cont.29290:
	j	beq_cont.29286
beq_then.29285:
	li	$14, 0
beq_cont.29286:
	beq	$14, $0, beq_then.29295
	li	$10, 572
	sw.s	$f4, 0($10)
	li	$10, 1
	j	beq_cont.29296
beq_then.29295:
	addi	$14, $12, 8
	lw.s	$f4, 0($14)
	sub.s	$f4, $f4, $f2
	addi	$14, $12, 12
	lw.s	$f5, 0($14)
	mul.s	$f4, $f4, $f5
	mv	$14, $10
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f1
	abs.s	$f5, $f5
	lw	$14, 16($13)
	lw.s	$f6, 0($14)
	ble.s	$f6, $f5, ble.s_then.29297
	li	$14, 1
	j	ble.s_cont.29298
ble.s_then.29297:
	li	$14, 0
ble.s_cont.29298:
	beq	$14, $0, beq_then.29299
	addi	$14, $10, 8
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f3
	abs.s	$f5, $f5
	lw	$14, 16($13)
	addi	$14, $14, 8
	lw.s	$f6, 0($14)
	ble.s	$f6, $f5, ble.s_then.29301
	li	$14, 1
	j	ble.s_cont.29302
ble.s_then.29301:
	li	$14, 0
ble.s_cont.29302:
	beq	$14, $0, beq_then.29303
	addi	$14, $12, 12
	lw.s	$f5, 0($14)
	beq.s	$f5, $f0, beq.s_then.29305
	li	$14, 0
	j	beq.s_cont.29306
beq.s_then.29305:
	li	$14, 1
beq.s_cont.29306:
	beq	$14, $0, beq_then.29307
	li	$14, 0
	j	beq_cont.29308
beq_then.29307:
	li	$14, 1
beq_cont.29308:
	j	beq_cont.29304
beq_then.29303:
	li	$14, 0
beq_cont.29304:
	j	beq_cont.29300
beq_then.29299:
	li	$14, 0
beq_cont.29300:
	beq	$14, $0, beq_then.29309
	li	$10, 572
	sw.s	$f4, 0($10)
	li	$10, 2
	j	beq_cont.29310
beq_then.29309:
	addi	$14, $12, 16
	lw.s	$f4, 0($14)
	sub.s	$f3, $f4, $f3
	addi	$14, $12, 20
	lw.s	$f4, 0($14)
	mul.s	$f3, $f3, $f4
	mv	$14, $10
	lw.s	$f4, 0($14)
	mul.s	$f4, $f3, $f4
	add.s	$f1, $f4, $f1
	abs.s	$f1, $f1
	lw	$14, 16($13)
	lw.s	$f4, 0($14)
	ble.s	$f4, $f1, ble.s_then.29311
	li	$14, 1
	j	ble.s_cont.29312
ble.s_then.29311:
	li	$14, 0
ble.s_cont.29312:
	beq	$14, $0, beq_then.29313
	addi	$10, $10, 4
	lw.s	$f1, 0($10)
	mul.s	$f1, $f3, $f1
	add.s	$f1, $f1, $f2
	abs.s	$f1, $f1
	lw	$10, 16($13)
	addi	$10, $10, 4
	lw.s	$f2, 0($10)
	ble.s	$f2, $f1, ble.s_then.29315
	li	$10, 1
	j	ble.s_cont.29316
ble.s_then.29315:
	li	$10, 0
ble.s_cont.29316:
	beq	$10, $0, beq_then.29317
	addi	$10, $12, 20
	lw.s	$f1, 0($10)
	beq.s	$f1, $f0, beq.s_then.29319
	li	$10, 0
	j	beq.s_cont.29320
beq.s_then.29319:
	li	$10, 1
beq.s_cont.29320:
	beq	$10, $0, beq_then.29321
	li	$10, 0
	j	beq_cont.29322
beq_then.29321:
	li	$10, 1
beq_cont.29322:
	j	beq_cont.29318
beq_then.29317:
	li	$10, 0
beq_cont.29318:
	j	beq_cont.29314
beq_then.29313:
	li	$10, 0
beq_cont.29314:
	beq	$10, $0, beq_then.29323
	li	$10, 572
	sw.s	$f3, 0($10)
	li	$10, 3
	j	beq_cont.29324
beq_then.29323:
	li	$10, 0
beq_cont.29324:
beq_cont.29310:
beq_cont.29296:
beq_cont.29262:
	beq	$10, $0, beq_then.29325
	li	$10, 572
	lw.s	$f1, 0($10)
	lui.s	$f2, 0xbdcc	# -0.100000の上位16ビット
	lli.s	$f2, 0xcccd	# -0.100000の下位16ビット
	ble.s	$f2, $f1, ble.s_then.29327
	li	$10, 1
	j	ble.s_cont.29328
ble.s_then.29327:
	li	$10, 0
ble.s_cont.29328:
	beq	$10, $0, beq_then.29329
	li	$10, 1
	mv	$9, $11
	mv	$8, $10
	sw	$ra, 12($sp)
	addi	$sp, $sp, 16
	jal	shadow_check_one_or_group..7201
	addi	$sp, $sp, -16
	lw	$ra, 12($sp)
	beq	$8, $0, beq_then.29331
	li	$8, 1
	j	beq_cont.29332
beq_then.29331:
	li	$8, 0
beq_cont.29332:
	j	beq_cont.29330
beq_then.29329:
	li	$8, 0
beq_cont.29330:
	j	beq_cont.29326
beq_then.29325:
	li	$8, 0
beq_cont.29326:
	j	beq_cont.29260
beq_then.29259:
	li	$8, 1
beq_cont.29260:
	beq	$8, $0, beq_then.29333
	li	$8, 1
	lw	$9, 0($sp)
	sw	$ra, 12($sp)
	addi	$sp, $sp, 16
	jal	shadow_check_one_or_group..7201
	addi	$sp, $sp, -16
	lw	$ra, 12($sp)
	beq	$8, $0, beq_then.29334
	li	$8, 1
	jr	$ra
beq_then.29334:
	lw	$8, 8($sp)
	addi	$8, $8, 1
	lw	$9, 4($sp)
	j	shadow_check_one_or_matrix..7204
beq_then.29333:
	lw	$8, 8($sp)
	addi	$8, $8, 1
	lw	$9, 4($sp)
	j	shadow_check_one_or_matrix..7204
beq_then.29258:
	li	$8, 0
	jr	$ra
solve_each_element..7207:
	sll	$11, $8, 2
	add	$11, $9, $11
	lw	$11, 0($11)
	beq	$11, $7, beq_then.29335
	sll	$12, $11, 2
	addi	$12, $12, 80
	lw	$12, 0($12)
	li	$13, 668
	lw.s	$f1, 0($13)
	lw	$13, 20($12)
	lw.s	$f2, 0($13)
	sub.s	$f1, $f1, $f2
	li	$13, 672
	lw.s	$f2, 0($13)
	lw	$13, 20($12)
	addi	$13, $13, 4
	lw.s	$f3, 0($13)
	sub.s	$f2, $f2, $f3
	li	$13, 676
	lw.s	$f3, 0($13)
	lw	$13, 20($12)
	addi	$13, $13, 8
	lw.s	$f4, 0($13)
	sub.s	$f3, $f3, $f4
	lw	$13, 4($12)
	beq	$13, $1, beq_then.29336
	beq	$13, $2, beq_then.29338
	mv	$13, $10
	lw.s	$f4, 0($13)
	addi	$13, $10, 4
	lw.s	$f5, 0($13)
	addi	$13, $10, 8
	lw.s	$f6, 0($13)
	mul.s	$f7, $f4, $f4
	lw	$13, 16($12)
	lw.s	$f8, 0($13)
	mul.s	$f7, $f7, $f8
	mul.s	$f8, $f5, $f5
	lw	$13, 16($12)
	addi	$13, $13, 4
	lw.s	$f9, 0($13)
	mul.s	$f8, $f8, $f9
	add.s	$f7, $f7, $f8
	mul.s	$f8, $f6, $f6
	lw	$13, 16($12)
	addi	$13, $13, 8
	lw.s	$f9, 0($13)
	mul.s	$f8, $f8, $f9
	add.s	$f7, $f7, $f8
	lw	$13, 12($12)
	beq	$13, $0, beq_then.29340
	mul.s	$f8, $f5, $f6
	lw	$13, 36($12)
	lw.s	$f9, 0($13)
	mul.s	$f8, $f8, $f9
	add.s	$f7, $f7, $f8
	mul.s	$f6, $f6, $f4
	lw	$13, 36($12)
	addi	$13, $13, 4
	lw.s	$f8, 0($13)
	mul.s	$f6, $f6, $f8
	add.s	$f6, $f7, $f6
	mul.s	$f4, $f4, $f5
	lw	$13, 36($12)
	addi	$13, $13, 8
	lw.s	$f5, 0($13)
	mul.s	$f4, $f4, $f5
	add.s	$f4, $f6, $f4
	j	beq_cont.29341
beq_then.29340:
	mv.s	$f4, $f7
beq_cont.29341:
	beq.s	$f4, $f0, beq.s_then.29342
	li	$13, 0
	j	beq.s_cont.29343
beq.s_then.29342:
	li	$13, 1
beq.s_cont.29343:
	beq	$13, $0, beq_then.29344
	li	$12, 0
	j	beq_cont.29345
beq_then.29344:
	mv	$13, $10
	lw.s	$f5, 0($13)
	addi	$13, $10, 4
	lw.s	$f6, 0($13)
	addi	$13, $10, 8
	lw.s	$f7, 0($13)
	mul.s	$f8, $f5, $f1
	lw	$13, 16($12)
	lw.s	$f9, 0($13)
	mul.s	$f8, $f8, $f9
	mul.s	$f9, $f6, $f2
	lw	$13, 16($12)
	addi	$13, $13, 4
	lw.s	$f10, 0($13)
	mul.s	$f9, $f9, $f10
	add.s	$f8, $f8, $f9
	mul.s	$f9, $f7, $f3
	lw	$13, 16($12)
	addi	$13, $13, 8
	lw.s	$f10, 0($13)
	mul.s	$f9, $f9, $f10
	add.s	$f8, $f8, $f9
	lw	$13, 12($12)
	beq	$13, $0, beq_then.29346
	mul.s	$f9, $f7, $f2
	mul.s	$f10, $f6, $f3
	add.s	$f9, $f9, $f10
	lw	$13, 36($12)
	lw.s	$f10, 0($13)
	mul.s	$f9, $f9, $f10
	mul.s	$f10, $f5, $f3
	mul.s	$f7, $f7, $f1
	add.s	$f7, $f10, $f7
	lw	$13, 36($12)
	addi	$13, $13, 4
	lw.s	$f10, 0($13)
	mul.s	$f7, $f7, $f10
	add.s	$f7, $f9, $f7
	mul.s	$f5, $f5, $f2
	mul.s	$f6, $f6, $f1
	add.s	$f5, $f5, $f6
	lw	$13, 36($12)
	addi	$13, $13, 8
	lw.s	$f6, 0($13)
	mul.s	$f5, $f5, $f6
	add.s	$f5, $f7, $f5
	lui.s	$f6, 0x3f00	# 0.500000の上位16ビット
	mul.s	$f5, $f5, $f6
	add.s	$f5, $f8, $f5
	j	beq_cont.29347
beq_then.29346:
	mv.s	$f5, $f8
beq_cont.29347:
	mul.s	$f6, $f1, $f1
	lw	$13, 16($12)
	lw.s	$f7, 0($13)
	mul.s	$f6, $f6, $f7
	mul.s	$f7, $f2, $f2
	lw	$13, 16($12)
	addi	$13, $13, 4
	lw.s	$f8, 0($13)
	mul.s	$f7, $f7, $f8
	add.s	$f6, $f6, $f7
	mul.s	$f7, $f3, $f3
	lw	$13, 16($12)
	addi	$13, $13, 8
	lw.s	$f8, 0($13)
	mul.s	$f7, $f7, $f8
	add.s	$f6, $f6, $f7
	lw	$13, 12($12)
	beq	$13, $0, beq_then.29348
	mul.s	$f7, $f2, $f3
	lw	$13, 36($12)
	lw.s	$f8, 0($13)
	mul.s	$f7, $f7, $f8
	add.s	$f6, $f6, $f7
	mul.s	$f3, $f3, $f1
	lw	$13, 36($12)
	addi	$13, $13, 4
	lw.s	$f7, 0($13)
	mul.s	$f3, $f3, $f7
	add.s	$f3, $f6, $f3
	mul.s	$f1, $f1, $f2
	lw	$13, 36($12)
	addi	$13, $13, 8
	lw.s	$f2, 0($13)
	mul.s	$f1, $f1, $f2
	add.s	$f1, $f3, $f1
	j	beq_cont.29349
beq_then.29348:
	mv.s	$f1, $f6
beq_cont.29349:
	lw	$13, 4($12)
	beq	$13, $3, beq_then.29350
	j	beq_cont.29351
beq_then.29350:
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f1, $f1, $f2
beq_cont.29351:
	mul.s	$f2, $f5, $f5
	mul.s	$f1, $f4, $f1
	sub.s	$f1, $f2, $f1
	ble.s	$f1, $f0, ble.s_then.29352
	li	$13, 1
	j	ble.s_cont.29353
ble.s_then.29352:
	li	$13, 0
ble.s_cont.29353:
	beq	$13, $0, beq_then.29354
	sqrt.s	$f1, $f1
	lw	$12, 24($12)
	beq	$12, $0, beq_then.29356
	j	beq_cont.29357
beq_then.29356:
	neg.s	$f1, $f1
beq_cont.29357:
	sub.s	$f1, $f1, $f5
	inv.s	$f2, $f4
	mul.s	$f1, $f1, $f2
	li	$12, 572
	sw.s	$f1, 0($12)
	li	$12, 1
	j	beq_cont.29355
beq_then.29354:
	li	$12, 0
beq_cont.29355:
beq_cont.29345:
	j	beq_cont.29339
beq_then.29338:
	lw	$12, 16($12)
	mv	$13, $10
	lw.s	$f4, 0($13)
	mv	$13, $12
	lw.s	$f5, 0($13)
	mul.s	$f4, $f4, $f5
	addi	$13, $10, 4
	lw.s	$f5, 0($13)
	addi	$13, $12, 4
	lw.s	$f6, 0($13)
	mul.s	$f5, $f5, $f6
	add.s	$f4, $f4, $f5
	addi	$13, $10, 8
	lw.s	$f5, 0($13)
	addi	$13, $12, 8
	lw.s	$f6, 0($13)
	mul.s	$f5, $f5, $f6
	add.s	$f4, $f4, $f5
	ble.s	$f4, $f0, ble.s_then.29358
	li	$13, 1
	j	ble.s_cont.29359
ble.s_then.29358:
	li	$13, 0
ble.s_cont.29359:
	beq	$13, $0, beq_then.29360
	mv	$13, $12
	lw.s	$f5, 0($13)
	mul.s	$f1, $f5, $f1
	addi	$13, $12, 4
	lw.s	$f5, 0($13)
	mul.s	$f2, $f5, $f2
	add.s	$f1, $f1, $f2
	addi	$12, $12, 8
	lw.s	$f2, 0($12)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	neg.s	$f1, $f1
	inv.s	$f2, $f4
	mul.s	$f1, $f1, $f2
	li	$12, 572
	sw.s	$f1, 0($12)
	li	$12, 1
	j	beq_cont.29361
beq_then.29360:
	li	$12, 0
beq_cont.29361:
beq_cont.29339:
	j	beq_cont.29337
beq_then.29336:
	mv	$13, $10
	lw.s	$f4, 0($13)
	beq.s	$f4, $f0, beq.s_then.29362
	li	$13, 0
	j	beq.s_cont.29363
beq.s_then.29362:
	li	$13, 1
beq.s_cont.29363:
	beq	$13, $0, beq_then.29364
	li	$13, 0
	j	beq_cont.29365
beq_then.29364:
	lw	$13, 16($12)
	lw	$14, 24($12)
	mv	$15, $10
	lw.s	$f4, 0($15)
	ble.s	$f0, $f4, ble.s_then.29366
	li	$15, 1
	j	ble.s_cont.29367
ble.s_then.29366:
	li	$15, 0
ble.s_cont.29367:
	beq	$14, $15, beq_then.29368
	li	$14, 1
	j	beq_cont.29369
beq_then.29368:
	li	$14, 0
beq_cont.29369:
	mv	$15, $13
	lw.s	$f4, 0($15)
	beq	$14, $0, beq_then.29370
	j	beq_cont.29371
beq_then.29370:
	neg.s	$f4, $f4
beq_cont.29371:
	sub.s	$f4, $f4, $f1
	mv	$14, $10
	lw.s	$f5, 0($14)
	inv.s	$f5, $f5
	mul.s	$f4, $f4, $f5
	addi	$14, $10, 4
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f2
	abs.s	$f5, $f5
	addi	$14, $13, 4
	lw.s	$f6, 0($14)
	ble.s	$f6, $f5, ble.s_then.29372
	li	$14, 1
	j	ble.s_cont.29373
ble.s_then.29372:
	li	$14, 0
ble.s_cont.29373:
	beq	$14, $0, beq_then.29374
	addi	$14, $10, 8
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f3
	abs.s	$f5, $f5
	addi	$13, $13, 8
	lw.s	$f6, 0($13)
	ble.s	$f6, $f5, ble.s_then.29376
	li	$13, 1
	j	ble.s_cont.29377
ble.s_then.29376:
	li	$13, 0
ble.s_cont.29377:
	beq	$13, $0, beq_then.29378
	li	$13, 572
	sw.s	$f4, 0($13)
	li	$13, 1
	j	beq_cont.29379
beq_then.29378:
	li	$13, 0
beq_cont.29379:
	j	beq_cont.29375
beq_then.29374:
	li	$13, 0
beq_cont.29375:
beq_cont.29365:
	beq	$13, $0, beq_then.29380
	li	$12, 1
	j	beq_cont.29381
beq_then.29380:
	addi	$13, $10, 4
	lw.s	$f4, 0($13)
	beq.s	$f4, $f0, beq.s_then.29382
	li	$13, 0
	j	beq.s_cont.29383
beq.s_then.29382:
	li	$13, 1
beq.s_cont.29383:
	beq	$13, $0, beq_then.29384
	li	$13, 0
	j	beq_cont.29385
beq_then.29384:
	lw	$13, 16($12)
	lw	$14, 24($12)
	addi	$15, $10, 4
	lw.s	$f4, 0($15)
	ble.s	$f0, $f4, ble.s_then.29386
	li	$15, 1
	j	ble.s_cont.29387
ble.s_then.29386:
	li	$15, 0
ble.s_cont.29387:
	beq	$14, $15, beq_then.29388
	li	$14, 1
	j	beq_cont.29389
beq_then.29388:
	li	$14, 0
beq_cont.29389:
	addi	$15, $13, 4
	lw.s	$f4, 0($15)
	beq	$14, $0, beq_then.29390
	j	beq_cont.29391
beq_then.29390:
	neg.s	$f4, $f4
beq_cont.29391:
	sub.s	$f4, $f4, $f2
	addi	$14, $10, 4
	lw.s	$f5, 0($14)
	inv.s	$f5, $f5
	mul.s	$f4, $f4, $f5
	addi	$14, $10, 8
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f3
	abs.s	$f5, $f5
	addi	$14, $13, 8
	lw.s	$f6, 0($14)
	ble.s	$f6, $f5, ble.s_then.29392
	li	$14, 1
	j	ble.s_cont.29393
ble.s_then.29392:
	li	$14, 0
ble.s_cont.29393:
	beq	$14, $0, beq_then.29394
	mv	$14, $10
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f1
	abs.s	$f5, $f5
	lw.s	$f6, 0($13)
	ble.s	$f6, $f5, ble.s_then.29396
	li	$13, 1
	j	ble.s_cont.29397
ble.s_then.29396:
	li	$13, 0
ble.s_cont.29397:
	beq	$13, $0, beq_then.29398
	li	$13, 572
	sw.s	$f4, 0($13)
	li	$13, 1
	j	beq_cont.29399
beq_then.29398:
	li	$13, 0
beq_cont.29399:
	j	beq_cont.29395
beq_then.29394:
	li	$13, 0
beq_cont.29395:
beq_cont.29385:
	beq	$13, $0, beq_then.29400
	li	$12, 2
	j	beq_cont.29401
beq_then.29400:
	addi	$13, $10, 8
	lw.s	$f4, 0($13)
	beq.s	$f4, $f0, beq.s_then.29402
	li	$13, 0
	j	beq.s_cont.29403
beq.s_then.29402:
	li	$13, 1
beq.s_cont.29403:
	beq	$13, $0, beq_then.29404
	li	$12, 0
	j	beq_cont.29405
beq_then.29404:
	lw	$13, 16($12)
	lw	$12, 24($12)
	addi	$14, $10, 8
	lw.s	$f4, 0($14)
	ble.s	$f0, $f4, ble.s_then.29406
	li	$14, 1
	j	ble.s_cont.29407
ble.s_then.29406:
	li	$14, 0
ble.s_cont.29407:
	beq	$12, $14, beq_then.29408
	li	$12, 1
	j	beq_cont.29409
beq_then.29408:
	li	$12, 0
beq_cont.29409:
	addi	$14, $13, 8
	lw.s	$f4, 0($14)
	beq	$12, $0, beq_then.29410
	j	beq_cont.29411
beq_then.29410:
	neg.s	$f4, $f4
beq_cont.29411:
	sub.s	$f3, $f4, $f3
	addi	$12, $10, 8
	lw.s	$f4, 0($12)
	inv.s	$f4, $f4
	mul.s	$f3, $f3, $f4
	mv	$12, $10
	lw.s	$f4, 0($12)
	mul.s	$f4, $f3, $f4
	add.s	$f1, $f4, $f1
	abs.s	$f1, $f1
	mv	$12, $13
	lw.s	$f4, 0($12)
	ble.s	$f4, $f1, ble.s_then.29412
	li	$12, 1
	j	ble.s_cont.29413
ble.s_then.29412:
	li	$12, 0
ble.s_cont.29413:
	beq	$12, $0, beq_then.29414
	addi	$12, $10, 4
	lw.s	$f1, 0($12)
	mul.s	$f1, $f3, $f1
	add.s	$f1, $f1, $f2
	abs.s	$f1, $f1
	addi	$12, $13, 4
	lw.s	$f2, 0($12)
	ble.s	$f2, $f1, ble.s_then.29416
	li	$12, 1
	j	ble.s_cont.29417
ble.s_then.29416:
	li	$12, 0
ble.s_cont.29417:
	beq	$12, $0, beq_then.29418
	li	$12, 572
	sw.s	$f3, 0($12)
	li	$12, 1
	j	beq_cont.29419
beq_then.29418:
	li	$12, 0
beq_cont.29419:
	j	beq_cont.29415
beq_then.29414:
	li	$12, 0
beq_cont.29415:
beq_cont.29405:
	beq	$12, $0, beq_then.29420
	li	$12, 3
	j	beq_cont.29421
beq_then.29420:
	li	$12, 0
beq_cont.29421:
beq_cont.29401:
beq_cont.29381:
beq_cont.29337:
	beq	$12, $0, beq_then.29422
	li	$13, 572
	lw.s	$f1, 0($13)
	ble.s	$f1, $f0, ble.s_then.29423
	li	$13, 1
	j	ble.s_cont.29424
ble.s_then.29423:
	li	$13, 0
ble.s_cont.29424:
	sw	$10, 0($sp)
	sw	$9, 4($sp)
	sw	$8, 8($sp)
	beq	$13, $0, beq_then.29425
	li	$13, 580
	lw.s	$f2, 0($13)
	ble.s	$f2, $f1, ble.s_then.29427
	li	$13, 1
	j	ble.s_cont.29428
ble.s_then.29427:
	li	$13, 0
ble.s_cont.29428:
	beq	$13, $0, beq_then.29429
	lui.s	$f2, 0x3c23	# 0.010000の上位16ビット
	lli.s	$f2, 0xd70a	# 0.010000の下位16ビット
	add.s	$f1, $f1, $f2
	mv	$13, $10
	lw.s	$f2, 0($13)
	mul.s	$f2, $f2, $f1
	li	$13, 668
	lw.s	$f3, 0($13)
	add.s	$f2, $f2, $f3
	addi	$13, $10, 4
	lw.s	$f3, 0($13)
	mul.s	$f3, $f3, $f1
	li	$13, 672
	lw.s	$f4, 0($13)
	add.s	$f3, $f3, $f4
	addi	$13, $10, 8
	lw.s	$f4, 0($13)
	mul.s	$f4, $f4, $f1
	li	$13, 676
	lw.s	$f5, 0($13)
	add.s	$f4, $f4, $f5
	li	$13, 0
	sw	$12, 12($sp)
	sw	$11, 16($sp)
	sw.s	$f4, 20($sp)
	sw.s	$f3, 24($sp)
	sw.s	$f2, 28($sp)
	sw.s	$f1, 32($sp)
	mv	$8, $13
	mv.s	$f1, $f2
	mv.s	$f2, $f3
	mv.s	$f3, $f4
	sw	$ra, 36($sp)
	addi	$sp, $sp, 40
	jal	check_all_inside..7192
	addi	$sp, $sp, -40
	lw	$ra, 36($sp)
	beq	$8, $0, beq_then.29431
	li	$8, 580
	lw.s	$f1, 32($sp)
	sw.s	$f1, 0($8)
	li	$8, 584
	lw.s	$f1, 28($sp)
	sw.s	$f1, 0($8)
	li	$8, 588
	lw.s	$f1, 24($sp)
	sw.s	$f1, 0($8)
	li	$8, 592
	lw.s	$f1, 20($sp)
	sw.s	$f1, 0($8)
	li	$8, 596
	lw	$9, 16($sp)
	sw	$9, 0($8)
	li	$8, 576
	lw	$9, 12($sp)
	sw	$9, 0($8)
	j	beq_cont.29432
beq_then.29431:
beq_cont.29432:
	j	beq_cont.29430
beq_then.29429:
beq_cont.29430:
	j	beq_cont.29426
beq_then.29425:
beq_cont.29426:
	lw	$8, 8($sp)
	addi	$8, $8, 1
	lw	$9, 4($sp)
	lw	$10, 0($sp)
	j	solve_each_element..7207
beq_then.29422:
	sll	$11, $11, 2
	addi	$11, $11, 80
	lw	$11, 0($11)
	lw	$11, 24($11)
	beq	$11, $0, beq_then.29433
	addi	$8, $8, 1
	j	solve_each_element..7207
beq_then.29433:
	jr	$ra
beq_then.29335:
	jr	$ra
solve_one_or_network..7211:
	sll	$11, $8, 2
	add	$11, $9, $11
	lw	$11, 0($11)
	beq	$11, $7, beq_then.29436
	sll	$11, $11, 2
	addi	$11, $11, 364
	lw	$11, 0($11)
	li	$12, 0
	sw	$10, 0($sp)
	sw	$9, 4($sp)
	sw	$8, 8($sp)
	mv	$9, $11
	mv	$8, $12
	sw	$ra, 12($sp)
	addi	$sp, $sp, 16
	jal	solve_each_element..7207
	addi	$sp, $sp, -16
	lw	$ra, 12($sp)
	lw	$8, 8($sp)
	addi	$8, $8, 1
	lw	$9, 4($sp)
	lw	$10, 0($sp)
	j	solve_one_or_network..7211
beq_then.29436:
	jr	$ra
trace_or_matrix..7215:
	sll	$11, $8, 2
	add	$11, $9, $11
	lw	$11, 0($11)
	mv	$12, $11
	lw	$12, 0($12)
	beq	$12, $7, beq_then.29438
	li	$13, 99
	sw	$10, 0($sp)
	sw	$9, 4($sp)
	sw	$8, 8($sp)
	beq	$12, $13, beq_then.29439
	sll	$12, $12, 2
	addi	$12, $12, 80
	lw	$12, 0($12)
	li	$13, 668
	lw.s	$f1, 0($13)
	lw	$13, 20($12)
	lw.s	$f2, 0($13)
	sub.s	$f1, $f1, $f2
	li	$13, 672
	lw.s	$f2, 0($13)
	lw	$13, 20($12)
	addi	$13, $13, 4
	lw.s	$f3, 0($13)
	sub.s	$f2, $f2, $f3
	li	$13, 676
	lw.s	$f3, 0($13)
	lw	$13, 20($12)
	addi	$13, $13, 8
	lw.s	$f4, 0($13)
	sub.s	$f3, $f3, $f4
	lw	$13, 4($12)
	beq	$13, $1, beq_then.29441
	beq	$13, $2, beq_then.29443
	mv	$13, $10
	lw.s	$f4, 0($13)
	addi	$13, $10, 4
	lw.s	$f5, 0($13)
	addi	$13, $10, 8
	lw.s	$f6, 0($13)
	mul.s	$f7, $f4, $f4
	lw	$13, 16($12)
	lw.s	$f8, 0($13)
	mul.s	$f7, $f7, $f8
	mul.s	$f8, $f5, $f5
	lw	$13, 16($12)
	addi	$13, $13, 4
	lw.s	$f9, 0($13)
	mul.s	$f8, $f8, $f9
	add.s	$f7, $f7, $f8
	mul.s	$f8, $f6, $f6
	lw	$13, 16($12)
	addi	$13, $13, 8
	lw.s	$f9, 0($13)
	mul.s	$f8, $f8, $f9
	add.s	$f7, $f7, $f8
	lw	$13, 12($12)
	beq	$13, $0, beq_then.29445
	mul.s	$f8, $f5, $f6
	lw	$13, 36($12)
	lw.s	$f9, 0($13)
	mul.s	$f8, $f8, $f9
	add.s	$f7, $f7, $f8
	mul.s	$f6, $f6, $f4
	lw	$13, 36($12)
	addi	$13, $13, 4
	lw.s	$f8, 0($13)
	mul.s	$f6, $f6, $f8
	add.s	$f6, $f7, $f6
	mul.s	$f4, $f4, $f5
	lw	$13, 36($12)
	addi	$13, $13, 8
	lw.s	$f5, 0($13)
	mul.s	$f4, $f4, $f5
	add.s	$f4, $f6, $f4
	j	beq_cont.29446
beq_then.29445:
	mv.s	$f4, $f7
beq_cont.29446:
	beq.s	$f4, $f0, beq.s_then.29447
	li	$13, 0
	j	beq.s_cont.29448
beq.s_then.29447:
	li	$13, 1
beq.s_cont.29448:
	beq	$13, $0, beq_then.29449
	li	$12, 0
	j	beq_cont.29450
beq_then.29449:
	mv	$13, $10
	lw.s	$f5, 0($13)
	addi	$13, $10, 4
	lw.s	$f6, 0($13)
	addi	$13, $10, 8
	lw.s	$f7, 0($13)
	mul.s	$f8, $f5, $f1
	lw	$13, 16($12)
	lw.s	$f9, 0($13)
	mul.s	$f8, $f8, $f9
	mul.s	$f9, $f6, $f2
	lw	$13, 16($12)
	addi	$13, $13, 4
	lw.s	$f10, 0($13)
	mul.s	$f9, $f9, $f10
	add.s	$f8, $f8, $f9
	mul.s	$f9, $f7, $f3
	lw	$13, 16($12)
	addi	$13, $13, 8
	lw.s	$f10, 0($13)
	mul.s	$f9, $f9, $f10
	add.s	$f8, $f8, $f9
	lw	$13, 12($12)
	beq	$13, $0, beq_then.29451
	mul.s	$f9, $f7, $f2
	mul.s	$f10, $f6, $f3
	add.s	$f9, $f9, $f10
	lw	$13, 36($12)
	lw.s	$f10, 0($13)
	mul.s	$f9, $f9, $f10
	mul.s	$f10, $f5, $f3
	mul.s	$f7, $f7, $f1
	add.s	$f7, $f10, $f7
	lw	$13, 36($12)
	addi	$13, $13, 4
	lw.s	$f10, 0($13)
	mul.s	$f7, $f7, $f10
	add.s	$f7, $f9, $f7
	mul.s	$f5, $f5, $f2
	mul.s	$f6, $f6, $f1
	add.s	$f5, $f5, $f6
	lw	$13, 36($12)
	addi	$13, $13, 8
	lw.s	$f6, 0($13)
	mul.s	$f5, $f5, $f6
	add.s	$f5, $f7, $f5
	lui.s	$f6, 0x3f00	# 0.500000の上位16ビット
	mul.s	$f5, $f5, $f6
	add.s	$f5, $f8, $f5
	j	beq_cont.29452
beq_then.29451:
	mv.s	$f5, $f8
beq_cont.29452:
	mul.s	$f6, $f1, $f1
	lw	$13, 16($12)
	lw.s	$f7, 0($13)
	mul.s	$f6, $f6, $f7
	mul.s	$f7, $f2, $f2
	lw	$13, 16($12)
	addi	$13, $13, 4
	lw.s	$f8, 0($13)
	mul.s	$f7, $f7, $f8
	add.s	$f6, $f6, $f7
	mul.s	$f7, $f3, $f3
	lw	$13, 16($12)
	addi	$13, $13, 8
	lw.s	$f8, 0($13)
	mul.s	$f7, $f7, $f8
	add.s	$f6, $f6, $f7
	lw	$13, 12($12)
	beq	$13, $0, beq_then.29453
	mul.s	$f7, $f2, $f3
	lw	$13, 36($12)
	lw.s	$f8, 0($13)
	mul.s	$f7, $f7, $f8
	add.s	$f6, $f6, $f7
	mul.s	$f3, $f3, $f1
	lw	$13, 36($12)
	addi	$13, $13, 4
	lw.s	$f7, 0($13)
	mul.s	$f3, $f3, $f7
	add.s	$f3, $f6, $f3
	mul.s	$f1, $f1, $f2
	lw	$13, 36($12)
	addi	$13, $13, 8
	lw.s	$f2, 0($13)
	mul.s	$f1, $f1, $f2
	add.s	$f1, $f3, $f1
	j	beq_cont.29454
beq_then.29453:
	mv.s	$f1, $f6
beq_cont.29454:
	lw	$13, 4($12)
	beq	$13, $3, beq_then.29455
	j	beq_cont.29456
beq_then.29455:
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f1, $f1, $f2
beq_cont.29456:
	mul.s	$f2, $f5, $f5
	mul.s	$f1, $f4, $f1
	sub.s	$f1, $f2, $f1
	ble.s	$f1, $f0, ble.s_then.29457
	li	$13, 1
	j	ble.s_cont.29458
ble.s_then.29457:
	li	$13, 0
ble.s_cont.29458:
	beq	$13, $0, beq_then.29459
	sqrt.s	$f1, $f1
	lw	$12, 24($12)
	beq	$12, $0, beq_then.29461
	j	beq_cont.29462
beq_then.29461:
	neg.s	$f1, $f1
beq_cont.29462:
	sub.s	$f1, $f1, $f5
	inv.s	$f2, $f4
	mul.s	$f1, $f1, $f2
	li	$12, 572
	sw.s	$f1, 0($12)
	li	$12, 1
	j	beq_cont.29460
beq_then.29459:
	li	$12, 0
beq_cont.29460:
beq_cont.29450:
	j	beq_cont.29444
beq_then.29443:
	lw	$12, 16($12)
	mv	$13, $10
	lw.s	$f4, 0($13)
	mv	$13, $12
	lw.s	$f5, 0($13)
	mul.s	$f4, $f4, $f5
	addi	$13, $10, 4
	lw.s	$f5, 0($13)
	addi	$13, $12, 4
	lw.s	$f6, 0($13)
	mul.s	$f5, $f5, $f6
	add.s	$f4, $f4, $f5
	addi	$13, $10, 8
	lw.s	$f5, 0($13)
	addi	$13, $12, 8
	lw.s	$f6, 0($13)
	mul.s	$f5, $f5, $f6
	add.s	$f4, $f4, $f5
	ble.s	$f4, $f0, ble.s_then.29463
	li	$13, 1
	j	ble.s_cont.29464
ble.s_then.29463:
	li	$13, 0
ble.s_cont.29464:
	beq	$13, $0, beq_then.29465
	mv	$13, $12
	lw.s	$f5, 0($13)
	mul.s	$f1, $f5, $f1
	addi	$13, $12, 4
	lw.s	$f5, 0($13)
	mul.s	$f2, $f5, $f2
	add.s	$f1, $f1, $f2
	addi	$12, $12, 8
	lw.s	$f2, 0($12)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	neg.s	$f1, $f1
	inv.s	$f2, $f4
	mul.s	$f1, $f1, $f2
	li	$12, 572
	sw.s	$f1, 0($12)
	li	$12, 1
	j	beq_cont.29466
beq_then.29465:
	li	$12, 0
beq_cont.29466:
beq_cont.29444:
	j	beq_cont.29442
beq_then.29441:
	mv	$13, $10
	lw.s	$f4, 0($13)
	beq.s	$f4, $f0, beq.s_then.29467
	li	$13, 0
	j	beq.s_cont.29468
beq.s_then.29467:
	li	$13, 1
beq.s_cont.29468:
	beq	$13, $0, beq_then.29469
	li	$13, 0
	j	beq_cont.29470
beq_then.29469:
	lw	$13, 16($12)
	lw	$14, 24($12)
	mv	$15, $10
	lw.s	$f4, 0($15)
	ble.s	$f0, $f4, ble.s_then.29471
	li	$15, 1
	j	ble.s_cont.29472
ble.s_then.29471:
	li	$15, 0
ble.s_cont.29472:
	beq	$14, $15, beq_then.29473
	li	$14, 1
	j	beq_cont.29474
beq_then.29473:
	li	$14, 0
beq_cont.29474:
	mv	$15, $13
	lw.s	$f4, 0($15)
	beq	$14, $0, beq_then.29475
	j	beq_cont.29476
beq_then.29475:
	neg.s	$f4, $f4
beq_cont.29476:
	sub.s	$f4, $f4, $f1
	mv	$14, $10
	lw.s	$f5, 0($14)
	inv.s	$f5, $f5
	mul.s	$f4, $f4, $f5
	addi	$14, $10, 4
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f2
	abs.s	$f5, $f5
	addi	$14, $13, 4
	lw.s	$f6, 0($14)
	ble.s	$f6, $f5, ble.s_then.29477
	li	$14, 1
	j	ble.s_cont.29478
ble.s_then.29477:
	li	$14, 0
ble.s_cont.29478:
	beq	$14, $0, beq_then.29479
	addi	$14, $10, 8
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f3
	abs.s	$f5, $f5
	addi	$13, $13, 8
	lw.s	$f6, 0($13)
	ble.s	$f6, $f5, ble.s_then.29481
	li	$13, 1
	j	ble.s_cont.29482
ble.s_then.29481:
	li	$13, 0
ble.s_cont.29482:
	beq	$13, $0, beq_then.29483
	li	$13, 572
	sw.s	$f4, 0($13)
	li	$13, 1
	j	beq_cont.29484
beq_then.29483:
	li	$13, 0
beq_cont.29484:
	j	beq_cont.29480
beq_then.29479:
	li	$13, 0
beq_cont.29480:
beq_cont.29470:
	beq	$13, $0, beq_then.29485
	li	$12, 1
	j	beq_cont.29486
beq_then.29485:
	addi	$13, $10, 4
	lw.s	$f4, 0($13)
	beq.s	$f4, $f0, beq.s_then.29487
	li	$13, 0
	j	beq.s_cont.29488
beq.s_then.29487:
	li	$13, 1
beq.s_cont.29488:
	beq	$13, $0, beq_then.29489
	li	$13, 0
	j	beq_cont.29490
beq_then.29489:
	lw	$13, 16($12)
	lw	$14, 24($12)
	addi	$15, $10, 4
	lw.s	$f4, 0($15)
	ble.s	$f0, $f4, ble.s_then.29491
	li	$15, 1
	j	ble.s_cont.29492
ble.s_then.29491:
	li	$15, 0
ble.s_cont.29492:
	beq	$14, $15, beq_then.29493
	li	$14, 1
	j	beq_cont.29494
beq_then.29493:
	li	$14, 0
beq_cont.29494:
	addi	$15, $13, 4
	lw.s	$f4, 0($15)
	beq	$14, $0, beq_then.29495
	j	beq_cont.29496
beq_then.29495:
	neg.s	$f4, $f4
beq_cont.29496:
	sub.s	$f4, $f4, $f2
	addi	$14, $10, 4
	lw.s	$f5, 0($14)
	inv.s	$f5, $f5
	mul.s	$f4, $f4, $f5
	addi	$14, $10, 8
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f3
	abs.s	$f5, $f5
	addi	$14, $13, 8
	lw.s	$f6, 0($14)
	ble.s	$f6, $f5, ble.s_then.29497
	li	$14, 1
	j	ble.s_cont.29498
ble.s_then.29497:
	li	$14, 0
ble.s_cont.29498:
	beq	$14, $0, beq_then.29499
	mv	$14, $10
	lw.s	$f5, 0($14)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f1
	abs.s	$f5, $f5
	lw.s	$f6, 0($13)
	ble.s	$f6, $f5, ble.s_then.29501
	li	$13, 1
	j	ble.s_cont.29502
ble.s_then.29501:
	li	$13, 0
ble.s_cont.29502:
	beq	$13, $0, beq_then.29503
	li	$13, 572
	sw.s	$f4, 0($13)
	li	$13, 1
	j	beq_cont.29504
beq_then.29503:
	li	$13, 0
beq_cont.29504:
	j	beq_cont.29500
beq_then.29499:
	li	$13, 0
beq_cont.29500:
beq_cont.29490:
	beq	$13, $0, beq_then.29505
	li	$12, 2
	j	beq_cont.29506
beq_then.29505:
	addi	$13, $10, 8
	lw.s	$f4, 0($13)
	beq.s	$f4, $f0, beq.s_then.29507
	li	$13, 0
	j	beq.s_cont.29508
beq.s_then.29507:
	li	$13, 1
beq.s_cont.29508:
	beq	$13, $0, beq_then.29509
	li	$12, 0
	j	beq_cont.29510
beq_then.29509:
	lw	$13, 16($12)
	lw	$12, 24($12)
	addi	$14, $10, 8
	lw.s	$f4, 0($14)
	ble.s	$f0, $f4, ble.s_then.29511
	li	$14, 1
	j	ble.s_cont.29512
ble.s_then.29511:
	li	$14, 0
ble.s_cont.29512:
	beq	$12, $14, beq_then.29513
	li	$12, 1
	j	beq_cont.29514
beq_then.29513:
	li	$12, 0
beq_cont.29514:
	addi	$14, $13, 8
	lw.s	$f4, 0($14)
	beq	$12, $0, beq_then.29515
	j	beq_cont.29516
beq_then.29515:
	neg.s	$f4, $f4
beq_cont.29516:
	sub.s	$f3, $f4, $f3
	addi	$12, $10, 8
	lw.s	$f4, 0($12)
	inv.s	$f4, $f4
	mul.s	$f3, $f3, $f4
	mv	$12, $10
	lw.s	$f4, 0($12)
	mul.s	$f4, $f3, $f4
	add.s	$f1, $f4, $f1
	abs.s	$f1, $f1
	mv	$12, $13
	lw.s	$f4, 0($12)
	ble.s	$f4, $f1, ble.s_then.29517
	li	$12, 1
	j	ble.s_cont.29518
ble.s_then.29517:
	li	$12, 0
ble.s_cont.29518:
	beq	$12, $0, beq_then.29519
	addi	$12, $10, 4
	lw.s	$f1, 0($12)
	mul.s	$f1, $f3, $f1
	add.s	$f1, $f1, $f2
	abs.s	$f1, $f1
	addi	$12, $13, 4
	lw.s	$f2, 0($12)
	ble.s	$f2, $f1, ble.s_then.29521
	li	$12, 1
	j	ble.s_cont.29522
ble.s_then.29521:
	li	$12, 0
ble.s_cont.29522:
	beq	$12, $0, beq_then.29523
	li	$12, 572
	sw.s	$f3, 0($12)
	li	$12, 1
	j	beq_cont.29524
beq_then.29523:
	li	$12, 0
beq_cont.29524:
	j	beq_cont.29520
beq_then.29519:
	li	$12, 0
beq_cont.29520:
beq_cont.29510:
	beq	$12, $0, beq_then.29525
	li	$12, 3
	j	beq_cont.29526
beq_then.29525:
	li	$12, 0
beq_cont.29526:
beq_cont.29506:
beq_cont.29486:
beq_cont.29442:
	beq	$12, $0, beq_then.29527
	li	$12, 572
	lw.s	$f1, 0($12)
	li	$12, 580
	lw.s	$f2, 0($12)
	ble.s	$f2, $f1, ble.s_then.29529
	li	$12, 1
	j	ble.s_cont.29530
ble.s_then.29529:
	li	$12, 0
ble.s_cont.29530:
	beq	$12, $0, beq_then.29531
	li	$12, 1
	mv	$9, $11
	mv	$8, $12
	sw	$ra, 12($sp)
	addi	$sp, $sp, 16
	jal	solve_one_or_network..7211
	addi	$sp, $sp, -16
	lw	$ra, 12($sp)
	j	beq_cont.29532
beq_then.29531:
beq_cont.29532:
	j	beq_cont.29528
beq_then.29527:
beq_cont.29528:
	j	beq_cont.29440
beq_then.29439:
	li	$12, 1
	mv	$9, $11
	mv	$8, $12
	sw	$ra, 12($sp)
	addi	$sp, $sp, 16
	jal	solve_one_or_network..7211
	addi	$sp, $sp, -16
	lw	$ra, 12($sp)
beq_cont.29440:
	lw	$8, 8($sp)
	addi	$8, $8, 1
	lw	$9, 4($sp)
	lw	$10, 0($sp)
	j	trace_or_matrix..7215
beq_then.29438:
	jr	$ra
solve_each_element_fast..7221:
	lw	$11, 0($10)
	sll	$12, $8, 2
	add	$12, $9, $12
	lw	$12, 0($12)
	beq	$12, $7, beq_then.29534
	sll	$13, $12, 2
	addi	$13, $13, 80
	lw	$13, 0($13)
	lw	$14, 40($13)
	mv	$15, $14
	lw.s	$f1, 0($15)
	addi	$15, $14, 4
	lw.s	$f2, 0($15)
	addi	$15, $14, 8
	lw.s	$f3, 0($15)
	lw	$15, 4($10)
	sll	$16, $12, 2
	add	$15, $15, $16
	lw	$15, 0($15)
	lw	$16, 4($13)
	beq	$16, $1, beq_then.29535
	beq	$16, $2, beq_then.29537
	mv	$16, $15
	lw.s	$f4, 0($16)
	beq.s	$f4, $f0, beq.s_then.29539
	li	$16, 0
	j	beq.s_cont.29540
beq.s_then.29539:
	li	$16, 1
beq.s_cont.29540:
	beq	$16, $0, beq_then.29541
	li	$13, 0
	j	beq_cont.29542
beq_then.29541:
	addi	$16, $15, 4
	lw.s	$f5, 0($16)
	mul.s	$f1, $f5, $f1
	addi	$16, $15, 8
	lw.s	$f5, 0($16)
	mul.s	$f2, $f5, $f2
	add.s	$f1, $f1, $f2
	addi	$16, $15, 12
	lw.s	$f2, 0($16)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	addi	$14, $14, 12
	lw.s	$f2, 0($14)
	mul.s	$f3, $f1, $f1
	mul.s	$f2, $f4, $f2
	sub.s	$f2, $f3, $f2
	ble.s	$f2, $f0, ble.s_then.29543
	li	$14, 1
	j	ble.s_cont.29544
ble.s_then.29543:
	li	$14, 0
ble.s_cont.29544:
	beq	$14, $0, beq_then.29545
	lw	$13, 24($13)
	beq	$13, $0, beq_then.29547
	sqrt.s	$f2, $f2
	add.s	$f1, $f1, $f2
	addi	$13, $15, 16
	lw.s	$f2, 0($13)
	mul.s	$f1, $f1, $f2
	li	$13, 572
	sw.s	$f1, 0($13)
	j	beq_cont.29548
beq_then.29547:
	sqrt.s	$f2, $f2
	sub.s	$f1, $f1, $f2
	addi	$13, $15, 16
	lw.s	$f2, 0($13)
	mul.s	$f1, $f1, $f2
	li	$13, 572
	sw.s	$f1, 0($13)
beq_cont.29548:
	li	$13, 1
	j	beq_cont.29546
beq_then.29545:
	li	$13, 0
beq_cont.29546:
beq_cont.29542:
	j	beq_cont.29538
beq_then.29537:
	mv	$13, $15
	lw.s	$f1, 0($13)
	ble.s	$f0, $f1, ble.s_then.29549
	li	$13, 1
	j	ble.s_cont.29550
ble.s_then.29549:
	li	$13, 0
ble.s_cont.29550:
	beq	$13, $0, beq_then.29551
	mv	$13, $15
	lw.s	$f1, 0($13)
	addi	$13, $14, 12
	lw.s	$f2, 0($13)
	mul.s	$f1, $f1, $f2
	li	$13, 572
	sw.s	$f1, 0($13)
	li	$13, 1
	j	beq_cont.29552
beq_then.29551:
	li	$13, 0
beq_cont.29552:
beq_cont.29538:
	j	beq_cont.29536
beq_then.29535:
	lw	$14, 0($10)
	mv	$16, $15
	lw.s	$f4, 0($16)
	sub.s	$f4, $f4, $f1
	addi	$16, $15, 4
	lw.s	$f5, 0($16)
	mul.s	$f4, $f4, $f5
	addi	$16, $14, 4
	lw.s	$f5, 0($16)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f2
	abs.s	$f5, $f5
	lw	$16, 16($13)
	addi	$16, $16, 4
	lw.s	$f6, 0($16)
	ble.s	$f6, $f5, ble.s_then.29553
	li	$16, 1
	j	ble.s_cont.29554
ble.s_then.29553:
	li	$16, 0
ble.s_cont.29554:
	beq	$16, $0, beq_then.29555
	addi	$16, $14, 8
	lw.s	$f5, 0($16)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f3
	abs.s	$f5, $f5
	lw	$16, 16($13)
	addi	$16, $16, 8
	lw.s	$f6, 0($16)
	ble.s	$f6, $f5, ble.s_then.29557
	li	$16, 1
	j	ble.s_cont.29558
ble.s_then.29557:
	li	$16, 0
ble.s_cont.29558:
	beq	$16, $0, beq_then.29559
	addi	$16, $15, 4
	lw.s	$f5, 0($16)
	beq.s	$f5, $f0, beq.s_then.29561
	li	$16, 0
	j	beq.s_cont.29562
beq.s_then.29561:
	li	$16, 1
beq.s_cont.29562:
	beq	$16, $0, beq_then.29563
	li	$16, 0
	j	beq_cont.29564
beq_then.29563:
	li	$16, 1
beq_cont.29564:
	j	beq_cont.29560
beq_then.29559:
	li	$16, 0
beq_cont.29560:
	j	beq_cont.29556
beq_then.29555:
	li	$16, 0
beq_cont.29556:
	beq	$16, $0, beq_then.29565
	li	$13, 572
	sw.s	$f4, 0($13)
	li	$13, 1
	j	beq_cont.29566
beq_then.29565:
	addi	$16, $15, 8
	lw.s	$f4, 0($16)
	sub.s	$f4, $f4, $f2
	addi	$16, $15, 12
	lw.s	$f5, 0($16)
	mul.s	$f4, $f4, $f5
	mv	$16, $14
	lw.s	$f5, 0($16)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f1
	abs.s	$f5, $f5
	lw	$16, 16($13)
	lw.s	$f6, 0($16)
	ble.s	$f6, $f5, ble.s_then.29567
	li	$16, 1
	j	ble.s_cont.29568
ble.s_then.29567:
	li	$16, 0
ble.s_cont.29568:
	beq	$16, $0, beq_then.29569
	addi	$16, $14, 8
	lw.s	$f5, 0($16)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f3
	abs.s	$f5, $f5
	lw	$16, 16($13)
	addi	$16, $16, 8
	lw.s	$f6, 0($16)
	ble.s	$f6, $f5, ble.s_then.29571
	li	$16, 1
	j	ble.s_cont.29572
ble.s_then.29571:
	li	$16, 0
ble.s_cont.29572:
	beq	$16, $0, beq_then.29573
	addi	$16, $15, 12
	lw.s	$f5, 0($16)
	beq.s	$f5, $f0, beq.s_then.29575
	li	$16, 0
	j	beq.s_cont.29576
beq.s_then.29575:
	li	$16, 1
beq.s_cont.29576:
	beq	$16, $0, beq_then.29577
	li	$16, 0
	j	beq_cont.29578
beq_then.29577:
	li	$16, 1
beq_cont.29578:
	j	beq_cont.29574
beq_then.29573:
	li	$16, 0
beq_cont.29574:
	j	beq_cont.29570
beq_then.29569:
	li	$16, 0
beq_cont.29570:
	beq	$16, $0, beq_then.29579
	li	$13, 572
	sw.s	$f4, 0($13)
	li	$13, 2
	j	beq_cont.29580
beq_then.29579:
	addi	$16, $15, 16
	lw.s	$f4, 0($16)
	sub.s	$f3, $f4, $f3
	addi	$16, $15, 20
	lw.s	$f4, 0($16)
	mul.s	$f3, $f3, $f4
	mv	$16, $14
	lw.s	$f4, 0($16)
	mul.s	$f4, $f3, $f4
	add.s	$f1, $f4, $f1
	abs.s	$f1, $f1
	lw	$16, 16($13)
	lw.s	$f4, 0($16)
	ble.s	$f4, $f1, ble.s_then.29581
	li	$16, 1
	j	ble.s_cont.29582
ble.s_then.29581:
	li	$16, 0
ble.s_cont.29582:
	beq	$16, $0, beq_then.29583
	addi	$14, $14, 4
	lw.s	$f1, 0($14)
	mul.s	$f1, $f3, $f1
	add.s	$f1, $f1, $f2
	abs.s	$f1, $f1
	lw	$13, 16($13)
	addi	$13, $13, 4
	lw.s	$f2, 0($13)
	ble.s	$f2, $f1, ble.s_then.29585
	li	$13, 1
	j	ble.s_cont.29586
ble.s_then.29585:
	li	$13, 0
ble.s_cont.29586:
	beq	$13, $0, beq_then.29587
	addi	$13, $15, 20
	lw.s	$f1, 0($13)
	beq.s	$f1, $f0, beq.s_then.29589
	li	$13, 0
	j	beq.s_cont.29590
beq.s_then.29589:
	li	$13, 1
beq.s_cont.29590:
	beq	$13, $0, beq_then.29591
	li	$13, 0
	j	beq_cont.29592
beq_then.29591:
	li	$13, 1
beq_cont.29592:
	j	beq_cont.29588
beq_then.29587:
	li	$13, 0
beq_cont.29588:
	j	beq_cont.29584
beq_then.29583:
	li	$13, 0
beq_cont.29584:
	beq	$13, $0, beq_then.29593
	li	$13, 572
	sw.s	$f3, 0($13)
	li	$13, 3
	j	beq_cont.29594
beq_then.29593:
	li	$13, 0
beq_cont.29594:
beq_cont.29580:
beq_cont.29566:
beq_cont.29536:
	beq	$13, $0, beq_then.29595
	li	$14, 572
	lw.s	$f1, 0($14)
	ble.s	$f1, $f0, ble.s_then.29596
	li	$14, 1
	j	ble.s_cont.29597
ble.s_then.29596:
	li	$14, 0
ble.s_cont.29597:
	sw	$10, 0($sp)
	sw	$9, 4($sp)
	sw	$8, 8($sp)
	beq	$14, $0, beq_then.29598
	li	$14, 580
	lw.s	$f2, 0($14)
	ble.s	$f2, $f1, ble.s_then.29600
	li	$14, 1
	j	ble.s_cont.29601
ble.s_then.29600:
	li	$14, 0
ble.s_cont.29601:
	beq	$14, $0, beq_then.29602
	lui.s	$f2, 0x3c23	# 0.010000の上位16ビット
	lli.s	$f2, 0xd70a	# 0.010000の下位16ビット
	add.s	$f1, $f1, $f2
	mv	$14, $11
	lw.s	$f2, 0($14)
	mul.s	$f2, $f2, $f1
	li	$14, 680
	lw.s	$f3, 0($14)
	add.s	$f2, $f2, $f3
	addi	$14, $11, 4
	lw.s	$f3, 0($14)
	mul.s	$f3, $f3, $f1
	li	$14, 684
	lw.s	$f4, 0($14)
	add.s	$f3, $f3, $f4
	addi	$11, $11, 8
	lw.s	$f4, 0($11)
	mul.s	$f4, $f4, $f1
	li	$11, 688
	lw.s	$f5, 0($11)
	add.s	$f4, $f4, $f5
	li	$11, 0
	sw	$13, 12($sp)
	sw	$12, 16($sp)
	sw.s	$f4, 20($sp)
	sw.s	$f3, 24($sp)
	sw.s	$f2, 28($sp)
	sw.s	$f1, 32($sp)
	mv	$8, $11
	mv.s	$f1, $f2
	mv.s	$f2, $f3
	mv.s	$f3, $f4
	sw	$ra, 36($sp)
	addi	$sp, $sp, 40
	jal	check_all_inside..7192
	addi	$sp, $sp, -40
	lw	$ra, 36($sp)
	beq	$8, $0, beq_then.29604
	li	$8, 580
	lw.s	$f1, 32($sp)
	sw.s	$f1, 0($8)
	li	$8, 584
	lw.s	$f1, 28($sp)
	sw.s	$f1, 0($8)
	li	$8, 588
	lw.s	$f1, 24($sp)
	sw.s	$f1, 0($8)
	li	$8, 592
	lw.s	$f1, 20($sp)
	sw.s	$f1, 0($8)
	li	$8, 596
	lw	$9, 16($sp)
	sw	$9, 0($8)
	li	$8, 576
	lw	$9, 12($sp)
	sw	$9, 0($8)
	j	beq_cont.29605
beq_then.29604:
beq_cont.29605:
	j	beq_cont.29603
beq_then.29602:
beq_cont.29603:
	j	beq_cont.29599
beq_then.29598:
beq_cont.29599:
	lw	$8, 8($sp)
	addi	$8, $8, 1
	lw	$9, 4($sp)
	lw	$10, 0($sp)
	j	solve_each_element_fast..7221
beq_then.29595:
	sll	$11, $12, 2
	addi	$11, $11, 80
	lw	$11, 0($11)
	lw	$11, 24($11)
	beq	$11, $0, beq_then.29606
	addi	$8, $8, 1
	j	solve_each_element_fast..7221
beq_then.29606:
	jr	$ra
beq_then.29534:
	jr	$ra
solve_one_or_network_fast..7225:
	sll	$11, $8, 2
	add	$11, $9, $11
	lw	$11, 0($11)
	beq	$11, $7, beq_then.29609
	sll	$11, $11, 2
	addi	$11, $11, 364
	lw	$11, 0($11)
	li	$12, 0
	sw	$10, 0($sp)
	sw	$9, 4($sp)
	sw	$8, 8($sp)
	mv	$9, $11
	mv	$8, $12
	sw	$ra, 12($sp)
	addi	$sp, $sp, 16
	jal	solve_each_element_fast..7221
	addi	$sp, $sp, -16
	lw	$ra, 12($sp)
	lw	$8, 8($sp)
	addi	$8, $8, 1
	lw	$9, 4($sp)
	lw	$10, 0($sp)
	j	solve_one_or_network_fast..7225
beq_then.29609:
	jr	$ra
trace_or_matrix_fast..7229:
	sll	$11, $8, 2
	add	$11, $9, $11
	lw	$11, 0($11)
	mv	$12, $11
	lw	$12, 0($12)
	beq	$12, $7, beq_then.29611
	li	$13, 99
	sw	$10, 0($sp)
	sw	$9, 4($sp)
	sw	$8, 8($sp)
	beq	$12, $13, beq_then.29612
	sll	$13, $12, 2
	addi	$13, $13, 80
	lw	$13, 0($13)
	lw	$14, 40($13)
	mv	$15, $14
	lw.s	$f1, 0($15)
	addi	$15, $14, 4
	lw.s	$f2, 0($15)
	addi	$15, $14, 8
	lw.s	$f3, 0($15)
	lw	$15, 4($10)
	sll	$12, $12, 2
	add	$12, $15, $12
	lw	$12, 0($12)
	lw	$15, 4($13)
	beq	$15, $1, beq_then.29614
	beq	$15, $2, beq_then.29616
	mv	$15, $12
	lw.s	$f4, 0($15)
	beq.s	$f4, $f0, beq.s_then.29618
	li	$15, 0
	j	beq.s_cont.29619
beq.s_then.29618:
	li	$15, 1
beq.s_cont.29619:
	beq	$15, $0, beq_then.29620
	li	$12, 0
	j	beq_cont.29621
beq_then.29620:
	addi	$15, $12, 4
	lw.s	$f5, 0($15)
	mul.s	$f1, $f5, $f1
	addi	$15, $12, 8
	lw.s	$f5, 0($15)
	mul.s	$f2, $f5, $f2
	add.s	$f1, $f1, $f2
	addi	$15, $12, 12
	lw.s	$f2, 0($15)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	addi	$14, $14, 12
	lw.s	$f2, 0($14)
	mul.s	$f3, $f1, $f1
	mul.s	$f2, $f4, $f2
	sub.s	$f2, $f3, $f2
	ble.s	$f2, $f0, ble.s_then.29622
	li	$14, 1
	j	ble.s_cont.29623
ble.s_then.29622:
	li	$14, 0
ble.s_cont.29623:
	beq	$14, $0, beq_then.29624
	lw	$13, 24($13)
	beq	$13, $0, beq_then.29626
	sqrt.s	$f2, $f2
	add.s	$f1, $f1, $f2
	addi	$12, $12, 16
	lw.s	$f2, 0($12)
	mul.s	$f1, $f1, $f2
	li	$12, 572
	sw.s	$f1, 0($12)
	j	beq_cont.29627
beq_then.29626:
	sqrt.s	$f2, $f2
	sub.s	$f1, $f1, $f2
	addi	$12, $12, 16
	lw.s	$f2, 0($12)
	mul.s	$f1, $f1, $f2
	li	$12, 572
	sw.s	$f1, 0($12)
beq_cont.29627:
	li	$12, 1
	j	beq_cont.29625
beq_then.29624:
	li	$12, 0
beq_cont.29625:
beq_cont.29621:
	j	beq_cont.29617
beq_then.29616:
	mv	$13, $12
	lw.s	$f1, 0($13)
	ble.s	$f0, $f1, ble.s_then.29628
	li	$13, 1
	j	ble.s_cont.29629
ble.s_then.29628:
	li	$13, 0
ble.s_cont.29629:
	beq	$13, $0, beq_then.29630
	lw.s	$f1, 0($12)
	addi	$12, $14, 12
	lw.s	$f2, 0($12)
	mul.s	$f1, $f1, $f2
	li	$12, 572
	sw.s	$f1, 0($12)
	li	$12, 1
	j	beq_cont.29631
beq_then.29630:
	li	$12, 0
beq_cont.29631:
beq_cont.29617:
	j	beq_cont.29615
beq_then.29614:
	lw	$14, 0($10)
	mv	$15, $12
	lw.s	$f4, 0($15)
	sub.s	$f4, $f4, $f1
	addi	$15, $12, 4
	lw.s	$f5, 0($15)
	mul.s	$f4, $f4, $f5
	addi	$15, $14, 4
	lw.s	$f5, 0($15)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f2
	abs.s	$f5, $f5
	lw	$15, 16($13)
	addi	$15, $15, 4
	lw.s	$f6, 0($15)
	ble.s	$f6, $f5, ble.s_then.29632
	li	$15, 1
	j	ble.s_cont.29633
ble.s_then.29632:
	li	$15, 0
ble.s_cont.29633:
	beq	$15, $0, beq_then.29634
	addi	$15, $14, 8
	lw.s	$f5, 0($15)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f3
	abs.s	$f5, $f5
	lw	$15, 16($13)
	addi	$15, $15, 8
	lw.s	$f6, 0($15)
	ble.s	$f6, $f5, ble.s_then.29636
	li	$15, 1
	j	ble.s_cont.29637
ble.s_then.29636:
	li	$15, 0
ble.s_cont.29637:
	beq	$15, $0, beq_then.29638
	addi	$15, $12, 4
	lw.s	$f5, 0($15)
	beq.s	$f5, $f0, beq.s_then.29640
	li	$15, 0
	j	beq.s_cont.29641
beq.s_then.29640:
	li	$15, 1
beq.s_cont.29641:
	beq	$15, $0, beq_then.29642
	li	$15, 0
	j	beq_cont.29643
beq_then.29642:
	li	$15, 1
beq_cont.29643:
	j	beq_cont.29639
beq_then.29638:
	li	$15, 0
beq_cont.29639:
	j	beq_cont.29635
beq_then.29634:
	li	$15, 0
beq_cont.29635:
	beq	$15, $0, beq_then.29644
	li	$12, 572
	sw.s	$f4, 0($12)
	li	$12, 1
	j	beq_cont.29645
beq_then.29644:
	addi	$15, $12, 8
	lw.s	$f4, 0($15)
	sub.s	$f4, $f4, $f2
	addi	$15, $12, 12
	lw.s	$f5, 0($15)
	mul.s	$f4, $f4, $f5
	mv	$15, $14
	lw.s	$f5, 0($15)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f1
	abs.s	$f5, $f5
	lw	$15, 16($13)
	lw.s	$f6, 0($15)
	ble.s	$f6, $f5, ble.s_then.29646
	li	$15, 1
	j	ble.s_cont.29647
ble.s_then.29646:
	li	$15, 0
ble.s_cont.29647:
	beq	$15, $0, beq_then.29648
	addi	$15, $14, 8
	lw.s	$f5, 0($15)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f3
	abs.s	$f5, $f5
	lw	$15, 16($13)
	addi	$15, $15, 8
	lw.s	$f6, 0($15)
	ble.s	$f6, $f5, ble.s_then.29650
	li	$15, 1
	j	ble.s_cont.29651
ble.s_then.29650:
	li	$15, 0
ble.s_cont.29651:
	beq	$15, $0, beq_then.29652
	addi	$15, $12, 12
	lw.s	$f5, 0($15)
	beq.s	$f5, $f0, beq.s_then.29654
	li	$15, 0
	j	beq.s_cont.29655
beq.s_then.29654:
	li	$15, 1
beq.s_cont.29655:
	beq	$15, $0, beq_then.29656
	li	$15, 0
	j	beq_cont.29657
beq_then.29656:
	li	$15, 1
beq_cont.29657:
	j	beq_cont.29653
beq_then.29652:
	li	$15, 0
beq_cont.29653:
	j	beq_cont.29649
beq_then.29648:
	li	$15, 0
beq_cont.29649:
	beq	$15, $0, beq_then.29658
	li	$12, 572
	sw.s	$f4, 0($12)
	li	$12, 2
	j	beq_cont.29659
beq_then.29658:
	addi	$15, $12, 16
	lw.s	$f4, 0($15)
	sub.s	$f3, $f4, $f3
	addi	$15, $12, 20
	lw.s	$f4, 0($15)
	mul.s	$f3, $f3, $f4
	mv	$15, $14
	lw.s	$f4, 0($15)
	mul.s	$f4, $f3, $f4
	add.s	$f1, $f4, $f1
	abs.s	$f1, $f1
	lw	$15, 16($13)
	lw.s	$f4, 0($15)
	ble.s	$f4, $f1, ble.s_then.29660
	li	$15, 1
	j	ble.s_cont.29661
ble.s_then.29660:
	li	$15, 0
ble.s_cont.29661:
	beq	$15, $0, beq_then.29662
	addi	$14, $14, 4
	lw.s	$f1, 0($14)
	mul.s	$f1, $f3, $f1
	add.s	$f1, $f1, $f2
	abs.s	$f1, $f1
	lw	$13, 16($13)
	addi	$13, $13, 4
	lw.s	$f2, 0($13)
	ble.s	$f2, $f1, ble.s_then.29664
	li	$13, 1
	j	ble.s_cont.29665
ble.s_then.29664:
	li	$13, 0
ble.s_cont.29665:
	beq	$13, $0, beq_then.29666
	addi	$12, $12, 20
	lw.s	$f1, 0($12)
	beq.s	$f1, $f0, beq.s_then.29668
	li	$12, 0
	j	beq.s_cont.29669
beq.s_then.29668:
	li	$12, 1
beq.s_cont.29669:
	beq	$12, $0, beq_then.29670
	li	$12, 0
	j	beq_cont.29671
beq_then.29670:
	li	$12, 1
beq_cont.29671:
	j	beq_cont.29667
beq_then.29666:
	li	$12, 0
beq_cont.29667:
	j	beq_cont.29663
beq_then.29662:
	li	$12, 0
beq_cont.29663:
	beq	$12, $0, beq_then.29672
	li	$12, 572
	sw.s	$f3, 0($12)
	li	$12, 3
	j	beq_cont.29673
beq_then.29672:
	li	$12, 0
beq_cont.29673:
beq_cont.29659:
beq_cont.29645:
beq_cont.29615:
	beq	$12, $0, beq_then.29674
	li	$12, 572
	lw.s	$f1, 0($12)
	li	$12, 580
	lw.s	$f2, 0($12)
	ble.s	$f2, $f1, ble.s_then.29676
	li	$12, 1
	j	ble.s_cont.29677
ble.s_then.29676:
	li	$12, 0
ble.s_cont.29677:
	beq	$12, $0, beq_then.29678
	li	$12, 1
	mv	$9, $11
	mv	$8, $12
	sw	$ra, 12($sp)
	addi	$sp, $sp, 16
	jal	solve_one_or_network_fast..7225
	addi	$sp, $sp, -16
	lw	$ra, 12($sp)
	j	beq_cont.29679
beq_then.29678:
beq_cont.29679:
	j	beq_cont.29675
beq_then.29674:
beq_cont.29675:
	j	beq_cont.29613
beq_then.29612:
	li	$12, 1
	mv	$9, $11
	mv	$8, $12
	sw	$ra, 12($sp)
	addi	$sp, $sp, 16
	jal	solve_one_or_network_fast..7225
	addi	$sp, $sp, -16
	lw	$ra, 12($sp)
beq_cont.29613:
	lw	$8, 8($sp)
	addi	$8, $8, 1
	lw	$9, 4($sp)
	lw	$10, 0($sp)
	j	trace_or_matrix_fast..7229
beq_then.29611:
	jr	$ra
trace_reflections..7251:
	ble	$0, $8, ble_then.29681
	jr	$ra
ble_then.29681:
	sll	$10, $8, 2
	addi	$10, $10, 1048
	lw	$10, 0($10)
	lw	$11, 4($10)
	lui.s	$f3, 0x4e6e	# 1000000000.000000の上位16ビット
	lli.s	$f3, 0x6b28	# 1000000000.000000の下位16ビット
	li	$12, 580
	sw.s	$f3, 0($12)
	li	$12, 0
	li	$13, 568
	lw	$13, 0($13)
	sw	$8, 0($sp)
	sw.s	$f2, 4($sp)
	sw	$9, 8($sp)
	sw.s	$f1, 12($sp)
	sw	$11, 16($sp)
	sw	$10, 20($sp)
	mv	$10, $11
	mv	$9, $13
	mv	$8, $12
	sw	$ra, 24($sp)
	addi	$sp, $sp, 28
	jal	trace_or_matrix_fast..7229
	addi	$sp, $sp, -28
	lw	$ra, 24($sp)
	li	$8, 580
	lw.s	$f1, 0($8)
	lui.s	$f2, 0xbdcc	# -0.100000の上位16ビット
	lli.s	$f2, 0xcccd	# -0.100000の下位16ビット
	ble.s	$f1, $f2, ble.s_then.29683
	li	$8, 1
	j	ble.s_cont.29684
ble.s_then.29683:
	li	$8, 0
ble.s_cont.29684:
	beq	$8, $0, beq_then.29685
	lui.s	$f2, 0x4cbe	# 100000000.000000の上位16ビット
	lli.s	$f2, 0xbc20	# 100000000.000000の下位16ビット
	ble.s	$f2, $f1, ble.s_then.29687
	li	$8, 1
	j	ble.s_cont.29688
ble.s_then.29687:
	li	$8, 0
ble.s_cont.29688:
	j	beq_cont.29686
beq_then.29685:
	li	$8, 0
beq_cont.29686:
	beq	$8, $0, beq_then.29689
	li	$8, 596
	lw	$8, 0($8)
	sll	$8, $8, 2
	li	$9, 576
	lw	$9, 0($9)
	add	$8, $8, $9
	lw	$9, 20($sp)
	lw	$10, 0($9)
	beq	$8, $10, beq_then.29691
	j	beq_cont.29692
beq_then.29691:
	li	$8, 0
	li	$10, 568
	lw	$10, 0($10)
	mv	$9, $10
	sw	$ra, 24($sp)
	addi	$sp, $sp, 28
	jal	shadow_check_one_or_matrix..7204
	addi	$sp, $sp, -28
	lw	$ra, 24($sp)
	beq	$8, $0, beq_then.29693
	li	$8, 0
	j	beq_cont.29694
beq_then.29693:
	li	$8, 1
beq_cont.29694:
	beq	$8, $0, beq_then.29695
	lw	$8, 16($sp)
	lw	$9, 0($8)
	li	$10, 600
	lw.s	$f1, 0($10)
	mv	$10, $9
	lw.s	$f2, 0($10)
	mul.s	$f1, $f1, $f2
	li	$10, 604
	lw.s	$f2, 0($10)
	addi	$10, $9, 4
	lw.s	$f3, 0($10)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	li	$10, 608
	lw.s	$f2, 0($10)
	addi	$9, $9, 8
	lw.s	$f3, 0($9)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	lw	$9, 20($sp)
	lw.s	$f2, 8($9)
	lw.s	$f3, 12($sp)
	mul.s	$f4, $f2, $f3
	mul.s	$f1, $f4, $f1
	lw	$8, 0($8)
	lw	$9, 8($sp)
	mv	$10, $9
	lw.s	$f4, 0($10)
	mv	$10, $8
	lw.s	$f5, 0($10)
	mul.s	$f4, $f4, $f5
	addi	$10, $9, 4
	lw.s	$f5, 0($10)
	addi	$10, $8, 4
	lw.s	$f6, 0($10)
	mul.s	$f5, $f5, $f6
	add.s	$f4, $f4, $f5
	addi	$10, $9, 8
	lw.s	$f5, 0($10)
	addi	$8, $8, 8
	lw.s	$f6, 0($8)
	mul.s	$f5, $f5, $f6
	add.s	$f4, $f4, $f5
	mul.s	$f2, $f2, $f4
	ble.s	$f1, $f0, ble.s_then.29697
	li	$8, 1
	j	ble.s_cont.29698
ble.s_then.29697:
	li	$8, 0
ble.s_cont.29698:
	beq	$8, $0, beq_then.29699
	li	$8, 636
	lw.s	$f4, 0($8)
	li	$8, 612
	lw.s	$f5, 0($8)
	mul.s	$f5, $f1, $f5
	add.s	$f4, $f4, $f5
	li	$8, 636
	sw.s	$f4, 0($8)
	li	$8, 640
	lw.s	$f4, 0($8)
	li	$8, 616
	lw.s	$f5, 0($8)
	mul.s	$f5, $f1, $f5
	add.s	$f4, $f4, $f5
	li	$8, 640
	sw.s	$f4, 0($8)
	li	$8, 644
	lw.s	$f4, 0($8)
	li	$8, 620
	lw.s	$f5, 0($8)
	mul.s	$f1, $f1, $f5
	add.s	$f1, $f4, $f1
	li	$8, 644
	sw.s	$f1, 0($8)
	j	beq_cont.29700
beq_then.29699:
beq_cont.29700:
	ble.s	$f2, $f0, ble.s_then.29701
	li	$8, 1
	j	ble.s_cont.29702
ble.s_then.29701:
	li	$8, 0
ble.s_cont.29702:
	beq	$8, $0, beq_then.29703
	mul.s	$f1, $f2, $f2
	mul.s	$f1, $f1, $f1
	lw.s	$f2, 4($sp)
	mul.s	$f1, $f1, $f2
	li	$8, 636
	lw.s	$f4, 0($8)
	add.s	$f4, $f4, $f1
	li	$8, 636
	sw.s	$f4, 0($8)
	li	$8, 640
	lw.s	$f4, 0($8)
	add.s	$f4, $f4, $f1
	li	$8, 640
	sw.s	$f4, 0($8)
	li	$8, 644
	lw.s	$f4, 0($8)
	add.s	$f1, $f4, $f1
	li	$8, 644
	sw.s	$f1, 0($8)
	j	beq_cont.29704
beq_then.29703:
beq_cont.29704:
	j	beq_cont.29696
beq_then.29695:
beq_cont.29696:
beq_cont.29692:
	j	beq_cont.29690
beq_then.29689:
beq_cont.29690:
	lw	$8, 0($sp)
	addi	$8, $8, -1
	lw.s	$f1, 12($sp)
	lw.s	$f2, 4($sp)
	lw	$9, 8($sp)
	j	trace_reflections..7251
trace_ray.A(f)A(A(f))A(i).7256:
	li	$11, 584
	ble	$8, $4, ble_then.29705
	jr	$ra
ble_then.29705:
	lw	$12, 8($10)
	lui.s	$f3, 0x4e6e	# 1000000000.000000の上位16ビット
	lli.s	$f3, 0x6b28	# 1000000000.000000の下位16ビット
	li	$13, 580
	sw.s	$f3, 0($13)
	li	$13, 0
	li	$14, 568
	lw	$14, 0($14)
	sw.s	$f2, 0($sp)
	sw	$11, 4($sp)
	sw	$10, 8($sp)
	sw.s	$f1, 12($sp)
	sw	$9, 16($sp)
	sw	$12, 20($sp)
	sw	$8, 24($sp)
	mv	$10, $9
	mv	$8, $13
	mv	$9, $14
	sw	$ra, 28($sp)
	addi	$sp, $sp, 32
	jal	trace_or_matrix..7215
	addi	$sp, $sp, -32
	lw	$ra, 28($sp)
	li	$8, 580
	lw.s	$f1, 0($8)
	lui.s	$f2, 0xbdcc	# -0.100000の上位16ビット
	lli.s	$f2, 0xcccd	# -0.100000の下位16ビット
	ble.s	$f1, $f2, ble.s_then.29707
	li	$8, 1
	j	ble.s_cont.29708
ble.s_then.29707:
	li	$8, 0
ble.s_cont.29708:
	beq	$8, $0, beq_then.29709
	lui.s	$f2, 0x4cbe	# 100000000.000000の上位16ビット
	lli.s	$f2, 0xbc20	# 100000000.000000の下位16ビット
	ble.s	$f2, $f1, ble.s_then.29711
	li	$8, 1
	j	ble.s_cont.29712
ble.s_then.29711:
	li	$8, 0
ble.s_cont.29712:
	j	beq_cont.29710
beq_then.29709:
	li	$8, 0
beq_cont.29710:
	beq	$8, $0, beq_then.29713
	li	$8, 596
	lw	$8, 0($8)
	sll	$9, $8, 2
	addi	$9, $9, 80
	lw	$9, 0($9)
	lw	$10, 8($9)
	lw	$11, 28($9)
	lw.s	$f1, 0($11)
	lw.s	$f2, 12($sp)
	mul.s	$f1, $f1, $f2
	lw	$11, 4($9)
	beq	$11, $1, beq_then.29714
	beq	$11, $2, beq_then.29716
	li	$11, 584
	lw.s	$f3, 0($11)
	lw	$11, 20($9)
	lw.s	$f4, 0($11)
	sub.s	$f3, $f3, $f4
	li	$11, 588
	lw.s	$f4, 0($11)
	lw	$11, 20($9)
	addi	$11, $11, 4
	lw.s	$f5, 0($11)
	sub.s	$f4, $f4, $f5
	li	$11, 592
	lw.s	$f5, 0($11)
	lw	$11, 20($9)
	addi	$11, $11, 8
	lw.s	$f6, 0($11)
	sub.s	$f5, $f5, $f6
	lw	$11, 16($9)
	lw.s	$f6, 0($11)
	mul.s	$f6, $f3, $f6
	lw	$11, 16($9)
	addi	$11, $11, 4
	lw.s	$f7, 0($11)
	mul.s	$f7, $f4, $f7
	lw	$11, 16($9)
	addi	$11, $11, 8
	lw.s	$f8, 0($11)
	mul.s	$f8, $f5, $f8
	lw	$11, 12($9)
	beq	$11, $0, beq_then.29718
	lw	$11, 36($9)
	addi	$11, $11, 8
	lw.s	$f9, 0($11)
	mul.s	$f9, $f4, $f9
	lw	$11, 36($9)
	addi	$11, $11, 4
	lw.s	$f10, 0($11)
	mul.s	$f10, $f5, $f10
	add.s	$f9, $f9, $f10
	lui.s	$f10, 0x3f00	# 0.500000の上位16ビット
	mul.s	$f9, $f9, $f10
	add.s	$f6, $f6, $f9
	li	$11, 600
	sw.s	$f6, 0($11)
	lw	$11, 36($9)
	addi	$11, $11, 8
	lw.s	$f6, 0($11)
	mul.s	$f6, $f3, $f6
	lw	$11, 36($9)
	lw.s	$f9, 0($11)
	mul.s	$f5, $f5, $f9
	add.s	$f5, $f6, $f5
	lui.s	$f6, 0x3f00	# 0.500000の上位16ビット
	mul.s	$f5, $f5, $f6
	add.s	$f5, $f7, $f5
	li	$11, 604
	sw.s	$f5, 0($11)
	lw	$11, 36($9)
	addi	$11, $11, 4
	lw.s	$f5, 0($11)
	mul.s	$f3, $f3, $f5
	lw	$11, 36($9)
	lw.s	$f5, 0($11)
	mul.s	$f4, $f4, $f5
	add.s	$f3, $f3, $f4
	lui.s	$f4, 0x3f00	# 0.500000の上位16ビット
	mul.s	$f3, $f3, $f4
	add.s	$f3, $f8, $f3
	li	$11, 608
	sw.s	$f3, 0($11)
	j	beq_cont.29719
beq_then.29718:
	li	$11, 600
	sw.s	$f6, 0($11)
	li	$11, 604
	sw.s	$f7, 0($11)
	li	$11, 608
	sw.s	$f8, 0($11)
beq_cont.29719:
	lw	$11, 24($9)
	li	$12, 600
	lw.s	$f3, 0($12)
	mul.s	$f3, $f3, $f3
	li	$12, 604
	lw.s	$f4, 0($12)
	mul.s	$f4, $f4, $f4
	add.s	$f3, $f3, $f4
	li	$12, 608
	lw.s	$f4, 0($12)
	mul.s	$f4, $f4, $f4
	add.s	$f3, $f3, $f4
	sqrt.s	$f3, $f3
	beq.s	$f3, $f0, beq.s_then.29720
	li	$12, 0
	j	beq.s_cont.29721
beq.s_then.29720:
	li	$12, 1
beq.s_cont.29721:
	beq	$12, $0, beq_then.29722
	lui.s	$f3, 0x3f80	# 1.000000の上位16ビット
	j	beq_cont.29723
beq_then.29722:
	beq	$11, $0, beq_then.29724
	inv.s	$f3, $f3
	neg.s	$f3, $f3
	j	beq_cont.29725
beq_then.29724:
	inv.s	$f3, $f3
beq_cont.29725:
beq_cont.29723:
	li	$11, 600
	lw.s	$f4, 0($11)
	mul.s	$f4, $f4, $f3
	li	$11, 600
	sw.s	$f4, 0($11)
	li	$11, 604
	lw.s	$f4, 0($11)
	mul.s	$f4, $f4, $f3
	li	$11, 604
	sw.s	$f4, 0($11)
	li	$11, 608
	lw.s	$f4, 0($11)
	mul.s	$f3, $f4, $f3
	li	$11, 608
	sw.s	$f3, 0($11)
	j	beq_cont.29717
beq_then.29716:
	lw	$11, 16($9)
	lw.s	$f3, 0($11)
	neg.s	$f3, $f3
	li	$11, 600
	sw.s	$f3, 0($11)
	lw	$11, 16($9)
	addi	$11, $11, 4
	lw.s	$f3, 0($11)
	neg.s	$f3, $f3
	li	$11, 604
	sw.s	$f3, 0($11)
	lw	$11, 16($9)
	addi	$11, $11, 8
	lw.s	$f3, 0($11)
	neg.s	$f3, $f3
	li	$11, 608
	sw.s	$f3, 0($11)
beq_cont.29717:
	j	beq_cont.29715
beq_then.29714:
	li	$11, 576
	lw	$11, 0($11)
	lui.s	$f3, 0x0	# 0.000000の上位16ビット
	li	$12, 600
	sw.s	$f3, 0($12)
	li	$12, 604
	sw.s	$f3, 0($12)
	li	$12, 608
	sw.s	$f3, 0($12)
	addi	$12, $11, -1
	addi	$11, $11, -1
	sll	$11, $11, 2
	lw	$13, 16($sp)
	add	$11, $13, $11
	lw.s	$f3, 0($11)
	beq.s	$f3, $f0, beq.s_then.29726
	li	$11, 0
	j	beq.s_cont.29727
beq.s_then.29726:
	li	$11, 1
beq.s_cont.29727:
	beq	$11, $0, beq_then.29728
	lui.s	$f3, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29729
beq_then.29728:
	ble.s	$f3, $f0, ble.s_then.29730
	li	$11, 1
	j	ble.s_cont.29731
ble.s_then.29730:
	li	$11, 0
ble.s_cont.29731:
	beq	$11, $0, beq_then.29732
	lui.s	$f3, 0x3f80	# 1.000000の上位16ビット
	j	beq_cont.29733
beq_then.29732:
	lui.s	$f3, 0xbf80	# -1.000000の上位16ビット
beq_cont.29733:
beq_cont.29729:
	neg.s	$f3, $f3
	sll	$11, $12, 2
	addi	$11, $11, 600
	sw.s	$f3, 0($11)
beq_cont.29715:
	li	$11, 584
	lw.s	$f3, 0($11)
	li	$11, 668
	sw.s	$f3, 0($11)
	li	$11, 588
	lw.s	$f3, 0($11)
	li	$11, 672
	sw.s	$f3, 0($11)
	li	$11, 592
	lw.s	$f3, 0($11)
	li	$11, 676
	sw.s	$f3, 0($11)
	lw	$11, 0($9)
	lw	$12, 32($9)
	lw.s	$f3, 0($12)
	li	$12, 612
	sw.s	$f3, 0($12)
	lw	$12, 32($9)
	addi	$12, $12, 4
	lw.s	$f3, 0($12)
	li	$12, 616
	sw.s	$f3, 0($12)
	lw	$12, 32($9)
	addi	$12, $12, 8
	lw.s	$f3, 0($12)
	li	$12, 620
	sw.s	$f3, 0($12)
	sw	$10, 28($sp)
	sw.s	$f1, 32($sp)
	sw	$9, 36($sp)
	sw	$8, 40($sp)
	beq	$11, $1, beq_then.29734
	beq	$11, $2, beq_then.29736
	beq	$11, $3, beq_then.29738
	beq	$11, $4, beq_then.29740
	j	beq_cont.29741
beq_then.29740:
	li	$11, 584
	lw.s	$f3, 0($11)
	lw	$11, 20($9)
	lw.s	$f4, 0($11)
	sub.s	$f3, $f3, $f4
	lw	$11, 16($9)
	lw.s	$f4, 0($11)
	sqrt.s	$f4, $f4
	mul.s	$f3, $f3, $f4
	li	$11, 592
	lw.s	$f4, 0($11)
	lw	$11, 20($9)
	addi	$11, $11, 8
	lw.s	$f5, 0($11)
	sub.s	$f4, $f4, $f5
	lw	$11, 16($9)
	addi	$11, $11, 8
	lw.s	$f5, 0($11)
	sqrt.s	$f5, $f5
	mul.s	$f4, $f4, $f5
	mul.s	$f5, $f3, $f3
	mul.s	$f6, $f4, $f4
	add.s	$f5, $f5, $f6
	abs.s	$f6, $f3
	lui.s	$f7, 0x38d1	# 0.000100の上位16ビット
	lli.s	$f7, 0xb717	# 0.000100の下位16ビット
	ble.s	$f7, $f6, ble.s_then.29742
	li	$11, 1
	j	ble.s_cont.29743
ble.s_then.29742:
	li	$11, 0
ble.s_cont.29743:
	beq	$11, $0, beq_then.29744
	lui.s	$f3, 0x4170	# 15.000000の上位16ビット
	j	beq_cont.29745
beq_then.29744:
	inv.s	$f3, $f3
	mul.s	$f3, $f4, $f3
	abs.s	$f3, $f3
	mul.s	$f4, $f3, $f3
	lui.s	$f6, 0x3f80	# 1.000000の上位16ビット
	lui.s	$f7, 0x3eaa	# 0.333333の上位16ビット
	lli.s	$f7, 0xaaab	# 0.333333の下位16ビット
	lui.s	$f8, 0x3e4c	# 0.200000の上位16ビット
	lli.s	$f8, 0xcccd	# 0.200000の下位16ビット
	lui.s	$f9, 0x3e12	# 0.142857の上位16ビット
	lli.s	$f9, 0x4925	# 0.142857の下位16ビット
	mul.s	$f9, $f4, $f9
	sub.s	$f8, $f8, $f9
	mul.s	$f8, $f4, $f8
	sub.s	$f7, $f7, $f8
	mul.s	$f4, $f4, $f7
	sub.s	$f4, $f6, $f4
	mul.s	$f3, $f3, $f4
	lui.s	$f4, 0x41f0	# 30.000000の上位16ビット
	mul.s	$f3, $f3, $f4
	lui.s	$f4, 0x3ea2	# 0.318310の上位16ビット
	lli.s	$f4, 0xf983	# 0.318310の下位16ビット
	mul.s	$f3, $f3, $f4
beq_cont.29745:
	ftoi	$11, $f3
	itof	$f4, $11
	ble.s	$f0, $f3, ble.s_then.29746
	beq.s	$f3, $f4, beq.s_then.29748
	lui.s	$f6, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f4, $f4, $f6
	j	beq.s_cont.29749
beq.s_then.29748:
	mv.s	$f4, $f3
beq.s_cont.29749:
	j	ble.s_cont.29747
ble.s_then.29746:
ble.s_cont.29747:
	sub.s	$f3, $f3, $f4
	li	$11, 588
	lw.s	$f4, 0($11)
	lw	$11, 20($9)
	addi	$11, $11, 4
	lw.s	$f6, 0($11)
	sub.s	$f4, $f4, $f6
	lw	$11, 16($9)
	addi	$11, $11, 4
	lw.s	$f6, 0($11)
	sqrt.s	$f6, $f6
	mul.s	$f4, $f4, $f6
	abs.s	$f6, $f5
	lui.s	$f7, 0x38d1	# 0.000100の上位16ビット
	lli.s	$f7, 0xb717	# 0.000100の下位16ビット
	ble.s	$f7, $f6, ble.s_then.29750
	li	$11, 1
	j	ble.s_cont.29751
ble.s_then.29750:
	li	$11, 0
ble.s_cont.29751:
	beq	$11, $0, beq_then.29752
	lui.s	$f4, 0x4170	# 15.000000の上位16ビット
	j	beq_cont.29753
beq_then.29752:
	inv.s	$f5, $f5
	mul.s	$f4, $f4, $f5
	abs.s	$f4, $f4
	mul.s	$f5, $f4, $f4
	lui.s	$f6, 0x3f80	# 1.000000の上位16ビット
	lui.s	$f7, 0x3eaa	# 0.333333の上位16ビット
	lli.s	$f7, 0xaaab	# 0.333333の下位16ビット
	lui.s	$f8, 0x3e4c	# 0.200000の上位16ビット
	lli.s	$f8, 0xcccd	# 0.200000の下位16ビット
	lui.s	$f9, 0x3e12	# 0.142857の上位16ビット
	lli.s	$f9, 0x4925	# 0.142857の下位16ビット
	mul.s	$f9, $f5, $f9
	sub.s	$f8, $f8, $f9
	mul.s	$f8, $f5, $f8
	sub.s	$f7, $f7, $f8
	mul.s	$f5, $f5, $f7
	sub.s	$f5, $f6, $f5
	mul.s	$f4, $f4, $f5
	lui.s	$f5, 0x41f0	# 30.000000の上位16ビット
	mul.s	$f4, $f4, $f5
	lui.s	$f5, 0x3ea2	# 0.318310の上位16ビット
	lli.s	$f5, 0xf983	# 0.318310の下位16ビット
	mul.s	$f4, $f4, $f5
beq_cont.29753:
	ftoi	$11, $f4
	itof	$f5, $11
	ble.s	$f0, $f4, ble.s_then.29754
	beq.s	$f4, $f5, beq.s_then.29756
	lui.s	$f6, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f5, $f5, $f6
	j	beq.s_cont.29757
beq.s_then.29756:
	mv.s	$f5, $f4
beq.s_cont.29757:
	j	ble.s_cont.29755
ble.s_then.29754:
ble.s_cont.29755:
	sub.s	$f4, $f4, $f5
	lui.s	$f5, 0x3e19	# 0.150000の上位16ビット
	lli.s	$f5, 0x999a	# 0.150000の下位16ビット
	lui.s	$f6, 0x3f00	# 0.500000の上位16ビット
	sub.s	$f3, $f6, $f3
	mul.s	$f3, $f3, $f3
	sub.s	$f3, $f5, $f3
	lui.s	$f5, 0x3f00	# 0.500000の上位16ビット
	sub.s	$f4, $f5, $f4
	mul.s	$f4, $f4, $f4
	sub.s	$f3, $f3, $f4
	ble.s	$f0, $f3, ble.s_then.29758
	li	$11, 1
	j	ble.s_cont.29759
ble.s_then.29758:
	li	$11, 0
ble.s_cont.29759:
	beq	$11, $0, beq_then.29760
	lui.s	$f3, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29761
beq_then.29760:
beq_cont.29761:
	lui.s	$f4, 0x437f	# 255.000000の上位16ビット
	mul.s	$f3, $f4, $f3
	lui.s	$f4, 0x4055	# 3.333333の上位16ビット
	lli.s	$f4, 0x5555	# 3.333333の下位16ビット
	mul.s	$f3, $f3, $f4
	li	$11, 620
	sw.s	$f3, 0($11)
beq_cont.29741:
	j	beq_cont.29739
beq_then.29738:
	li	$11, 584
	lw.s	$f3, 0($11)
	lw	$11, 20($9)
	lw.s	$f4, 0($11)
	sub.s	$f3, $f3, $f4
	li	$11, 592
	lw.s	$f4, 0($11)
	lw	$11, 20($9)
	addi	$11, $11, 8
	lw.s	$f5, 0($11)
	sub.s	$f4, $f4, $f5
	mul.s	$f3, $f3, $f3
	mul.s	$f4, $f4, $f4
	add.s	$f3, $f3, $f4
	sqrt.s	$f3, $f3
	lui.s	$f4, 0x3dcc	# 0.100000の上位16ビット
	lli.s	$f4, 0xcccd	# 0.100000の下位16ビット
	mul.s	$f3, $f3, $f4
	ftoi	$11, $f3
	itof	$f4, $11
	ble.s	$f0, $f3, ble.s_then.29762
	beq.s	$f3, $f4, beq.s_then.29764
	lui.s	$f5, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f4, $f4, $f5
	j	beq.s_cont.29765
beq.s_then.29764:
	mv.s	$f4, $f3
beq.s_cont.29765:
	j	ble.s_cont.29763
ble.s_then.29762:
ble.s_cont.29763:
	sub.s	$f3, $f3, $f4
	lui.s	$f4, 0x4049	# 3.141593の上位16ビット
	lli.s	$f4, 0xfdb	# 3.141593の下位16ビット
	mul.s	$f3, $f3, $f4
	mv.s	$f1, $f3
	sw	$ra, 44($sp)
	addi	$sp, $sp, 48
	jal	cos..6891
	addi	$sp, $sp, -48
	lw	$ra, 44($sp)
	mul.s	$f1, $f1, $f1
	lui.s	$f2, 0x437f	# 255.000000の上位16ビット
	mul.s	$f2, $f1, $f2
	li	$8, 616
	sw.s	$f2, 0($8)
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f1, $f2, $f1
	lui.s	$f2, 0x437f	# 255.000000の上位16ビット
	mul.s	$f1, $f1, $f2
	li	$8, 620
	sw.s	$f1, 0($8)
beq_cont.29739:
	j	beq_cont.29737
beq_then.29736:
	li	$11, 588
	lw.s	$f3, 0($11)
	lui.s	$f4, 0x3e80	# 0.250000の上位16ビット
	mul.s	$f3, $f3, $f4
	mv.s	$f1, $f3
	sw	$ra, 44($sp)
	addi	$sp, $sp, 48
	jal	sin..6893
	addi	$sp, $sp, -48
	lw	$ra, 44($sp)
	mul.s	$f1, $f1, $f1
	lui.s	$f2, 0x437f	# 255.000000の上位16ビット
	mul.s	$f2, $f2, $f1
	li	$8, 612
	sw.s	$f2, 0($8)
	lui.s	$f2, 0x437f	# 255.000000の上位16ビット
	lui.s	$f3, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f1, $f3, $f1
	mul.s	$f1, $f2, $f1
	li	$8, 616
	sw.s	$f1, 0($8)
beq_cont.29737:
	j	beq_cont.29735
beq_then.29734:
	li	$11, 584
	lw.s	$f3, 0($11)
	lw	$11, 20($9)
	lw.s	$f4, 0($11)
	sub.s	$f3, $f3, $f4
	lui.s	$f4, 0x3d4c	# 0.050000の上位16ビット
	lli.s	$f4, 0xcccd	# 0.050000の下位16ビット
	mul.s	$f4, $f3, $f4
	ftoi	$11, $f4
	itof	$f5, $11
	ble.s	$f0, $f4, ble.s_then.29766
	beq.s	$f4, $f5, beq.s_then.29768
	lui.s	$f4, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f4, $f5, $f4
	j	beq.s_cont.29769
beq.s_then.29768:
beq.s_cont.29769:
	j	ble.s_cont.29767
ble.s_then.29766:
	mv.s	$f4, $f5
ble.s_cont.29767:
	lui.s	$f5, 0x41a0	# 20.000000の上位16ビット
	mul.s	$f4, $f4, $f5
	sub.s	$f3, $f3, $f4
	lui.s	$f4, 0x4120	# 10.000000の上位16ビット
	ble.s	$f4, $f3, ble.s_then.29770
	li	$11, 1
	j	ble.s_cont.29771
ble.s_then.29770:
	li	$11, 0
ble.s_cont.29771:
	li	$12, 592
	lw.s	$f3, 0($12)
	lw	$12, 20($9)
	addi	$12, $12, 8
	lw.s	$f4, 0($12)
	sub.s	$f3, $f3, $f4
	lui.s	$f4, 0x3d4c	# 0.050000の上位16ビット
	lli.s	$f4, 0xcccd	# 0.050000の下位16ビット
	mul.s	$f4, $f3, $f4
	ftoi	$12, $f4
	itof	$f5, $12
	ble.s	$f0, $f4, ble.s_then.29772
	beq.s	$f4, $f5, beq.s_then.29774
	lui.s	$f4, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f4, $f5, $f4
	j	beq.s_cont.29775
beq.s_then.29774:
beq.s_cont.29775:
	j	ble.s_cont.29773
ble.s_then.29772:
	mv.s	$f4, $f5
ble.s_cont.29773:
	lui.s	$f5, 0x41a0	# 20.000000の上位16ビット
	mul.s	$f4, $f4, $f5
	sub.s	$f3, $f3, $f4
	lui.s	$f4, 0x4120	# 10.000000の上位16ビット
	ble.s	$f4, $f3, ble.s_then.29776
	li	$12, 1
	j	ble.s_cont.29777
ble.s_then.29776:
	li	$12, 0
ble.s_cont.29777:
	beq	$11, $0, beq_then.29778
	beq	$12, $0, beq_then.29780
	lui.s	$f3, 0x437f	# 255.000000の上位16ビット
	j	beq_cont.29781
beq_then.29780:
	lui.s	$f3, 0x0	# 0.000000の上位16ビット
beq_cont.29781:
	j	beq_cont.29779
beq_then.29778:
	beq	$12, $0, beq_then.29782
	lui.s	$f3, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29783
beq_then.29782:
	lui.s	$f3, 0x437f	# 255.000000の上位16ビット
beq_cont.29783:
beq_cont.29779:
	li	$11, 616
	sw.s	$f3, 0($11)
beq_cont.29735:
	lw	$8, 40($sp)
	sll	$8, $8, 2
	li	$9, 576
	lw	$9, 0($9)
	add	$8, $8, $9
	lw	$9, 24($sp)
	sll	$10, $9, 2
	lw	$11, 20($sp)
	add	$10, $11, $10
	sw	$8, 0($10)
	lw	$8, 8($sp)
	lw	$10, 4($8)
	sll	$12, $9, 2
	add	$10, $10, $12
	lw	$10, 0($10)
	li	$12, 584
	lw.s	$f1, 0($12)
	mv	$12, $10
	sw.s	$f1, 0($12)
	li	$12, 588
	lw.s	$f1, 0($12)
	addi	$12, $10, 4
	sw.s	$f1, 0($12)
	li	$12, 592
	lw.s	$f1, 0($12)
	addi	$10, $10, 8
	sw.s	$f1, 0($10)
	lw	$10, 12($8)
	lw	$12, 36($sp)
	lw	$13, 28($12)
	lw.s	$f1, 0($13)
	lui.s	$f2, 0x3f00	# 0.500000の上位16ビット
	ble.s	$f2, $f1, ble.s_then.29784
	li	$13, 1
	j	ble.s_cont.29785
ble.s_then.29784:
	li	$13, 0
ble.s_cont.29785:
	beq	$13, $0, beq_then.29786
	li	$13, 0
	sll	$14, $9, 2
	add	$10, $10, $14
	sw	$13, 0($10)
	j	beq_cont.29787
beq_then.29786:
	li	$13, 1
	sll	$14, $9, 2
	add	$10, $10, $14
	sw	$13, 0($10)
	lw	$10, 16($8)
	sll	$13, $9, 2
	add	$13, $10, $13
	lw	$13, 0($13)
	li	$14, 612
	lw.s	$f1, 0($14)
	mv	$14, $13
	sw.s	$f1, 0($14)
	li	$14, 616
	lw.s	$f1, 0($14)
	addi	$14, $13, 4
	sw.s	$f1, 0($14)
	li	$14, 620
	lw.s	$f1, 0($14)
	addi	$13, $13, 8
	sw.s	$f1, 0($13)
	sll	$13, $9, 2
	add	$10, $10, $13
	lw	$10, 0($10)
	lui.s	$f1, 0x3b80	# 0.003906の上位16ビット
	lw.s	$f2, 32($sp)
	mul.s	$f1, $f1, $f2
	mv	$13, $10
	lw.s	$f3, 0($13)
	mul.s	$f3, $f3, $f1
	mv	$13, $10
	sw.s	$f3, 0($13)
	addi	$13, $10, 4
	lw.s	$f3, 0($13)
	mul.s	$f3, $f3, $f1
	addi	$13, $10, 4
	sw.s	$f3, 0($13)
	addi	$13, $10, 8
	lw.s	$f3, 0($13)
	mul.s	$f1, $f3, $f1
	addi	$10, $10, 8
	sw.s	$f1, 0($10)
	lw	$10, 28($8)
	sll	$13, $9, 2
	add	$10, $10, $13
	lw	$10, 0($10)
	li	$13, 600
	lw.s	$f1, 0($13)
	mv	$13, $10
	sw.s	$f1, 0($13)
	li	$13, 604
	lw.s	$f1, 0($13)
	addi	$13, $10, 4
	sw.s	$f1, 0($13)
	li	$13, 608
	lw.s	$f1, 0($13)
	addi	$10, $10, 8
	sw.s	$f1, 0($10)
beq_cont.29787:
	lui.s	$f1, 0xc000	# -2.000000の上位16ビット
	lw	$10, 16($sp)
	mv	$13, $10
	lw.s	$f2, 0($13)
	li	$13, 600
	lw.s	$f3, 0($13)
	mul.s	$f2, $f2, $f3
	addi	$13, $10, 4
	lw.s	$f3, 0($13)
	li	$13, 604
	lw.s	$f4, 0($13)
	mul.s	$f3, $f3, $f4
	add.s	$f2, $f2, $f3
	addi	$13, $10, 8
	lw.s	$f3, 0($13)
	li	$13, 608
	lw.s	$f4, 0($13)
	mul.s	$f3, $f3, $f4
	add.s	$f2, $f2, $f3
	mul.s	$f1, $f1, $f2
	mv	$13, $10
	lw.s	$f2, 0($13)
	li	$13, 600
	lw.s	$f3, 0($13)
	mul.s	$f3, $f1, $f3
	add.s	$f2, $f2, $f3
	mv	$13, $10
	sw.s	$f2, 0($13)
	addi	$13, $10, 4
	lw.s	$f2, 0($13)
	li	$13, 604
	lw.s	$f3, 0($13)
	mul.s	$f3, $f1, $f3
	add.s	$f2, $f2, $f3
	addi	$13, $10, 4
	sw.s	$f2, 0($13)
	addi	$13, $10, 8
	lw.s	$f2, 0($13)
	li	$13, 608
	lw.s	$f3, 0($13)
	mul.s	$f1, $f1, $f3
	add.s	$f1, $f2, $f1
	addi	$13, $10, 8
	sw.s	$f1, 0($13)
	lw	$13, 28($12)
	addi	$13, $13, 4
	lw.s	$f1, 0($13)
	lw.s	$f2, 12($sp)
	mul.s	$f1, $f2, $f1
	li	$13, 0
	li	$14, 568
	lw	$14, 0($14)
	sw.s	$f1, 44($sp)
	mv	$9, $14
	mv	$8, $13
	sw	$ra, 48($sp)
	addi	$sp, $sp, 52
	jal	shadow_check_one_or_matrix..7204
	addi	$sp, $sp, -52
	lw	$ra, 48($sp)
	beq	$8, $0, beq_then.29788
	li	$8, 0
	j	beq_cont.29789
beq_then.29788:
	li	$8, 1
beq_cont.29789:
	beq	$8, $0, beq_then.29790
	li	$8, 600
	lw.s	$f1, 0($8)
	li	$8, 344
	lw.s	$f2, 0($8)
	mul.s	$f1, $f1, $f2
	li	$8, 604
	lw.s	$f2, 0($8)
	li	$8, 348
	lw.s	$f3, 0($8)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	li	$8, 608
	lw.s	$f2, 0($8)
	li	$8, 352
	lw.s	$f3, 0($8)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	neg.s	$f1, $f1
	lw.s	$f2, 32($sp)
	mul.s	$f1, $f1, $f2
	lw	$8, 16($sp)
	mv	$9, $8
	lw.s	$f3, 0($9)
	li	$9, 344
	lw.s	$f4, 0($9)
	mul.s	$f3, $f3, $f4
	addi	$9, $8, 4
	lw.s	$f4, 0($9)
	li	$9, 348
	lw.s	$f5, 0($9)
	mul.s	$f4, $f4, $f5
	add.s	$f3, $f3, $f4
	addi	$9, $8, 8
	lw.s	$f4, 0($9)
	li	$9, 352
	lw.s	$f5, 0($9)
	mul.s	$f4, $f4, $f5
	add.s	$f3, $f3, $f4
	neg.s	$f3, $f3
	ble.s	$f1, $f0, ble.s_then.29792
	li	$9, 1
	j	ble.s_cont.29793
ble.s_then.29792:
	li	$9, 0
ble.s_cont.29793:
	beq	$9, $0, beq_then.29794
	li	$9, 636
	lw.s	$f4, 0($9)
	li	$9, 612
	lw.s	$f5, 0($9)
	mul.s	$f5, $f1, $f5
	add.s	$f4, $f4, $f5
	li	$9, 636
	sw.s	$f4, 0($9)
	li	$9, 640
	lw.s	$f4, 0($9)
	li	$9, 616
	lw.s	$f5, 0($9)
	mul.s	$f5, $f1, $f5
	add.s	$f4, $f4, $f5
	li	$9, 640
	sw.s	$f4, 0($9)
	li	$9, 644
	lw.s	$f4, 0($9)
	li	$9, 620
	lw.s	$f5, 0($9)
	mul.s	$f1, $f1, $f5
	add.s	$f1, $f4, $f1
	li	$9, 644
	sw.s	$f1, 0($9)
	j	beq_cont.29795
beq_then.29794:
beq_cont.29795:
	ble.s	$f3, $f0, ble.s_then.29796
	li	$9, 1
	j	ble.s_cont.29797
ble.s_then.29796:
	li	$9, 0
ble.s_cont.29797:
	beq	$9, $0, beq_then.29798
	mul.s	$f1, $f3, $f3
	mul.s	$f1, $f1, $f1
	lw.s	$f3, 44($sp)
	mul.s	$f1, $f1, $f3
	li	$9, 636
	lw.s	$f4, 0($9)
	add.s	$f4, $f4, $f1
	li	$9, 636
	sw.s	$f4, 0($9)
	li	$9, 640
	lw.s	$f4, 0($9)
	add.s	$f4, $f4, $f1
	li	$9, 640
	sw.s	$f4, 0($9)
	li	$9, 644
	lw.s	$f4, 0($9)
	add.s	$f1, $f4, $f1
	li	$9, 644
	sw.s	$f1, 0($9)
	j	beq_cont.29799
beq_then.29798:
beq_cont.29799:
	j	beq_cont.29791
beq_then.29790:
beq_cont.29791:
	li	$8, 584
	lw.s	$f1, 0($8)
	li	$8, 680
	sw.s	$f1, 0($8)
	li	$8, 588
	lw.s	$f1, 0($8)
	li	$8, 684
	sw.s	$f1, 0($8)
	li	$8, 592
	lw.s	$f1, 0($8)
	li	$8, 688
	sw.s	$f1, 0($8)
	li	$8, 32
	lw	$8, 0($8)
	addi	$9, $8, -1
	lw	$8, 4($sp)
	sw	$ra, 48($sp)
	addi	$sp, $sp, 52
	jal	setup_startp_constants..7167
	addi	$sp, $sp, -52
	lw	$ra, 48($sp)
	li	$8, 1768
	lw	$8, 0($8)
	addi	$8, $8, -1
	lw.s	$f1, 32($sp)
	lw.s	$f2, 44($sp)
	lw	$9, 16($sp)
	sw	$ra, 48($sp)
	addi	$sp, $sp, 52
	jal	trace_reflections..7251
	addi	$sp, $sp, -52
	lw	$ra, 48($sp)
	lui.s	$f1, 0x3dcc	# 0.100000の上位16ビット
	lli.s	$f1, 0xcccd	# 0.100000の下位16ビット
	lw.s	$f2, 12($sp)
	ble.s	$f2, $f1, ble.s_then.29800
	li	$8, 1
	j	ble.s_cont.29801
ble.s_then.29800:
	li	$8, 0
ble.s_cont.29801:
	beq	$8, $0, beq_then.29802
	lw	$8, 24($sp)
	ble	$4, $8, ble_then.29803
	addi	$9, $8, 1
	li	$10, -1
	sll	$9, $9, 2
	lw	$11, 20($sp)
	add	$9, $11, $9
	sw	$10, 0($9)
	j	ble_cont.29804
ble_then.29803:
ble_cont.29804:
	lw	$9, 28($sp)
	beq	$9, $2, beq_then.29805
	jr	$ra
beq_then.29805:
	lui.s	$f1, 0x3f80	# 1.000000の上位16ビット
	lw	$9, 36($sp)
	lw	$9, 28($9)
	lw.s	$f3, 0($9)
	sub.s	$f1, $f1, $f3
	mul.s	$f1, $f2, $f1
	addi	$8, $8, 1
	li	$9, 580
	lw.s	$f2, 0($9)
	lw.s	$f3, 0($sp)
	add.s	$f2, $f3, $f2
	lw	$9, 16($sp)
	lw	$10, 8($sp)
	j	trace_ray.A(f)A(A(f))A(i).7256
beq_then.29802:
	jr	$ra
beq_then.29713:
	li	$8, -1
	lw	$9, 24($sp)
	sll	$10, $9, 2
	lw	$11, 20($sp)
	add	$10, $11, $10
	sw	$8, 0($10)
	beq	$9, $0, beq_then.29808
	lw	$8, 16($sp)
	mv	$9, $8
	lw.s	$f1, 0($9)
	li	$9, 344
	lw.s	$f2, 0($9)
	mul.s	$f1, $f1, $f2
	addi	$9, $8, 4
	lw.s	$f2, 0($9)
	li	$9, 348
	lw.s	$f3, 0($9)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	addi	$8, $8, 8
	lw.s	$f2, 0($8)
	li	$8, 352
	lw.s	$f3, 0($8)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	neg.s	$f1, $f1
	ble.s	$f1, $f0, ble.s_then.29809
	li	$8, 1
	j	ble.s_cont.29810
ble.s_then.29809:
	li	$8, 0
ble.s_cont.29810:
	beq	$8, $0, beq_then.29811
	mul.s	$f2, $f1, $f1
	mul.s	$f1, $f2, $f1
	lw.s	$f2, 12($sp)
	mul.s	$f1, $f1, $f2
	li	$8, 356
	lw.s	$f2, 0($8)
	mul.s	$f1, $f1, $f2
	li	$8, 636
	lw.s	$f2, 0($8)
	add.s	$f2, $f2, $f1
	li	$8, 636
	sw.s	$f2, 0($8)
	li	$8, 640
	lw.s	$f2, 0($8)
	add.s	$f2, $f2, $f1
	li	$8, 640
	sw.s	$f2, 0($8)
	li	$8, 644
	lw.s	$f2, 0($8)
	add.s	$f1, $f2, $f1
	li	$8, 644
	sw.s	$f1, 0($8)
	jr	$ra
beq_then.29811:
	jr	$ra
beq_then.29808:
	jr	$ra
iter_trace_diffuse_rays.A(f).7265:
	ble	$0, $11, ble_then.29815
	jr	$ra
ble_then.29815:
	sll	$12, $11, 2
	add	$12, $8, $12
	lw	$12, 0($12)
	lw	$12, 0($12)
	mv	$13, $12
	lw.s	$f1, 0($13)
	mv	$13, $9
	lw.s	$f2, 0($13)
	mul.s	$f1, $f1, $f2
	addi	$13, $12, 4
	lw.s	$f2, 0($13)
	addi	$13, $9, 4
	lw.s	$f3, 0($13)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	addi	$12, $12, 8
	lw.s	$f2, 0($12)
	addi	$12, $9, 8
	lw.s	$f3, 0($12)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	ble.s	$f0, $f1, ble.s_then.29817
	li	$12, 1
	j	ble.s_cont.29818
ble.s_then.29817:
	li	$12, 0
ble.s_cont.29818:
	sw	$10, 0($sp)
	sw	$9, 4($sp)
	sw	$8, 8($sp)
	sw	$11, 12($sp)
	beq	$12, $0, beq_then.29819
	addi	$12, $11, 1
	sll	$12, $12, 2
	add	$12, $8, $12
	lw	$12, 0($12)
	lui.s	$f2, 0xbbda	# -0.006667の上位16ビット
	lli.s	$f2, 0x740e	# -0.006667の下位16ビット
	mul.s	$f1, $f1, $f2
	lui.s	$f2, 0x4e6e	# 1000000000.000000の上位16ビット
	lli.s	$f2, 0x6b28	# 1000000000.000000の下位16ビット
	li	$13, 580
	sw.s	$f2, 0($13)
	li	$13, 0
	li	$14, 568
	lw	$14, 0($14)
	sw.s	$f1, 16($sp)
	sw	$12, 20($sp)
	mv	$10, $12
	mv	$9, $14
	mv	$8, $13
	sw	$ra, 24($sp)
	addi	$sp, $sp, 28
	jal	trace_or_matrix_fast..7229
	addi	$sp, $sp, -28
	lw	$ra, 24($sp)
	li	$8, 580
	lw.s	$f1, 0($8)
	lui.s	$f2, 0xbdcc	# -0.100000の上位16ビット
	lli.s	$f2, 0xcccd	# -0.100000の下位16ビット
	ble.s	$f1, $f2, ble.s_then.29821
	li	$8, 1
	j	ble.s_cont.29822
ble.s_then.29821:
	li	$8, 0
ble.s_cont.29822:
	beq	$8, $0, beq_then.29823
	lui.s	$f2, 0x4cbe	# 100000000.000000の上位16ビット
	lli.s	$f2, 0xbc20	# 100000000.000000の下位16ビット
	ble.s	$f2, $f1, ble.s_then.29825
	li	$8, 1
	j	ble.s_cont.29826
ble.s_then.29825:
	li	$8, 0
ble.s_cont.29826:
	j	beq_cont.29824
beq_then.29823:
	li	$8, 0
beq_cont.29824:
	beq	$8, $0, beq_then.29827
	li	$8, 596
	lw	$8, 0($8)
	sll	$8, $8, 2
	addi	$8, $8, 80
	lw	$8, 0($8)
	lw	$9, 20($sp)
	lw	$9, 0($9)
	lw	$10, 4($8)
	beq	$10, $1, beq_then.29829
	beq	$10, $2, beq_then.29831
	li	$9, 584
	lw.s	$f1, 0($9)
	lw	$9, 20($8)
	lw.s	$f2, 0($9)
	sub.s	$f1, $f1, $f2
	li	$9, 588
	lw.s	$f2, 0($9)
	lw	$9, 20($8)
	addi	$9, $9, 4
	lw.s	$f3, 0($9)
	sub.s	$f2, $f2, $f3
	li	$9, 592
	lw.s	$f3, 0($9)
	lw	$9, 20($8)
	addi	$9, $9, 8
	lw.s	$f4, 0($9)
	sub.s	$f3, $f3, $f4
	lw	$9, 16($8)
	lw.s	$f4, 0($9)
	mul.s	$f4, $f1, $f4
	lw	$9, 16($8)
	addi	$9, $9, 4
	lw.s	$f5, 0($9)
	mul.s	$f5, $f2, $f5
	lw	$9, 16($8)
	addi	$9, $9, 8
	lw.s	$f6, 0($9)
	mul.s	$f6, $f3, $f6
	lw	$9, 12($8)
	beq	$9, $0, beq_then.29833
	lw	$9, 36($8)
	addi	$9, $9, 8
	lw.s	$f7, 0($9)
	mul.s	$f7, $f2, $f7
	lw	$9, 36($8)
	addi	$9, $9, 4
	lw.s	$f8, 0($9)
	mul.s	$f8, $f3, $f8
	add.s	$f7, $f7, $f8
	lui.s	$f8, 0x3f00	# 0.500000の上位16ビット
	mul.s	$f7, $f7, $f8
	add.s	$f4, $f4, $f7
	li	$9, 600
	sw.s	$f4, 0($9)
	lw	$9, 36($8)
	addi	$9, $9, 8
	lw.s	$f4, 0($9)
	mul.s	$f4, $f1, $f4
	lw	$9, 36($8)
	lw.s	$f7, 0($9)
	mul.s	$f3, $f3, $f7
	add.s	$f3, $f4, $f3
	lui.s	$f4, 0x3f00	# 0.500000の上位16ビット
	mul.s	$f3, $f3, $f4
	add.s	$f3, $f5, $f3
	li	$9, 604
	sw.s	$f3, 0($9)
	lw	$9, 36($8)
	addi	$9, $9, 4
	lw.s	$f3, 0($9)
	mul.s	$f1, $f1, $f3
	lw	$9, 36($8)
	lw.s	$f3, 0($9)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	lui.s	$f2, 0x3f00	# 0.500000の上位16ビット
	mul.s	$f1, $f1, $f2
	add.s	$f1, $f6, $f1
	li	$9, 608
	sw.s	$f1, 0($9)
	j	beq_cont.29834
beq_then.29833:
	li	$9, 600
	sw.s	$f4, 0($9)
	li	$9, 604
	sw.s	$f5, 0($9)
	li	$9, 608
	sw.s	$f6, 0($9)
beq_cont.29834:
	lw	$9, 24($8)
	li	$10, 600
	lw.s	$f1, 0($10)
	mul.s	$f1, $f1, $f1
	li	$10, 604
	lw.s	$f2, 0($10)
	mul.s	$f2, $f2, $f2
	add.s	$f1, $f1, $f2
	li	$10, 608
	lw.s	$f2, 0($10)
	mul.s	$f2, $f2, $f2
	add.s	$f1, $f1, $f2
	sqrt.s	$f1, $f1
	beq.s	$f1, $f0, beq.s_then.29835
	li	$10, 0
	j	beq.s_cont.29836
beq.s_then.29835:
	li	$10, 1
beq.s_cont.29836:
	beq	$10, $0, beq_then.29837
	lui.s	$f1, 0x3f80	# 1.000000の上位16ビット
	j	beq_cont.29838
beq_then.29837:
	beq	$9, $0, beq_then.29839
	inv.s	$f1, $f1
	neg.s	$f1, $f1
	j	beq_cont.29840
beq_then.29839:
	inv.s	$f1, $f1
beq_cont.29840:
beq_cont.29838:
	li	$9, 600
	lw.s	$f2, 0($9)
	mul.s	$f2, $f2, $f1
	li	$9, 600
	sw.s	$f2, 0($9)
	li	$9, 604
	lw.s	$f2, 0($9)
	mul.s	$f2, $f2, $f1
	li	$9, 604
	sw.s	$f2, 0($9)
	li	$9, 608
	lw.s	$f2, 0($9)
	mul.s	$f1, $f2, $f1
	li	$9, 608
	sw.s	$f1, 0($9)
	j	beq_cont.29832
beq_then.29831:
	lw	$9, 16($8)
	lw.s	$f1, 0($9)
	neg.s	$f1, $f1
	li	$9, 600
	sw.s	$f1, 0($9)
	lw	$9, 16($8)
	addi	$9, $9, 4
	lw.s	$f1, 0($9)
	neg.s	$f1, $f1
	li	$9, 604
	sw.s	$f1, 0($9)
	lw	$9, 16($8)
	addi	$9, $9, 8
	lw.s	$f1, 0($9)
	neg.s	$f1, $f1
	li	$9, 608
	sw.s	$f1, 0($9)
beq_cont.29832:
	j	beq_cont.29830
beq_then.29829:
	li	$10, 576
	lw	$10, 0($10)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$11, 600
	sw.s	$f1, 0($11)
	li	$11, 604
	sw.s	$f1, 0($11)
	li	$11, 608
	sw.s	$f1, 0($11)
	addi	$11, $10, -1
	addi	$10, $10, -1
	sll	$10, $10, 2
	add	$9, $9, $10
	lw.s	$f1, 0($9)
	beq.s	$f1, $f0, beq.s_then.29841
	li	$9, 0
	j	beq.s_cont.29842
beq.s_then.29841:
	li	$9, 1
beq.s_cont.29842:
	beq	$9, $0, beq_then.29843
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29844
beq_then.29843:
	ble.s	$f1, $f0, ble.s_then.29845
	li	$9, 1
	j	ble.s_cont.29846
ble.s_then.29845:
	li	$9, 0
ble.s_cont.29846:
	beq	$9, $0, beq_then.29847
	lui.s	$f1, 0x3f80	# 1.000000の上位16ビット
	j	beq_cont.29848
beq_then.29847:
	lui.s	$f1, 0xbf80	# -1.000000の上位16ビット
beq_cont.29848:
beq_cont.29844:
	neg.s	$f1, $f1
	sll	$9, $11, 2
	addi	$9, $9, 600
	sw.s	$f1, 0($9)
beq_cont.29830:
	lw	$9, 0($8)
	lw	$10, 32($8)
	lw.s	$f1, 0($10)
	li	$10, 612
	sw.s	$f1, 0($10)
	lw	$10, 32($8)
	addi	$10, $10, 4
	lw.s	$f1, 0($10)
	li	$10, 616
	sw.s	$f1, 0($10)
	lw	$10, 32($8)
	addi	$10, $10, 8
	lw.s	$f1, 0($10)
	li	$10, 620
	sw.s	$f1, 0($10)
	sw	$8, 24($sp)
	beq	$9, $1, beq_then.29849
	beq	$9, $2, beq_then.29851
	beq	$9, $3, beq_then.29853
	beq	$9, $4, beq_then.29855
	j	beq_cont.29856
beq_then.29855:
	li	$9, 584
	lw.s	$f1, 0($9)
	lw	$9, 20($8)
	lw.s	$f2, 0($9)
	sub.s	$f1, $f1, $f2
	lw	$9, 16($8)
	lw.s	$f2, 0($9)
	sqrt.s	$f2, $f2
	mul.s	$f1, $f1, $f2
	li	$9, 592
	lw.s	$f2, 0($9)
	lw	$9, 20($8)
	addi	$9, $9, 8
	lw.s	$f3, 0($9)
	sub.s	$f2, $f2, $f3
	lw	$9, 16($8)
	addi	$9, $9, 8
	lw.s	$f3, 0($9)
	sqrt.s	$f3, $f3
	mul.s	$f2, $f2, $f3
	mul.s	$f3, $f1, $f1
	mul.s	$f4, $f2, $f2
	add.s	$f3, $f3, $f4
	abs.s	$f4, $f1
	lui.s	$f5, 0x38d1	# 0.000100の上位16ビット
	lli.s	$f5, 0xb717	# 0.000100の下位16ビット
	ble.s	$f5, $f4, ble.s_then.29857
	li	$9, 1
	j	ble.s_cont.29858
ble.s_then.29857:
	li	$9, 0
ble.s_cont.29858:
	beq	$9, $0, beq_then.29859
	lui.s	$f1, 0x4170	# 15.000000の上位16ビット
	j	beq_cont.29860
beq_then.29859:
	inv.s	$f1, $f1
	mul.s	$f1, $f2, $f1
	abs.s	$f1, $f1
	mul.s	$f2, $f1, $f1
	lui.s	$f4, 0x3f80	# 1.000000の上位16ビット
	lui.s	$f5, 0x3eaa	# 0.333333の上位16ビット
	lli.s	$f5, 0xaaab	# 0.333333の下位16ビット
	lui.s	$f6, 0x3e4c	# 0.200000の上位16ビット
	lli.s	$f6, 0xcccd	# 0.200000の下位16ビット
	lui.s	$f7, 0x3e12	# 0.142857の上位16ビット
	lli.s	$f7, 0x4925	# 0.142857の下位16ビット
	mul.s	$f7, $f2, $f7
	sub.s	$f6, $f6, $f7
	mul.s	$f6, $f2, $f6
	sub.s	$f5, $f5, $f6
	mul.s	$f2, $f2, $f5
	sub.s	$f2, $f4, $f2
	mul.s	$f1, $f1, $f2
	lui.s	$f2, 0x41f0	# 30.000000の上位16ビット
	mul.s	$f1, $f1, $f2
	lui.s	$f2, 0x3ea2	# 0.318310の上位16ビット
	lli.s	$f2, 0xf983	# 0.318310の下位16ビット
	mul.s	$f1, $f1, $f2
beq_cont.29860:
	ftoi	$9, $f1
	itof	$f2, $9
	ble.s	$f0, $f1, ble.s_then.29861
	beq.s	$f1, $f2, beq.s_then.29863
	lui.s	$f4, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f2, $f2, $f4
	j	beq.s_cont.29864
beq.s_then.29863:
	mv.s	$f2, $f1
beq.s_cont.29864:
	j	ble.s_cont.29862
ble.s_then.29861:
ble.s_cont.29862:
	sub.s	$f1, $f1, $f2
	li	$9, 588
	lw.s	$f2, 0($9)
	lw	$9, 20($8)
	addi	$9, $9, 4
	lw.s	$f4, 0($9)
	sub.s	$f2, $f2, $f4
	lw	$9, 16($8)
	addi	$9, $9, 4
	lw.s	$f4, 0($9)
	sqrt.s	$f4, $f4
	mul.s	$f2, $f2, $f4
	abs.s	$f4, $f3
	lui.s	$f5, 0x38d1	# 0.000100の上位16ビット
	lli.s	$f5, 0xb717	# 0.000100の下位16ビット
	ble.s	$f5, $f4, ble.s_then.29865
	li	$9, 1
	j	ble.s_cont.29866
ble.s_then.29865:
	li	$9, 0
ble.s_cont.29866:
	beq	$9, $0, beq_then.29867
	lui.s	$f2, 0x4170	# 15.000000の上位16ビット
	j	beq_cont.29868
beq_then.29867:
	inv.s	$f3, $f3
	mul.s	$f2, $f2, $f3
	abs.s	$f2, $f2
	mul.s	$f3, $f2, $f2
	lui.s	$f4, 0x3f80	# 1.000000の上位16ビット
	lui.s	$f5, 0x3eaa	# 0.333333の上位16ビット
	lli.s	$f5, 0xaaab	# 0.333333の下位16ビット
	lui.s	$f6, 0x3e4c	# 0.200000の上位16ビット
	lli.s	$f6, 0xcccd	# 0.200000の下位16ビット
	lui.s	$f7, 0x3e12	# 0.142857の上位16ビット
	lli.s	$f7, 0x4925	# 0.142857の下位16ビット
	mul.s	$f7, $f3, $f7
	sub.s	$f6, $f6, $f7
	mul.s	$f6, $f3, $f6
	sub.s	$f5, $f5, $f6
	mul.s	$f3, $f3, $f5
	sub.s	$f3, $f4, $f3
	mul.s	$f2, $f2, $f3
	lui.s	$f3, 0x41f0	# 30.000000の上位16ビット
	mul.s	$f2, $f2, $f3
	lui.s	$f3, 0x3ea2	# 0.318310の上位16ビット
	lli.s	$f3, 0xf983	# 0.318310の下位16ビット
	mul.s	$f2, $f2, $f3
beq_cont.29868:
	ftoi	$9, $f2
	itof	$f3, $9
	ble.s	$f0, $f2, ble.s_then.29869
	beq.s	$f2, $f3, beq.s_then.29871
	lui.s	$f4, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f3, $f3, $f4
	j	beq.s_cont.29872
beq.s_then.29871:
	mv.s	$f3, $f2
beq.s_cont.29872:
	j	ble.s_cont.29870
ble.s_then.29869:
ble.s_cont.29870:
	sub.s	$f2, $f2, $f3
	lui.s	$f3, 0x3e19	# 0.150000の上位16ビット
	lli.s	$f3, 0x999a	# 0.150000の下位16ビット
	lui.s	$f4, 0x3f00	# 0.500000の上位16ビット
	sub.s	$f1, $f4, $f1
	mul.s	$f1, $f1, $f1
	sub.s	$f1, $f3, $f1
	lui.s	$f3, 0x3f00	# 0.500000の上位16ビット
	sub.s	$f2, $f3, $f2
	mul.s	$f2, $f2, $f2
	sub.s	$f1, $f1, $f2
	ble.s	$f0, $f1, ble.s_then.29873
	li	$9, 1
	j	ble.s_cont.29874
ble.s_then.29873:
	li	$9, 0
ble.s_cont.29874:
	beq	$9, $0, beq_then.29875
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29876
beq_then.29875:
beq_cont.29876:
	lui.s	$f2, 0x437f	# 255.000000の上位16ビット
	mul.s	$f1, $f2, $f1
	lui.s	$f2, 0x4055	# 3.333333の上位16ビット
	lli.s	$f2, 0x5555	# 3.333333の下位16ビット
	mul.s	$f1, $f1, $f2
	li	$9, 620
	sw.s	$f1, 0($9)
beq_cont.29856:
	j	beq_cont.29854
beq_then.29853:
	li	$9, 584
	lw.s	$f1, 0($9)
	lw	$9, 20($8)
	lw.s	$f2, 0($9)
	sub.s	$f1, $f1, $f2
	li	$9, 592
	lw.s	$f2, 0($9)
	lw	$9, 20($8)
	addi	$9, $9, 8
	lw.s	$f3, 0($9)
	sub.s	$f2, $f2, $f3
	mul.s	$f1, $f1, $f1
	mul.s	$f2, $f2, $f2
	add.s	$f1, $f1, $f2
	sqrt.s	$f1, $f1
	lui.s	$f2, 0x3dcc	# 0.100000の上位16ビット
	lli.s	$f2, 0xcccd	# 0.100000の下位16ビット
	mul.s	$f1, $f1, $f2
	ftoi	$9, $f1
	itof	$f2, $9
	ble.s	$f0, $f1, ble.s_then.29877
	beq.s	$f1, $f2, beq.s_then.29879
	lui.s	$f3, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f2, $f2, $f3
	j	beq.s_cont.29880
beq.s_then.29879:
	mv.s	$f2, $f1
beq.s_cont.29880:
	j	ble.s_cont.29878
ble.s_then.29877:
ble.s_cont.29878:
	sub.s	$f1, $f1, $f2
	lui.s	$f2, 0x4049	# 3.141593の上位16ビット
	lli.s	$f2, 0xfdb	# 3.141593の下位16ビット
	mul.s	$f1, $f1, $f2
	sw	$ra, 28($sp)
	addi	$sp, $sp, 32
	jal	cos..6891
	addi	$sp, $sp, -32
	lw	$ra, 28($sp)
	mul.s	$f1, $f1, $f1
	lui.s	$f2, 0x437f	# 255.000000の上位16ビット
	mul.s	$f2, $f1, $f2
	li	$8, 616
	sw.s	$f2, 0($8)
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f1, $f2, $f1
	lui.s	$f2, 0x437f	# 255.000000の上位16ビット
	mul.s	$f1, $f1, $f2
	li	$8, 620
	sw.s	$f1, 0($8)
beq_cont.29854:
	j	beq_cont.29852
beq_then.29851:
	li	$9, 588
	lw.s	$f1, 0($9)
	lui.s	$f2, 0x3e80	# 0.250000の上位16ビット
	mul.s	$f1, $f1, $f2
	sw	$ra, 28($sp)
	addi	$sp, $sp, 32
	jal	sin..6893
	addi	$sp, $sp, -32
	lw	$ra, 28($sp)
	mul.s	$f1, $f1, $f1
	lui.s	$f2, 0x437f	# 255.000000の上位16ビット
	mul.s	$f2, $f2, $f1
	li	$8, 612
	sw.s	$f2, 0($8)
	lui.s	$f2, 0x437f	# 255.000000の上位16ビット
	lui.s	$f3, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f1, $f3, $f1
	mul.s	$f1, $f2, $f1
	li	$8, 616
	sw.s	$f1, 0($8)
beq_cont.29852:
	j	beq_cont.29850
beq_then.29849:
	li	$9, 584
	lw.s	$f1, 0($9)
	lw	$9, 20($8)
	lw.s	$f2, 0($9)
	sub.s	$f1, $f1, $f2
	lui.s	$f2, 0x3d4c	# 0.050000の上位16ビット
	lli.s	$f2, 0xcccd	# 0.050000の下位16ビット
	mul.s	$f2, $f1, $f2
	ftoi	$9, $f2
	itof	$f3, $9
	ble.s	$f0, $f2, ble.s_then.29881
	beq.s	$f2, $f3, beq.s_then.29883
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f2, $f3, $f2
	j	beq.s_cont.29884
beq.s_then.29883:
beq.s_cont.29884:
	j	ble.s_cont.29882
ble.s_then.29881:
	mv.s	$f2, $f3
ble.s_cont.29882:
	lui.s	$f3, 0x41a0	# 20.000000の上位16ビット
	mul.s	$f2, $f2, $f3
	sub.s	$f1, $f1, $f2
	lui.s	$f2, 0x4120	# 10.000000の上位16ビット
	ble.s	$f2, $f1, ble.s_then.29885
	li	$9, 1
	j	ble.s_cont.29886
ble.s_then.29885:
	li	$9, 0
ble.s_cont.29886:
	li	$10, 592
	lw.s	$f1, 0($10)
	lw	$10, 20($8)
	addi	$10, $10, 8
	lw.s	$f2, 0($10)
	sub.s	$f1, $f1, $f2
	lui.s	$f2, 0x3d4c	# 0.050000の上位16ビット
	lli.s	$f2, 0xcccd	# 0.050000の下位16ビット
	mul.s	$f2, $f1, $f2
	ftoi	$10, $f2
	itof	$f3, $10
	ble.s	$f0, $f2, ble.s_then.29887
	beq.s	$f2, $f3, beq.s_then.29889
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f2, $f3, $f2
	j	beq.s_cont.29890
beq.s_then.29889:
beq.s_cont.29890:
	j	ble.s_cont.29888
ble.s_then.29887:
	mv.s	$f2, $f3
ble.s_cont.29888:
	lui.s	$f3, 0x41a0	# 20.000000の上位16ビット
	mul.s	$f2, $f2, $f3
	sub.s	$f1, $f1, $f2
	lui.s	$f2, 0x4120	# 10.000000の上位16ビット
	ble.s	$f2, $f1, ble.s_then.29891
	li	$10, 1
	j	ble.s_cont.29892
ble.s_then.29891:
	li	$10, 0
ble.s_cont.29892:
	beq	$9, $0, beq_then.29893
	beq	$10, $0, beq_then.29895
	lui.s	$f1, 0x437f	# 255.000000の上位16ビット
	j	beq_cont.29896
beq_then.29895:
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
beq_cont.29896:
	j	beq_cont.29894
beq_then.29893:
	beq	$10, $0, beq_then.29897
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29898
beq_then.29897:
	lui.s	$f1, 0x437f	# 255.000000の上位16ビット
beq_cont.29898:
beq_cont.29894:
	li	$9, 616
	sw.s	$f1, 0($9)
beq_cont.29850:
	li	$8, 0
	li	$9, 568
	lw	$9, 0($9)
	sw	$ra, 28($sp)
	addi	$sp, $sp, 32
	jal	shadow_check_one_or_matrix..7204
	addi	$sp, $sp, -32
	lw	$ra, 28($sp)
	beq	$8, $0, beq_then.29899
	li	$8, 0
	j	beq_cont.29900
beq_then.29899:
	li	$8, 1
beq_cont.29900:
	beq	$8, $0, beq_then.29901
	li	$8, 600
	lw.s	$f1, 0($8)
	li	$8, 344
	lw.s	$f2, 0($8)
	mul.s	$f1, $f1, $f2
	li	$8, 604
	lw.s	$f2, 0($8)
	li	$8, 348
	lw.s	$f3, 0($8)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	li	$8, 608
	lw.s	$f2, 0($8)
	li	$8, 352
	lw.s	$f3, 0($8)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	neg.s	$f1, $f1
	ble.s	$f1, $f0, ble.s_then.29903
	li	$8, 1
	j	ble.s_cont.29904
ble.s_then.29903:
	li	$8, 0
ble.s_cont.29904:
	beq	$8, $0, beq_then.29905
	j	beq_cont.29906
beq_then.29905:
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
beq_cont.29906:
	lw.s	$f2, 16($sp)
	mul.s	$f1, $f2, $f1
	lw	$8, 24($sp)
	lw	$8, 28($8)
	lw.s	$f2, 0($8)
	mul.s	$f1, $f1, $f2
	li	$8, 624
	lw.s	$f2, 0($8)
	li	$8, 612
	lw.s	$f3, 0($8)
	mul.s	$f3, $f1, $f3
	add.s	$f2, $f2, $f3
	li	$8, 624
	sw.s	$f2, 0($8)
	li	$8, 628
	lw.s	$f2, 0($8)
	li	$8, 616
	lw.s	$f3, 0($8)
	mul.s	$f3, $f1, $f3
	add.s	$f2, $f2, $f3
	li	$8, 628
	sw.s	$f2, 0($8)
	li	$8, 632
	lw.s	$f2, 0($8)
	li	$8, 620
	lw.s	$f3, 0($8)
	mul.s	$f1, $f1, $f3
	add.s	$f1, $f2, $f1
	li	$8, 632
	sw.s	$f1, 0($8)
	j	beq_cont.29902
beq_then.29901:
beq_cont.29902:
	j	beq_cont.29828
beq_then.29827:
beq_cont.29828:
	j	beq_cont.29820
beq_then.29819:
	sll	$12, $11, 2
	add	$12, $8, $12
	lw	$12, 0($12)
	lui.s	$f2, 0x3bda	# 0.006667の上位16ビット
	lli.s	$f2, 0x740e	# 0.006667の下位16ビット
	mul.s	$f1, $f1, $f2
	lui.s	$f2, 0x4e6e	# 1000000000.000000の上位16ビット
	lli.s	$f2, 0x6b28	# 1000000000.000000の下位16ビット
	li	$13, 580
	sw.s	$f2, 0($13)
	li	$13, 0
	li	$14, 568
	lw	$14, 0($14)
	sw.s	$f1, 28($sp)
	sw	$12, 32($sp)
	mv	$10, $12
	mv	$9, $14
	mv	$8, $13
	sw	$ra, 36($sp)
	addi	$sp, $sp, 40
	jal	trace_or_matrix_fast..7229
	addi	$sp, $sp, -40
	lw	$ra, 36($sp)
	li	$8, 580
	lw.s	$f1, 0($8)
	lui.s	$f2, 0xbdcc	# -0.100000の上位16ビット
	lli.s	$f2, 0xcccd	# -0.100000の下位16ビット
	ble.s	$f1, $f2, ble.s_then.29907
	li	$8, 1
	j	ble.s_cont.29908
ble.s_then.29907:
	li	$8, 0
ble.s_cont.29908:
	beq	$8, $0, beq_then.29909
	lui.s	$f2, 0x4cbe	# 100000000.000000の上位16ビット
	lli.s	$f2, 0xbc20	# 100000000.000000の下位16ビット
	ble.s	$f2, $f1, ble.s_then.29911
	li	$8, 1
	j	ble.s_cont.29912
ble.s_then.29911:
	li	$8, 0
ble.s_cont.29912:
	j	beq_cont.29910
beq_then.29909:
	li	$8, 0
beq_cont.29910:
	beq	$8, $0, beq_then.29913
	li	$8, 596
	lw	$8, 0($8)
	sll	$8, $8, 2
	addi	$8, $8, 80
	lw	$8, 0($8)
	lw	$9, 32($sp)
	lw	$9, 0($9)
	lw	$10, 4($8)
	beq	$10, $1, beq_then.29915
	beq	$10, $2, beq_then.29917
	li	$9, 584
	lw.s	$f1, 0($9)
	lw	$9, 20($8)
	lw.s	$f2, 0($9)
	sub.s	$f1, $f1, $f2
	li	$9, 588
	lw.s	$f2, 0($9)
	lw	$9, 20($8)
	addi	$9, $9, 4
	lw.s	$f3, 0($9)
	sub.s	$f2, $f2, $f3
	li	$9, 592
	lw.s	$f3, 0($9)
	lw	$9, 20($8)
	addi	$9, $9, 8
	lw.s	$f4, 0($9)
	sub.s	$f3, $f3, $f4
	lw	$9, 16($8)
	lw.s	$f4, 0($9)
	mul.s	$f4, $f1, $f4
	lw	$9, 16($8)
	addi	$9, $9, 4
	lw.s	$f5, 0($9)
	mul.s	$f5, $f2, $f5
	lw	$9, 16($8)
	addi	$9, $9, 8
	lw.s	$f6, 0($9)
	mul.s	$f6, $f3, $f6
	lw	$9, 12($8)
	beq	$9, $0, beq_then.29919
	lw	$9, 36($8)
	addi	$9, $9, 8
	lw.s	$f7, 0($9)
	mul.s	$f7, $f2, $f7
	lw	$9, 36($8)
	addi	$9, $9, 4
	lw.s	$f8, 0($9)
	mul.s	$f8, $f3, $f8
	add.s	$f7, $f7, $f8
	lui.s	$f8, 0x3f00	# 0.500000の上位16ビット
	mul.s	$f7, $f7, $f8
	add.s	$f4, $f4, $f7
	li	$9, 600
	sw.s	$f4, 0($9)
	lw	$9, 36($8)
	addi	$9, $9, 8
	lw.s	$f4, 0($9)
	mul.s	$f4, $f1, $f4
	lw	$9, 36($8)
	lw.s	$f7, 0($9)
	mul.s	$f3, $f3, $f7
	add.s	$f3, $f4, $f3
	lui.s	$f4, 0x3f00	# 0.500000の上位16ビット
	mul.s	$f3, $f3, $f4
	add.s	$f3, $f5, $f3
	li	$9, 604
	sw.s	$f3, 0($9)
	lw	$9, 36($8)
	addi	$9, $9, 4
	lw.s	$f3, 0($9)
	mul.s	$f1, $f1, $f3
	lw	$9, 36($8)
	lw.s	$f3, 0($9)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	lui.s	$f2, 0x3f00	# 0.500000の上位16ビット
	mul.s	$f1, $f1, $f2
	add.s	$f1, $f6, $f1
	li	$9, 608
	sw.s	$f1, 0($9)
	j	beq_cont.29920
beq_then.29919:
	li	$9, 600
	sw.s	$f4, 0($9)
	li	$9, 604
	sw.s	$f5, 0($9)
	li	$9, 608
	sw.s	$f6, 0($9)
beq_cont.29920:
	lw	$9, 24($8)
	li	$10, 600
	lw.s	$f1, 0($10)
	mul.s	$f1, $f1, $f1
	li	$10, 604
	lw.s	$f2, 0($10)
	mul.s	$f2, $f2, $f2
	add.s	$f1, $f1, $f2
	li	$10, 608
	lw.s	$f2, 0($10)
	mul.s	$f2, $f2, $f2
	add.s	$f1, $f1, $f2
	sqrt.s	$f1, $f1
	beq.s	$f1, $f0, beq.s_then.29921
	li	$10, 0
	j	beq.s_cont.29922
beq.s_then.29921:
	li	$10, 1
beq.s_cont.29922:
	beq	$10, $0, beq_then.29923
	lui.s	$f1, 0x3f80	# 1.000000の上位16ビット
	j	beq_cont.29924
beq_then.29923:
	beq	$9, $0, beq_then.29925
	inv.s	$f1, $f1
	neg.s	$f1, $f1
	j	beq_cont.29926
beq_then.29925:
	inv.s	$f1, $f1
beq_cont.29926:
beq_cont.29924:
	li	$9, 600
	lw.s	$f2, 0($9)
	mul.s	$f2, $f2, $f1
	li	$9, 600
	sw.s	$f2, 0($9)
	li	$9, 604
	lw.s	$f2, 0($9)
	mul.s	$f2, $f2, $f1
	li	$9, 604
	sw.s	$f2, 0($9)
	li	$9, 608
	lw.s	$f2, 0($9)
	mul.s	$f1, $f2, $f1
	li	$9, 608
	sw.s	$f1, 0($9)
	j	beq_cont.29918
beq_then.29917:
	lw	$9, 16($8)
	lw.s	$f1, 0($9)
	neg.s	$f1, $f1
	li	$9, 600
	sw.s	$f1, 0($9)
	lw	$9, 16($8)
	addi	$9, $9, 4
	lw.s	$f1, 0($9)
	neg.s	$f1, $f1
	li	$9, 604
	sw.s	$f1, 0($9)
	lw	$9, 16($8)
	addi	$9, $9, 8
	lw.s	$f1, 0($9)
	neg.s	$f1, $f1
	li	$9, 608
	sw.s	$f1, 0($9)
beq_cont.29918:
	j	beq_cont.29916
beq_then.29915:
	li	$10, 576
	lw	$10, 0($10)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$11, 600
	sw.s	$f1, 0($11)
	li	$11, 604
	sw.s	$f1, 0($11)
	li	$11, 608
	sw.s	$f1, 0($11)
	addi	$11, $10, -1
	addi	$10, $10, -1
	sll	$10, $10, 2
	add	$9, $9, $10
	lw.s	$f1, 0($9)
	beq.s	$f1, $f0, beq.s_then.29927
	li	$9, 0
	j	beq.s_cont.29928
beq.s_then.29927:
	li	$9, 1
beq.s_cont.29928:
	beq	$9, $0, beq_then.29929
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29930
beq_then.29929:
	ble.s	$f1, $f0, ble.s_then.29931
	li	$9, 1
	j	ble.s_cont.29932
ble.s_then.29931:
	li	$9, 0
ble.s_cont.29932:
	beq	$9, $0, beq_then.29933
	lui.s	$f1, 0x3f80	# 1.000000の上位16ビット
	j	beq_cont.29934
beq_then.29933:
	lui.s	$f1, 0xbf80	# -1.000000の上位16ビット
beq_cont.29934:
beq_cont.29930:
	neg.s	$f1, $f1
	sll	$9, $11, 2
	addi	$9, $9, 600
	sw.s	$f1, 0($9)
beq_cont.29916:
	lw	$9, 0($8)
	lw	$10, 32($8)
	lw.s	$f1, 0($10)
	li	$10, 612
	sw.s	$f1, 0($10)
	lw	$10, 32($8)
	addi	$10, $10, 4
	lw.s	$f1, 0($10)
	li	$10, 616
	sw.s	$f1, 0($10)
	lw	$10, 32($8)
	addi	$10, $10, 8
	lw.s	$f1, 0($10)
	li	$10, 620
	sw.s	$f1, 0($10)
	sw	$8, 36($sp)
	beq	$9, $1, beq_then.29935
	beq	$9, $2, beq_then.29937
	beq	$9, $3, beq_then.29939
	beq	$9, $4, beq_then.29941
	j	beq_cont.29942
beq_then.29941:
	li	$9, 584
	lw.s	$f1, 0($9)
	lw	$9, 20($8)
	lw.s	$f2, 0($9)
	sub.s	$f1, $f1, $f2
	lw	$9, 16($8)
	lw.s	$f2, 0($9)
	sqrt.s	$f2, $f2
	mul.s	$f1, $f1, $f2
	li	$9, 592
	lw.s	$f2, 0($9)
	lw	$9, 20($8)
	addi	$9, $9, 8
	lw.s	$f3, 0($9)
	sub.s	$f2, $f2, $f3
	lw	$9, 16($8)
	addi	$9, $9, 8
	lw.s	$f3, 0($9)
	sqrt.s	$f3, $f3
	mul.s	$f2, $f2, $f3
	mul.s	$f3, $f1, $f1
	mul.s	$f4, $f2, $f2
	add.s	$f3, $f3, $f4
	abs.s	$f4, $f1
	lui.s	$f5, 0x38d1	# 0.000100の上位16ビット
	lli.s	$f5, 0xb717	# 0.000100の下位16ビット
	ble.s	$f5, $f4, ble.s_then.29943
	li	$9, 1
	j	ble.s_cont.29944
ble.s_then.29943:
	li	$9, 0
ble.s_cont.29944:
	beq	$9, $0, beq_then.29945
	lui.s	$f1, 0x4170	# 15.000000の上位16ビット
	j	beq_cont.29946
beq_then.29945:
	inv.s	$f1, $f1
	mul.s	$f1, $f2, $f1
	abs.s	$f1, $f1
	mul.s	$f2, $f1, $f1
	lui.s	$f4, 0x3f80	# 1.000000の上位16ビット
	lui.s	$f5, 0x3eaa	# 0.333333の上位16ビット
	lli.s	$f5, 0xaaab	# 0.333333の下位16ビット
	lui.s	$f6, 0x3e4c	# 0.200000の上位16ビット
	lli.s	$f6, 0xcccd	# 0.200000の下位16ビット
	lui.s	$f7, 0x3e12	# 0.142857の上位16ビット
	lli.s	$f7, 0x4925	# 0.142857の下位16ビット
	mul.s	$f7, $f2, $f7
	sub.s	$f6, $f6, $f7
	mul.s	$f6, $f2, $f6
	sub.s	$f5, $f5, $f6
	mul.s	$f2, $f2, $f5
	sub.s	$f2, $f4, $f2
	mul.s	$f1, $f1, $f2
	lui.s	$f2, 0x41f0	# 30.000000の上位16ビット
	mul.s	$f1, $f1, $f2
	lui.s	$f2, 0x3ea2	# 0.318310の上位16ビット
	lli.s	$f2, 0xf983	# 0.318310の下位16ビット
	mul.s	$f1, $f1, $f2
beq_cont.29946:
	ftoi	$9, $f1
	itof	$f2, $9
	ble.s	$f0, $f1, ble.s_then.29947
	beq.s	$f1, $f2, beq.s_then.29949
	lui.s	$f4, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f2, $f2, $f4
	j	beq.s_cont.29950
beq.s_then.29949:
	mv.s	$f2, $f1
beq.s_cont.29950:
	j	ble.s_cont.29948
ble.s_then.29947:
ble.s_cont.29948:
	sub.s	$f1, $f1, $f2
	li	$9, 588
	lw.s	$f2, 0($9)
	lw	$9, 20($8)
	addi	$9, $9, 4
	lw.s	$f4, 0($9)
	sub.s	$f2, $f2, $f4
	lw	$9, 16($8)
	addi	$9, $9, 4
	lw.s	$f4, 0($9)
	sqrt.s	$f4, $f4
	mul.s	$f2, $f2, $f4
	abs.s	$f4, $f3
	lui.s	$f5, 0x38d1	# 0.000100の上位16ビット
	lli.s	$f5, 0xb717	# 0.000100の下位16ビット
	ble.s	$f5, $f4, ble.s_then.29951
	li	$9, 1
	j	ble.s_cont.29952
ble.s_then.29951:
	li	$9, 0
ble.s_cont.29952:
	beq	$9, $0, beq_then.29953
	lui.s	$f2, 0x4170	# 15.000000の上位16ビット
	j	beq_cont.29954
beq_then.29953:
	inv.s	$f3, $f3
	mul.s	$f2, $f2, $f3
	abs.s	$f2, $f2
	mul.s	$f3, $f2, $f2
	lui.s	$f4, 0x3f80	# 1.000000の上位16ビット
	lui.s	$f5, 0x3eaa	# 0.333333の上位16ビット
	lli.s	$f5, 0xaaab	# 0.333333の下位16ビット
	lui.s	$f6, 0x3e4c	# 0.200000の上位16ビット
	lli.s	$f6, 0xcccd	# 0.200000の下位16ビット
	lui.s	$f7, 0x3e12	# 0.142857の上位16ビット
	lli.s	$f7, 0x4925	# 0.142857の下位16ビット
	mul.s	$f7, $f3, $f7
	sub.s	$f6, $f6, $f7
	mul.s	$f6, $f3, $f6
	sub.s	$f5, $f5, $f6
	mul.s	$f3, $f3, $f5
	sub.s	$f3, $f4, $f3
	mul.s	$f2, $f2, $f3
	lui.s	$f3, 0x41f0	# 30.000000の上位16ビット
	mul.s	$f2, $f2, $f3
	lui.s	$f3, 0x3ea2	# 0.318310の上位16ビット
	lli.s	$f3, 0xf983	# 0.318310の下位16ビット
	mul.s	$f2, $f2, $f3
beq_cont.29954:
	ftoi	$9, $f2
	itof	$f3, $9
	ble.s	$f0, $f2, ble.s_then.29955
	beq.s	$f2, $f3, beq.s_then.29957
	lui.s	$f4, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f3, $f3, $f4
	j	beq.s_cont.29958
beq.s_then.29957:
	mv.s	$f3, $f2
beq.s_cont.29958:
	j	ble.s_cont.29956
ble.s_then.29955:
ble.s_cont.29956:
	sub.s	$f2, $f2, $f3
	lui.s	$f3, 0x3e19	# 0.150000の上位16ビット
	lli.s	$f3, 0x999a	# 0.150000の下位16ビット
	lui.s	$f4, 0x3f00	# 0.500000の上位16ビット
	sub.s	$f1, $f4, $f1
	mul.s	$f1, $f1, $f1
	sub.s	$f1, $f3, $f1
	lui.s	$f3, 0x3f00	# 0.500000の上位16ビット
	sub.s	$f2, $f3, $f2
	mul.s	$f2, $f2, $f2
	sub.s	$f1, $f1, $f2
	ble.s	$f0, $f1, ble.s_then.29959
	li	$9, 1
	j	ble.s_cont.29960
ble.s_then.29959:
	li	$9, 0
ble.s_cont.29960:
	beq	$9, $0, beq_then.29961
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29962
beq_then.29961:
beq_cont.29962:
	lui.s	$f2, 0x437f	# 255.000000の上位16ビット
	mul.s	$f1, $f2, $f1
	lui.s	$f2, 0x4055	# 3.333333の上位16ビット
	lli.s	$f2, 0x5555	# 3.333333の下位16ビット
	mul.s	$f1, $f1, $f2
	li	$9, 620
	sw.s	$f1, 0($9)
beq_cont.29942:
	j	beq_cont.29940
beq_then.29939:
	li	$9, 584
	lw.s	$f1, 0($9)
	lw	$9, 20($8)
	lw.s	$f2, 0($9)
	sub.s	$f1, $f1, $f2
	li	$9, 592
	lw.s	$f2, 0($9)
	lw	$9, 20($8)
	addi	$9, $9, 8
	lw.s	$f3, 0($9)
	sub.s	$f2, $f2, $f3
	mul.s	$f1, $f1, $f1
	mul.s	$f2, $f2, $f2
	add.s	$f1, $f1, $f2
	sqrt.s	$f1, $f1
	lui.s	$f2, 0x3dcc	# 0.100000の上位16ビット
	lli.s	$f2, 0xcccd	# 0.100000の下位16ビット
	mul.s	$f1, $f1, $f2
	ftoi	$9, $f1
	itof	$f2, $9
	ble.s	$f0, $f1, ble.s_then.29963
	beq.s	$f1, $f2, beq.s_then.29965
	lui.s	$f3, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f2, $f2, $f3
	j	beq.s_cont.29966
beq.s_then.29965:
	mv.s	$f2, $f1
beq.s_cont.29966:
	j	ble.s_cont.29964
ble.s_then.29963:
ble.s_cont.29964:
	sub.s	$f1, $f1, $f2
	lui.s	$f2, 0x4049	# 3.141593の上位16ビット
	lli.s	$f2, 0xfdb	# 3.141593の下位16ビット
	mul.s	$f1, $f1, $f2
	sw	$ra, 40($sp)
	addi	$sp, $sp, 44
	jal	cos..6891
	addi	$sp, $sp, -44
	lw	$ra, 40($sp)
	mul.s	$f1, $f1, $f1
	lui.s	$f2, 0x437f	# 255.000000の上位16ビット
	mul.s	$f2, $f1, $f2
	li	$8, 616
	sw.s	$f2, 0($8)
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f1, $f2, $f1
	lui.s	$f2, 0x437f	# 255.000000の上位16ビット
	mul.s	$f1, $f1, $f2
	li	$8, 620
	sw.s	$f1, 0($8)
beq_cont.29940:
	j	beq_cont.29938
beq_then.29937:
	li	$9, 588
	lw.s	$f1, 0($9)
	lui.s	$f2, 0x3e80	# 0.250000の上位16ビット
	mul.s	$f1, $f1, $f2
	sw	$ra, 40($sp)
	addi	$sp, $sp, 44
	jal	sin..6893
	addi	$sp, $sp, -44
	lw	$ra, 40($sp)
	mul.s	$f1, $f1, $f1
	lui.s	$f2, 0x437f	# 255.000000の上位16ビット
	mul.s	$f2, $f2, $f1
	li	$8, 612
	sw.s	$f2, 0($8)
	lui.s	$f2, 0x437f	# 255.000000の上位16ビット
	lui.s	$f3, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f1, $f3, $f1
	mul.s	$f1, $f2, $f1
	li	$8, 616
	sw.s	$f1, 0($8)
beq_cont.29938:
	j	beq_cont.29936
beq_then.29935:
	li	$9, 584
	lw.s	$f1, 0($9)
	lw	$9, 20($8)
	lw.s	$f2, 0($9)
	sub.s	$f1, $f1, $f2
	lui.s	$f2, 0x3d4c	# 0.050000の上位16ビット
	lli.s	$f2, 0xcccd	# 0.050000の下位16ビット
	mul.s	$f2, $f1, $f2
	ftoi	$9, $f2
	itof	$f3, $9
	ble.s	$f0, $f2, ble.s_then.29967
	beq.s	$f2, $f3, beq.s_then.29969
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f2, $f3, $f2
	j	beq.s_cont.29970
beq.s_then.29969:
beq.s_cont.29970:
	j	ble.s_cont.29968
ble.s_then.29967:
	mv.s	$f2, $f3
ble.s_cont.29968:
	lui.s	$f3, 0x41a0	# 20.000000の上位16ビット
	mul.s	$f2, $f2, $f3
	sub.s	$f1, $f1, $f2
	lui.s	$f2, 0x4120	# 10.000000の上位16ビット
	ble.s	$f2, $f1, ble.s_then.29971
	li	$9, 1
	j	ble.s_cont.29972
ble.s_then.29971:
	li	$9, 0
ble.s_cont.29972:
	li	$10, 592
	lw.s	$f1, 0($10)
	lw	$10, 20($8)
	addi	$10, $10, 8
	lw.s	$f2, 0($10)
	sub.s	$f1, $f1, $f2
	lui.s	$f2, 0x3d4c	# 0.050000の上位16ビット
	lli.s	$f2, 0xcccd	# 0.050000の下位16ビット
	mul.s	$f2, $f1, $f2
	ftoi	$10, $f2
	itof	$f3, $10
	ble.s	$f0, $f2, ble.s_then.29973
	beq.s	$f2, $f3, beq.s_then.29975
	lui.s	$f2, 0x3f80	# 1.000000の上位16ビット
	sub.s	$f2, $f3, $f2
	j	beq.s_cont.29976
beq.s_then.29975:
beq.s_cont.29976:
	j	ble.s_cont.29974
ble.s_then.29973:
	mv.s	$f2, $f3
ble.s_cont.29974:
	lui.s	$f3, 0x41a0	# 20.000000の上位16ビット
	mul.s	$f2, $f2, $f3
	sub.s	$f1, $f1, $f2
	lui.s	$f2, 0x4120	# 10.000000の上位16ビット
	ble.s	$f2, $f1, ble.s_then.29977
	li	$10, 1
	j	ble.s_cont.29978
ble.s_then.29977:
	li	$10, 0
ble.s_cont.29978:
	beq	$9, $0, beq_then.29979
	beq	$10, $0, beq_then.29981
	lui.s	$f1, 0x437f	# 255.000000の上位16ビット
	j	beq_cont.29982
beq_then.29981:
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
beq_cont.29982:
	j	beq_cont.29980
beq_then.29979:
	beq	$10, $0, beq_then.29983
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	j	beq_cont.29984
beq_then.29983:
	lui.s	$f1, 0x437f	# 255.000000の上位16ビット
beq_cont.29984:
beq_cont.29980:
	li	$9, 616
	sw.s	$f1, 0($9)
beq_cont.29936:
	li	$8, 0
	li	$9, 568
	lw	$9, 0($9)
	sw	$ra, 40($sp)
	addi	$sp, $sp, 44
	jal	shadow_check_one_or_matrix..7204
	addi	$sp, $sp, -44
	lw	$ra, 40($sp)
	beq	$8, $0, beq_then.29985
	li	$8, 0
	j	beq_cont.29986
beq_then.29985:
	li	$8, 1
beq_cont.29986:
	beq	$8, $0, beq_then.29987
	li	$8, 600
	lw.s	$f1, 0($8)
	li	$8, 344
	lw.s	$f2, 0($8)
	mul.s	$f1, $f1, $f2
	li	$8, 604
	lw.s	$f2, 0($8)
	li	$8, 348
	lw.s	$f3, 0($8)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	li	$8, 608
	lw.s	$f2, 0($8)
	li	$8, 352
	lw.s	$f3, 0($8)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	neg.s	$f1, $f1
	ble.s	$f1, $f0, ble.s_then.29989
	li	$8, 1
	j	ble.s_cont.29990
ble.s_then.29989:
	li	$8, 0
ble.s_cont.29990:
	beq	$8, $0, beq_then.29991
	j	beq_cont.29992
beq_then.29991:
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
beq_cont.29992:
	lw.s	$f2, 28($sp)
	mul.s	$f1, $f2, $f1
	lw	$8, 36($sp)
	lw	$8, 28($8)
	lw.s	$f2, 0($8)
	mul.s	$f1, $f1, $f2
	li	$8, 624
	lw.s	$f2, 0($8)
	li	$8, 612
	lw.s	$f3, 0($8)
	mul.s	$f3, $f1, $f3
	add.s	$f2, $f2, $f3
	li	$8, 624
	sw.s	$f2, 0($8)
	li	$8, 628
	lw.s	$f2, 0($8)
	li	$8, 616
	lw.s	$f3, 0($8)
	mul.s	$f3, $f1, $f3
	add.s	$f2, $f2, $f3
	li	$8, 628
	sw.s	$f2, 0($8)
	li	$8, 632
	lw.s	$f2, 0($8)
	li	$8, 620
	lw.s	$f3, 0($8)
	mul.s	$f1, $f1, $f3
	add.s	$f1, $f2, $f1
	li	$8, 632
	sw.s	$f1, 0($8)
	j	beq_cont.29988
beq_then.29987:
beq_cont.29988:
	j	beq_cont.29914
beq_then.29913:
beq_cont.29914:
beq_cont.29820:
	lw	$8, 12($sp)
	addi	$11, $8, -2
	lw	$8, 8($sp)
	lw	$9, 4($sp)
	lw	$10, 0($sp)
	j	iter_trace_diffuse_rays.A(f).7265
do_without_neighbors.A(f).7287:
	ble	$9, $4, ble_then.29993
	jr	$ra
ble_then.29993:
	lw	$10, 8($8)
	sll	$11, $9, 2
	add	$10, $10, $11
	lw	$10, 0($10)
	ble	$0, $10, ble_then.29995
	jr	$ra
ble_then.29995:
	lw	$10, 12($8)
	sll	$11, $9, 2
	add	$10, $10, $11
	lw	$10, 0($10)
	sw	$8, 0($sp)
	sw	$9, 4($sp)
	beq	$10, $0, beq_then.29997
	lw	$10, 20($8)
	lw	$11, 28($8)
	lw	$12, 4($8)
	lw	$13, 16($8)
	sll	$14, $9, 2
	add	$10, $10, $14
	lw	$10, 0($10)
	mv	$14, $10
	lw.s	$f1, 0($14)
	li	$14, 624
	sw.s	$f1, 0($14)
	addi	$14, $10, 4
	lw.s	$f1, 0($14)
	li	$14, 628
	sw.s	$f1, 0($14)
	addi	$10, $10, 8
	lw.s	$f1, 0($10)
	li	$10, 632
	sw.s	$f1, 0($10)
	lw	$10, 24($8)
	lw	$10, 0($10)
	sll	$14, $9, 2
	add	$11, $11, $14
	lw	$11, 0($11)
	sll	$14, $9, 2
	add	$12, $12, $14
	lw	$12, 0($12)
	sw	$13, 8($sp)
	sw	$11, 12($sp)
	sw	$12, 16($sp)
	sw	$10, 20($sp)
	beq	$10, $0, beq_then.29999
	li	$14, 748
	lw	$14, 0($14)
	mv	$15, $12
	lw.s	$f1, 0($15)
	li	$15, 680
	sw.s	$f1, 0($15)
	addi	$15, $12, 4
	lw.s	$f1, 0($15)
	li	$15, 684
	sw.s	$f1, 0($15)
	addi	$15, $12, 8
	lw.s	$f1, 0($15)
	li	$15, 688
	sw.s	$f1, 0($15)
	li	$15, 32
	lw	$15, 0($15)
	addi	$15, $15, -1
	sw	$14, 24($sp)
	mv	$9, $15
	mv	$8, $12
	sw	$ra, 28($sp)
	addi	$sp, $sp, 32
	jal	setup_startp_constants..7167
	addi	$sp, $sp, -32
	lw	$ra, 28($sp)
	li	$11, 118
	lw	$8, 24($sp)
	lw	$9, 12($sp)
	lw	$10, 16($sp)
	sw	$ra, 28($sp)
	addi	$sp, $sp, 32
	jal	iter_trace_diffuse_rays.A(f).7265
	addi	$sp, $sp, -32
	lw	$ra, 28($sp)
	j	beq_cont.30000
beq_then.29999:
beq_cont.30000:
	lw	$8, 20($sp)
	beq	$8, $1, beq_then.30001
	li	$9, 752
	lw	$9, 0($9)
	lw	$10, 16($sp)
	mv	$11, $10
	lw.s	$f1, 0($11)
	li	$11, 680
	sw.s	$f1, 0($11)
	addi	$11, $10, 4
	lw.s	$f1, 0($11)
	li	$11, 684
	sw.s	$f1, 0($11)
	addi	$11, $10, 8
	lw.s	$f1, 0($11)
	li	$11, 688
	sw.s	$f1, 0($11)
	li	$11, 32
	lw	$11, 0($11)
	addi	$11, $11, -1
	sw	$9, 28($sp)
	mv	$9, $11
	mv	$8, $10
	sw	$ra, 32($sp)
	addi	$sp, $sp, 36
	jal	setup_startp_constants..7167
	addi	$sp, $sp, -36
	lw	$ra, 32($sp)
	li	$11, 118
	lw	$8, 28($sp)
	lw	$9, 12($sp)
	lw	$10, 16($sp)
	sw	$ra, 32($sp)
	addi	$sp, $sp, 36
	jal	iter_trace_diffuse_rays.A(f).7265
	addi	$sp, $sp, -36
	lw	$ra, 32($sp)
	j	beq_cont.30002
beq_then.30001:
beq_cont.30002:
	lw	$8, 20($sp)
	beq	$8, $2, beq_then.30003
	li	$9, 756
	lw	$9, 0($9)
	lw	$10, 16($sp)
	mv	$11, $10
	lw.s	$f1, 0($11)
	li	$11, 680
	sw.s	$f1, 0($11)
	addi	$11, $10, 4
	lw.s	$f1, 0($11)
	li	$11, 684
	sw.s	$f1, 0($11)
	addi	$11, $10, 8
	lw.s	$f1, 0($11)
	li	$11, 688
	sw.s	$f1, 0($11)
	li	$11, 32
	lw	$11, 0($11)
	addi	$11, $11, -1
	sw	$9, 32($sp)
	mv	$9, $11
	mv	$8, $10
	sw	$ra, 36($sp)
	addi	$sp, $sp, 40
	jal	setup_startp_constants..7167
	addi	$sp, $sp, -40
	lw	$ra, 36($sp)
	li	$11, 118
	lw	$8, 32($sp)
	lw	$9, 12($sp)
	lw	$10, 16($sp)
	sw	$ra, 36($sp)
	addi	$sp, $sp, 40
	jal	iter_trace_diffuse_rays.A(f).7265
	addi	$sp, $sp, -40
	lw	$ra, 36($sp)
	j	beq_cont.30004
beq_then.30003:
beq_cont.30004:
	lw	$8, 20($sp)
	beq	$8, $3, beq_then.30005
	li	$9, 760
	lw	$9, 0($9)
	lw	$10, 16($sp)
	mv	$11, $10
	lw.s	$f1, 0($11)
	li	$11, 680
	sw.s	$f1, 0($11)
	addi	$11, $10, 4
	lw.s	$f1, 0($11)
	li	$11, 684
	sw.s	$f1, 0($11)
	addi	$11, $10, 8
	lw.s	$f1, 0($11)
	li	$11, 688
	sw.s	$f1, 0($11)
	li	$11, 32
	lw	$11, 0($11)
	addi	$11, $11, -1
	sw	$9, 36($sp)
	mv	$9, $11
	mv	$8, $10
	sw	$ra, 40($sp)
	addi	$sp, $sp, 44
	jal	setup_startp_constants..7167
	addi	$sp, $sp, -44
	lw	$ra, 40($sp)
	li	$11, 118
	lw	$8, 36($sp)
	lw	$9, 12($sp)
	lw	$10, 16($sp)
	sw	$ra, 40($sp)
	addi	$sp, $sp, 44
	jal	iter_trace_diffuse_rays.A(f).7265
	addi	$sp, $sp, -44
	lw	$ra, 40($sp)
	j	beq_cont.30006
beq_then.30005:
beq_cont.30006:
	lw	$8, 20($sp)
	beq	$8, $4, beq_then.30007
	li	$8, 764
	lw	$8, 0($8)
	lw	$9, 16($sp)
	mv	$10, $9
	lw.s	$f1, 0($10)
	li	$10, 680
	sw.s	$f1, 0($10)
	addi	$10, $9, 4
	lw.s	$f1, 0($10)
	li	$10, 684
	sw.s	$f1, 0($10)
	addi	$10, $9, 8
	lw.s	$f1, 0($10)
	li	$10, 688
	sw.s	$f1, 0($10)
	li	$10, 32
	lw	$10, 0($10)
	addi	$10, $10, -1
	sw	$8, 40($sp)
	mv	$8, $9
	mv	$9, $10
	sw	$ra, 44($sp)
	addi	$sp, $sp, 48
	jal	setup_startp_constants..7167
	addi	$sp, $sp, -48
	lw	$ra, 44($sp)
	li	$11, 118
	lw	$8, 40($sp)
	lw	$9, 12($sp)
	lw	$10, 16($sp)
	sw	$ra, 44($sp)
	addi	$sp, $sp, 48
	jal	iter_trace_diffuse_rays.A(f).7265
	addi	$sp, $sp, -48
	lw	$ra, 44($sp)
	j	beq_cont.30008
beq_then.30007:
beq_cont.30008:
	lw	$8, 4($sp)
	sll	$9, $8, 2
	lw	$10, 8($sp)
	add	$9, $10, $9
	lw	$9, 0($9)
	li	$10, 636
	lw.s	$f1, 0($10)
	mv	$10, $9
	lw.s	$f2, 0($10)
	li	$10, 624
	lw.s	$f3, 0($10)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	li	$10, 636
	sw.s	$f1, 0($10)
	li	$10, 640
	lw.s	$f1, 0($10)
	addi	$10, $9, 4
	lw.s	$f2, 0($10)
	li	$10, 628
	lw.s	$f3, 0($10)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	li	$10, 640
	sw.s	$f1, 0($10)
	li	$10, 644
	lw.s	$f1, 0($10)
	addi	$9, $9, 8
	lw.s	$f2, 0($9)
	li	$9, 632
	lw.s	$f3, 0($9)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	li	$9, 644
	sw.s	$f1, 0($9)
	j	beq_cont.29998
beq_then.29997:
beq_cont.29998:
	lw	$8, 4($sp)
	addi	$9, $8, 1
	lw	$8, 0($sp)
	j	do_without_neighbors.A(f).7287
try_exploit_neighbors.iA(f)A(A(f))A(f)A(b)A(A(f))A(i)A(A(f))A(A(f))A(f)A(b)A(A(f))A(i)A(A(f)).7303:
	sll	$14, $8, 2
	add	$14, $11, $14
	lw	$14, 0($14)
	ble	$13, $4, ble_then.30009
	jr	$ra
ble_then.30009:
	lw	$15, 8($14)
	sll	$16, $13, 2
	add	$15, $15, $16
	lw	$15, 0($15)
	ble	$0, $15, ble_then.30011
	jr	$ra
ble_then.30011:
	sll	$15, $8, 2
	add	$15, $11, $15
	lw	$15, 0($15)
	lw	$15, 8($15)
	sll	$16, $13, 2
	add	$15, $15, $16
	lw	$15, 0($15)
	sll	$16, $8, 2
	add	$16, $10, $16
	lw	$16, 0($16)
	lw	$16, 8($16)
	sll	$17, $13, 2
	add	$16, $16, $17
	lw	$16, 0($16)
	beq	$16, $15, beq_then.30013
	li	$15, 0
	j	beq_cont.30014
beq_then.30013:
	sll	$16, $8, 2
	add	$16, $12, $16
	lw	$16, 0($16)
	lw	$16, 8($16)
	sll	$17, $13, 2
	add	$16, $16, $17
	lw	$16, 0($16)
	beq	$16, $15, beq_then.30015
	li	$15, 0
	j	beq_cont.30016
beq_then.30015:
	addi	$16, $8, -1
	sll	$16, $16, 2
	add	$16, $11, $16
	lw	$16, 0($16)
	lw	$16, 8($16)
	sll	$17, $13, 2
	add	$16, $16, $17
	lw	$16, 0($16)
	beq	$16, $15, beq_then.30017
	li	$15, 0
	j	beq_cont.30018
beq_then.30017:
	addi	$16, $8, 1
	sll	$16, $16, 2
	add	$16, $11, $16
	lw	$16, 0($16)
	lw	$16, 8($16)
	sll	$17, $13, 2
	add	$16, $16, $17
	lw	$16, 0($16)
	beq	$16, $15, beq_then.30019
	li	$15, 0
	j	beq_cont.30020
beq_then.30019:
	li	$15, 1
beq_cont.30020:
beq_cont.30018:
beq_cont.30016:
beq_cont.30014:
	beq	$15, $0, beq_then.30021
	lw	$14, 12($14)
	sll	$15, $13, 2
	add	$14, $14, $15
	lw	$14, 0($14)
	beq	$14, $0, beq_then.30022
	sll	$14, $8, 2
	add	$14, $10, $14
	lw	$14, 0($14)
	lw	$14, 20($14)
	addi	$15, $8, -1
	sll	$15, $15, 2
	add	$15, $11, $15
	lw	$15, 0($15)
	lw	$15, 20($15)
	sll	$16, $8, 2
	add	$16, $11, $16
	lw	$16, 0($16)
	lw	$16, 20($16)
	addi	$17, $8, 1
	sll	$17, $17, 2
	add	$17, $11, $17
	lw	$17, 0($17)
	lw	$17, 20($17)
	sll	$18, $8, 2
	add	$18, $12, $18
	lw	$18, 0($18)
	lw	$18, 20($18)
	sll	$19, $13, 2
	add	$14, $14, $19
	lw	$14, 0($14)
	mv	$19, $14
	lw.s	$f1, 0($19)
	li	$19, 624
	sw.s	$f1, 0($19)
	addi	$19, $14, 4
	lw.s	$f1, 0($19)
	li	$19, 628
	sw.s	$f1, 0($19)
	addi	$14, $14, 8
	lw.s	$f1, 0($14)
	li	$14, 632
	sw.s	$f1, 0($14)
	sll	$14, $13, 2
	add	$14, $15, $14
	lw	$14, 0($14)
	li	$15, 624
	lw.s	$f1, 0($15)
	mv	$15, $14
	lw.s	$f2, 0($15)
	add.s	$f1, $f1, $f2
	li	$15, 624
	sw.s	$f1, 0($15)
	li	$15, 628
	lw.s	$f1, 0($15)
	addi	$15, $14, 4
	lw.s	$f2, 0($15)
	add.s	$f1, $f1, $f2
	li	$15, 628
	sw.s	$f1, 0($15)
	li	$15, 632
	lw.s	$f1, 0($15)
	addi	$14, $14, 8
	lw.s	$f2, 0($14)
	add.s	$f1, $f1, $f2
	li	$14, 632
	sw.s	$f1, 0($14)
	sll	$14, $13, 2
	add	$14, $16, $14
	lw	$14, 0($14)
	li	$15, 624
	lw.s	$f1, 0($15)
	mv	$15, $14
	lw.s	$f2, 0($15)
	add.s	$f1, $f1, $f2
	li	$15, 624
	sw.s	$f1, 0($15)
	li	$15, 628
	lw.s	$f1, 0($15)
	addi	$15, $14, 4
	lw.s	$f2, 0($15)
	add.s	$f1, $f1, $f2
	li	$15, 628
	sw.s	$f1, 0($15)
	li	$15, 632
	lw.s	$f1, 0($15)
	addi	$14, $14, 8
	lw.s	$f2, 0($14)
	add.s	$f1, $f1, $f2
	li	$14, 632
	sw.s	$f1, 0($14)
	sll	$14, $13, 2
	add	$14, $17, $14
	lw	$14, 0($14)
	li	$15, 624
	lw.s	$f1, 0($15)
	mv	$15, $14
	lw.s	$f2, 0($15)
	add.s	$f1, $f1, $f2
	li	$15, 624
	sw.s	$f1, 0($15)
	li	$15, 628
	lw.s	$f1, 0($15)
	addi	$15, $14, 4
	lw.s	$f2, 0($15)
	add.s	$f1, $f1, $f2
	li	$15, 628
	sw.s	$f1, 0($15)
	li	$15, 632
	lw.s	$f1, 0($15)
	addi	$14, $14, 8
	lw.s	$f2, 0($14)
	add.s	$f1, $f1, $f2
	li	$14, 632
	sw.s	$f1, 0($14)
	sll	$14, $13, 2
	add	$14, $18, $14
	lw	$14, 0($14)
	li	$15, 624
	lw.s	$f1, 0($15)
	mv	$15, $14
	lw.s	$f2, 0($15)
	add.s	$f1, $f1, $f2
	li	$15, 624
	sw.s	$f1, 0($15)
	li	$15, 628
	lw.s	$f1, 0($15)
	addi	$15, $14, 4
	lw.s	$f2, 0($15)
	add.s	$f1, $f1, $f2
	li	$15, 628
	sw.s	$f1, 0($15)
	li	$15, 632
	lw.s	$f1, 0($15)
	addi	$14, $14, 8
	lw.s	$f2, 0($14)
	add.s	$f1, $f1, $f2
	li	$14, 632
	sw.s	$f1, 0($14)
	sll	$14, $8, 2
	add	$14, $11, $14
	lw	$14, 0($14)
	lw	$14, 16($14)
	sll	$15, $13, 2
	add	$14, $14, $15
	lw	$14, 0($14)
	li	$15, 636
	lw.s	$f1, 0($15)
	mv	$15, $14
	lw.s	$f2, 0($15)
	li	$15, 624
	lw.s	$f3, 0($15)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	li	$15, 636
	sw.s	$f1, 0($15)
	li	$15, 640
	lw.s	$f1, 0($15)
	addi	$15, $14, 4
	lw.s	$f2, 0($15)
	li	$15, 628
	lw.s	$f3, 0($15)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	li	$15, 640
	sw.s	$f1, 0($15)
	li	$15, 644
	lw.s	$f1, 0($15)
	addi	$14, $14, 8
	lw.s	$f2, 0($14)
	li	$14, 632
	lw.s	$f3, 0($14)
	mul.s	$f2, $f2, $f3
	add.s	$f1, $f1, $f2
	li	$14, 644
	sw.s	$f1, 0($14)
	j	beq_cont.30023
beq_then.30022:
beq_cont.30023:
	addi	$13, $13, 1
	j	try_exploit_neighbors.iA(f)A(A(f))A(f)A(b)A(A(f))A(i)A(A(f))A(A(f))A(f)A(b)A(A(f))A(i)A(A(f)).7303
beq_then.30021:
	sll	$8, $8, 2
	add	$8, $11, $8
	lw	$8, 0($8)
	mv	$9, $13
	j	do_without_neighbors.A(f).7287
pretrace_diffuse_rays.A(f)A(A(f)).7316:
	ble	$9, $4, ble_then.30024
	jr	$ra
ble_then.30024:
	lw	$10, 8($8)
	sll	$11, $9, 2
	add	$10, $10, $11
	lw	$10, 0($10)
	ble	$0, $10, ble_then.30026
	jr	$ra
ble_then.30026:
	lw	$10, 12($8)
	sll	$11, $9, 2
	add	$10, $10, $11
	lw	$10, 0($10)
	sw	$9, 0($sp)
	beq	$10, $0, beq_then.30028
	lw	$10, 24($8)
	lw	$10, 0($10)
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	li	$11, 624
	sw.s	$f1, 0($11)
	li	$11, 628
	sw.s	$f1, 0($11)
	li	$11, 632
	sw.s	$f1, 0($11)
	lw	$11, 28($8)
	lw	$12, 4($8)
	sll	$10, $10, 2
	addi	$10, $10, 748
	lw	$10, 0($10)
	sll	$13, $9, 2
	add	$11, $11, $13
	lw	$11, 0($11)
	sll	$13, $9, 2
	add	$12, $12, $13
	lw	$12, 0($12)
	mv	$13, $12
	lw.s	$f1, 0($13)
	li	$13, 680
	sw.s	$f1, 0($13)
	addi	$13, $12, 4
	lw.s	$f1, 0($13)
	li	$13, 684
	sw.s	$f1, 0($13)
	addi	$13, $12, 8
	lw.s	$f1, 0($13)
	li	$13, 688
	sw.s	$f1, 0($13)
	li	$13, 32
	lw	$13, 0($13)
	addi	$13, $13, -1
	sw	$8, 4($sp)
	sw	$12, 8($sp)
	sw	$11, 12($sp)
	sw	$10, 16($sp)
	mv	$9, $13
	mv	$8, $12
	sw	$ra, 20($sp)
	addi	$sp, $sp, 24
	jal	setup_startp_constants..7167
	addi	$sp, $sp, -24
	lw	$ra, 20($sp)
	li	$11, 118
	lw	$8, 16($sp)
	lw	$9, 12($sp)
	lw	$10, 8($sp)
	sw	$ra, 20($sp)
	addi	$sp, $sp, 24
	jal	iter_trace_diffuse_rays.A(f).7265
	addi	$sp, $sp, -24
	lw	$ra, 20($sp)
	lw	$8, 4($sp)
	lw	$9, 20($8)
	lw	$10, 0($sp)
	sll	$11, $10, 2
	add	$9, $9, $11
	lw	$9, 0($9)
	li	$11, 624
	lw.s	$f1, 0($11)
	mv	$11, $9
	sw.s	$f1, 0($11)
	li	$11, 628
	lw.s	$f1, 0($11)
	addi	$11, $9, 4
	sw.s	$f1, 0($11)
	li	$11, 632
	lw.s	$f1, 0($11)
	addi	$9, $9, 8
	sw.s	$f1, 0($9)
	j	beq_cont.30029
beq_then.30028:
beq_cont.30029:
	lw	$9, 0($sp)
	addi	$9, $9, 1
	j	pretrace_diffuse_rays.A(f)A(A(f)).7316
pretrace_pixels..7319:
	li	$11, 728
	ble	$0, $9, ble_then.30030
	jr	$ra
ble_then.30030:
	li	$12, 664
	lw.s	$f4, 0($12)
	li	$12, 656
	lw	$12, 0($12)
	sub	$12, $9, $12
	itof	$f5, $12
	mul.s	$f4, $f4, $f5
	li	$12, 692
	lw.s	$f5, 0($12)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f1
	li	$12, 728
	sw.s	$f5, 0($12)
	li	$12, 696
	lw.s	$f5, 0($12)
	mul.s	$f5, $f4, $f5
	add.s	$f5, $f5, $f2
	li	$12, 732
	sw.s	$f5, 0($12)
	li	$12, 700
	lw.s	$f5, 0($12)
	mul.s	$f4, $f4, $f5
	add.s	$f4, $f4, $f3
	li	$12, 736
	sw.s	$f4, 0($12)
	li	$12, 728
	lw.s	$f4, 0($12)
	mul.s	$f4, $f4, $f4
	li	$12, 732
	lw.s	$f5, 0($12)
	mul.s	$f5, $f5, $f5
	add.s	$f4, $f4, $f5
	li	$12, 736
	lw.s	$f5, 0($12)
	mul.s	$f5, $f5, $f5
	add.s	$f4, $f4, $f5
	sqrt.s	$f4, $f4
	beq.s	$f4, $f0, beq.s_then.30032
	li	$12, 0
	j	beq.s_cont.30033
beq.s_then.30032:
	li	$12, 1
beq.s_cont.30033:
	beq	$12, $0, beq_then.30034
	lui.s	$f4, 0x3f80	# 1.000000の上位16ビット
	j	beq_cont.30035
beq_then.30034:
	inv.s	$f4, $f4
beq_cont.30035:
	li	$12, 728
	lw.s	$f5, 0($12)
	mul.s	$f5, $f5, $f4
	li	$12, 728
	sw.s	$f5, 0($12)
	li	$12, 732
	lw.s	$f5, 0($12)
	mul.s	$f5, $f5, $f4
	li	$12, 732
	sw.s	$f5, 0($12)
	li	$12, 736
	lw.s	$f5, 0($12)
	mul.s	$f4, $f5, $f4
	li	$12, 736
	sw.s	$f4, 0($12)
	lui.s	$f4, 0x0	# 0.000000の上位16ビット
	li	$12, 636
	sw.s	$f4, 0($12)
	li	$12, 640
	sw.s	$f4, 0($12)
	li	$12, 644
	sw.s	$f4, 0($12)
	li	$12, 332
	lw.s	$f4, 0($12)
	li	$12, 668
	sw.s	$f4, 0($12)
	li	$12, 336
	lw.s	$f4, 0($12)
	li	$12, 672
	sw.s	$f4, 0($12)
	li	$12, 340
	lw.s	$f4, 0($12)
	li	$12, 676
	sw.s	$f4, 0($12)
	li	$12, 0
	lui.s	$f4, 0x3f80	# 1.000000の上位16ビット
	sll	$13, $9, 2
	add	$13, $8, $13
	lw	$13, 0($13)
	lui.s	$f5, 0x0	# 0.000000の上位16ビット
	sw.s	$f3, 0($sp)
	sw.s	$f2, 4($sp)
	sw.s	$f1, 8($sp)
	sw	$10, 12($sp)
	sw	$8, 16($sp)
	sw	$9, 20($sp)
	mv	$10, $13
	mv	$9, $11
	mv	$8, $12
	mv.s	$f2, $f5
	mv.s	$f1, $f4
	sw	$ra, 24($sp)
	addi	$sp, $sp, 28
	jal	trace_ray.A(f)A(A(f))A(i).7256
	addi	$sp, $sp, -28
	lw	$ra, 24($sp)
	lw	$8, 20($sp)
	sll	$9, $8, 2
	lw	$10, 16($sp)
	add	$9, $10, $9
	lw	$9, 0($9)
	lw	$9, 0($9)
	li	$11, 636
	lw.s	$f1, 0($11)
	mv	$11, $9
	sw.s	$f1, 0($11)
	li	$11, 640
	lw.s	$f1, 0($11)
	addi	$11, $9, 4
	sw.s	$f1, 0($11)
	li	$11, 644
	lw.s	$f1, 0($11)
	addi	$9, $9, 8
	sw.s	$f1, 0($9)
	sll	$9, $8, 2
	add	$9, $10, $9
	lw	$9, 0($9)
	lw	$9, 24($9)
	lw	$11, 12($sp)
	sw	$11, 0($9)
	sll	$9, $8, 2
	add	$9, $10, $9
	lw	$9, 0($9)
	li	$12, 0
	mv	$8, $9
	mv	$9, $12
	sw	$ra, 24($sp)
	addi	$sp, $sp, 28
	jal	pretrace_diffuse_rays.A(f)A(A(f)).7316
	addi	$sp, $sp, -28
	lw	$ra, 24($sp)
	lw	$8, 20($sp)
	addi	$9, $8, -1
	lw	$8, 12($sp)
	addi	$8, $8, 1
	ble	$5, $8, ble_then.30036
	mv	$10, $8
	j	ble_cont.30037
ble_then.30036:
	addi	$10, $8, -5
ble_cont.30037:
	lw.s	$f1, 8($sp)
	lw.s	$f2, 4($sp)
	lw.s	$f3, 0($sp)
	lw	$8, 16($sp)
	j	pretrace_pixels..7319
scan_pixel.A(A(f))A(f)A(b)A(A(f))A(i)A(A(f))A(A(f))A(f)A(b)A(A(f))A(i)A(A(f)).7330:
	li	$13, 648
	lw	$13, 0($13)
	ble	$13, $8, ble_then.30038
	sll	$13, $8, 2
	add	$13, $11, $13
	lw	$13, 0($13)
	lw	$13, 0($13)
	mv	$14, $13
	lw.s	$f1, 0($14)
	li	$14, 636
	sw.s	$f1, 0($14)
	addi	$14, $13, 4
	lw.s	$f1, 0($14)
	li	$14, 640
	sw.s	$f1, 0($14)
	addi	$13, $13, 8
	lw.s	$f1, 0($13)
	li	$13, 644
	sw.s	$f1, 0($13)
	li	$13, 652
	lw	$13, 0($13)
	addi	$14, $9, 1
	ble	$13, $14, ble_then.30039
	ble	$9, $0, ble_then.30041
	li	$13, 648
	lw	$13, 0($13)
	addi	$14, $8, 1
	ble	$13, $14, ble_then.30043
	ble	$8, $0, ble_then.30045
	li	$13, 1
	j	ble_cont.30046
ble_then.30045:
	li	$13, 0
ble_cont.30046:
	j	ble_cont.30044
ble_then.30043:
	li	$13, 0
ble_cont.30044:
	j	ble_cont.30042
ble_then.30041:
	li	$13, 0
ble_cont.30042:
	j	ble_cont.30040
ble_then.30039:
	li	$13, 0
ble_cont.30040:
	sw	$12, 0($sp)
	sw	$11, 4($sp)
	sw	$10, 8($sp)
	sw	$9, 12($sp)
	sw	$8, 16($sp)
	beq	$13, $0, beq_then.30047
	li	$13, 0
	sw	$ra, 20($sp)
	addi	$sp, $sp, 24
	jal	try_exploit_neighbors.iA(f)A(A(f))A(f)A(b)A(A(f))A(i)A(A(f))A(A(f))A(f)A(b)A(A(f))A(i)A(A(f)).7303
	addi	$sp, $sp, -24
	lw	$ra, 20($sp)
	j	beq_cont.30048
beq_then.30047:
	sll	$13, $8, 2
	add	$13, $11, $13
	lw	$13, 0($13)
	li	$14, 0
	mv	$9, $14
	mv	$8, $13
	sw	$ra, 20($sp)
	addi	$sp, $sp, 24
	jal	do_without_neighbors.A(f).7287
	addi	$sp, $sp, -24
	lw	$ra, 20($sp)
beq_cont.30048:
	li	$8, 636
	lw.s	$f1, 0($8)
	ftoi	$8, $f1
	ble	$8, $6, ble_then.30049
	li	$8, 255
	j	ble_cont.30050
ble_then.30049:
	ble	$0, $8, ble_then.30051
	li	$8, 0
	j	ble_cont.30052
ble_then.30051:
ble_cont.30052:
ble_cont.30050:
	outint	$8
	li	$8, 32
	out	$8
	li	$8, 640
	lw.s	$f1, 0($8)
	ftoi	$8, $f1
	ble	$8, $6, ble_then.30053
	li	$8, 255
	j	ble_cont.30054
ble_then.30053:
	ble	$0, $8, ble_then.30055
	li	$8, 0
	j	ble_cont.30056
ble_then.30055:
ble_cont.30056:
ble_cont.30054:
	outint	$8
	li	$8, 32
	out	$8
	li	$8, 644
	lw.s	$f1, 0($8)
	ftoi	$8, $f1
	ble	$8, $6, ble_then.30057
	li	$8, 255
	j	ble_cont.30058
ble_then.30057:
	ble	$0, $8, ble_then.30059
	li	$8, 0
	j	ble_cont.30060
ble_then.30059:
ble_cont.30060:
ble_cont.30058:
	outint	$8
	li	$8, 10
	out	$8
	lw	$8, 16($sp)
	addi	$8, $8, 1
	lw	$9, 12($sp)
	lw	$10, 8($sp)
	lw	$11, 4($sp)
	lw	$12, 0($sp)
	j	scan_pixel.A(A(f))A(f)A(b)A(A(f))A(i)A(A(f))A(A(f))A(f)A(b)A(A(f))A(i)A(A(f)).7330
ble_then.30038:
	jr	$ra
scan_line..7336:
	li	$13, 652
	lw	$13, 0($13)
	ble	$13, $8, ble_then.30062
	li	$13, 652
	lw	$13, 0($13)
	addi	$13, $13, -1
	sw	$12, 0($sp)
	sw	$11, 4($sp)
	sw	$10, 8($sp)
	sw	$9, 12($sp)
	sw	$8, 16($sp)
	ble	$13, $8, ble_then.30063
	addi	$13, $8, 1
	li	$14, 664
	lw.s	$f1, 0($14)
	li	$14, 660
	lw	$14, 0($14)
	sub	$13, $13, $14
	itof	$f2, $13
	mul.s	$f1, $f1, $f2
	li	$13, 704
	lw.s	$f2, 0($13)
	mul.s	$f2, $f1, $f2
	li	$13, 716
	lw.s	$f3, 0($13)
	add.s	$f2, $f2, $f3
	li	$13, 708
	lw.s	$f3, 0($13)
	mul.s	$f3, $f1, $f3
	li	$13, 720
	lw.s	$f4, 0($13)
	add.s	$f3, $f3, $f4
	li	$13, 712
	lw.s	$f4, 0($13)
	mul.s	$f1, $f1, $f4
	li	$13, 724
	lw.s	$f4, 0($13)
	add.s	$f1, $f1, $f4
	li	$13, 648
	lw	$13, 0($13)
	addi	$13, $13, -1
	mv	$10, $12
	mv	$9, $13
	mv	$8, $11
	mv.s	$f63, $f3
	mv.s	$f3, $f1
	mv.s	$f1, $f2
	mv.s	$f2, $f63
	sw	$ra, 20($sp)
	addi	$sp, $sp, 24
	jal	pretrace_pixels..7319
	addi	$sp, $sp, -24
	lw	$ra, 20($sp)
	j	ble_cont.30064
ble_then.30063:
ble_cont.30064:
	li	$8, 0
	lw	$9, 16($sp)
	lw	$10, 12($sp)
	lw	$11, 8($sp)
	lw	$12, 4($sp)
	sw	$ra, 20($sp)
	addi	$sp, $sp, 24
	jal	scan_pixel.A(A(f))A(f)A(b)A(A(f))A(i)A(A(f))A(A(f))A(f)A(b)A(A(f))A(i)A(A(f)).7330
	addi	$sp, $sp, -24
	lw	$ra, 20($sp)
	lw	$8, 16($sp)
	addi	$8, $8, 1
	lw	$9, 0($sp)
	addi	$9, $9, 2
	ble	$5, $9, ble_then.30065
	mv	$12, $9
	j	ble_cont.30066
ble_then.30065:
	addi	$12, $9, -5
ble_cont.30066:
	lw	$9, 8($sp)
	lw	$10, 4($sp)
	lw	$11, 12($sp)
	j	scan_line..7336
ble_then.30062:
	jr	$ra
init_line_elements..7346:
	ble	$0, $9, ble_then.30068
	jr	$ra
ble_then.30068:
	li	$10, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$11, $gp
	sw	$8, 0($sp)
	sw	$9, 4($sp)
	sw	$11, 8($sp)
	mv	$8, $10
	sw	$ra, 12($sp)
	addi	$sp, $sp, 16
	jal	create_float_array_loop
	addi	$sp, $sp, -16
	lw	$ra, 12($sp)
	lw	$8, 8($sp)
	li	$9, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$8, 12($sp)
	sw	$10, 16($sp)
	mv	$8, $9
	sw	$ra, 20($sp)
	addi	$sp, $sp, 24
	jal	create_float_array_loop
	addi	$sp, $sp, -24
	lw	$ra, 20($sp)
	lw	$8, 16($sp)
	mv	$9, $8
	li	$8, 5
	mv	$10, $gp
	sw	$10, 20($sp)
	sw	$ra, 24($sp)
	addi	$sp, $sp, 28
	jal	create_array_loop
	addi	$sp, $sp, -28
	lw	$ra, 24($sp)
	lw	$8, 20($sp)
	li	$9, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$8, 24($sp)
	sw	$10, 28($sp)
	mv	$8, $9
	sw	$ra, 32($sp)
	addi	$sp, $sp, 36
	jal	create_float_array_loop
	addi	$sp, $sp, -36
	lw	$ra, 32($sp)
	lw	$8, 28($sp)
	lw	$9, 24($sp)
	addi	$10, $9, 4
	sw	$8, 0($10)
	li	$8, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$10, 32($sp)
	sw	$ra, 36($sp)
	addi	$sp, $sp, 40
	jal	create_float_array_loop
	addi	$sp, $sp, -40
	lw	$ra, 36($sp)
	lw	$8, 32($sp)
	lw	$9, 24($sp)
	addi	$10, $9, 8
	sw	$8, 0($10)
	li	$8, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$10, 36($sp)
	sw	$ra, 40($sp)
	addi	$sp, $sp, 44
	jal	create_float_array_loop
	addi	$sp, $sp, -44
	lw	$ra, 40($sp)
	lw	$8, 36($sp)
	lw	$9, 24($sp)
	addi	$10, $9, 12
	sw	$8, 0($10)
	li	$8, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$10, 40($sp)
	sw	$ra, 44($sp)
	addi	$sp, $sp, 48
	jal	create_float_array_loop
	addi	$sp, $sp, -48
	lw	$ra, 44($sp)
	lw	$8, 40($sp)
	lw	$9, 24($sp)
	addi	$10, $9, 16
	sw	$8, 0($10)
	li	$8, 5
	li	$10, 0
	mv	$11, $gp
	sw	$11, 44($sp)
	mv	$9, $10
	sw	$ra, 48($sp)
	addi	$sp, $sp, 52
	jal	create_array_loop
	addi	$sp, $sp, -52
	lw	$ra, 48($sp)
	lw	$8, 44($sp)
	li	$9, 5
	li	$10, 0
	mv	$11, $gp
	sw	$8, 48($sp)
	sw	$11, 52($sp)
	mv	$8, $9
	mv	$9, $10
	sw	$ra, 56($sp)
	addi	$sp, $sp, 60
	jal	create_array_loop
	addi	$sp, $sp, -60
	lw	$ra, 56($sp)
	lw	$8, 52($sp)
	li	$9, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$8, 56($sp)
	sw	$10, 60($sp)
	mv	$8, $9
	sw	$ra, 64($sp)
	addi	$sp, $sp, 68
	jal	create_float_array_loop
	addi	$sp, $sp, -68
	lw	$ra, 64($sp)
	lw	$8, 60($sp)
	mv	$9, $8
	li	$8, 5
	mv	$10, $gp
	sw	$10, 64($sp)
	sw	$ra, 68($sp)
	addi	$sp, $sp, 72
	jal	create_array_loop
	addi	$sp, $sp, -72
	lw	$ra, 68($sp)
	lw	$8, 64($sp)
	li	$9, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$8, 68($sp)
	sw	$10, 72($sp)
	mv	$8, $9
	sw	$ra, 76($sp)
	addi	$sp, $sp, 80
	jal	create_float_array_loop
	addi	$sp, $sp, -80
	lw	$ra, 76($sp)
	lw	$8, 72($sp)
	lw	$9, 68($sp)
	addi	$10, $9, 4
	sw	$8, 0($10)
	li	$8, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$10, 76($sp)
	sw	$ra, 80($sp)
	addi	$sp, $sp, 84
	jal	create_float_array_loop
	addi	$sp, $sp, -84
	lw	$ra, 80($sp)
	lw	$8, 76($sp)
	lw	$9, 68($sp)
	addi	$10, $9, 8
	sw	$8, 0($10)
	li	$8, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$10, 80($sp)
	sw	$ra, 84($sp)
	addi	$sp, $sp, 88
	jal	create_float_array_loop
	addi	$sp, $sp, -88
	lw	$ra, 84($sp)
	lw	$8, 80($sp)
	lw	$9, 68($sp)
	addi	$10, $9, 12
	sw	$8, 0($10)
	li	$8, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$10, 84($sp)
	sw	$ra, 88($sp)
	addi	$sp, $sp, 92
	jal	create_float_array_loop
	addi	$sp, $sp, -92
	lw	$ra, 88($sp)
	lw	$8, 84($sp)
	lw	$9, 68($sp)
	addi	$10, $9, 16
	sw	$8, 0($10)
	li	$8, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$10, 88($sp)
	sw	$ra, 92($sp)
	addi	$sp, $sp, 96
	jal	create_float_array_loop
	addi	$sp, $sp, -96
	lw	$ra, 92($sp)
	lw	$8, 88($sp)
	mv	$9, $8
	li	$8, 5
	mv	$10, $gp
	sw	$10, 92($sp)
	sw	$ra, 96($sp)
	addi	$sp, $sp, 100
	jal	create_array_loop
	addi	$sp, $sp, -100
	lw	$ra, 96($sp)
	lw	$8, 92($sp)
	li	$9, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$8, 96($sp)
	sw	$10, 100($sp)
	mv	$8, $9
	sw	$ra, 104($sp)
	addi	$sp, $sp, 108
	jal	create_float_array_loop
	addi	$sp, $sp, -108
	lw	$ra, 104($sp)
	lw	$8, 100($sp)
	lw	$9, 96($sp)
	addi	$10, $9, 4
	sw	$8, 0($10)
	li	$8, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$10, 104($sp)
	sw	$ra, 108($sp)
	addi	$sp, $sp, 112
	jal	create_float_array_loop
	addi	$sp, $sp, -112
	lw	$ra, 108($sp)
	lw	$8, 104($sp)
	lw	$9, 96($sp)
	addi	$10, $9, 8
	sw	$8, 0($10)
	li	$8, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$10, 108($sp)
	sw	$ra, 112($sp)
	addi	$sp, $sp, 116
	jal	create_float_array_loop
	addi	$sp, $sp, -116
	lw	$ra, 112($sp)
	lw	$8, 108($sp)
	lw	$9, 96($sp)
	addi	$10, $9, 12
	sw	$8, 0($10)
	li	$8, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$10, 112($sp)
	sw	$ra, 116($sp)
	addi	$sp, $sp, 120
	jal	create_float_array_loop
	addi	$sp, $sp, -120
	lw	$ra, 116($sp)
	lw	$8, 112($sp)
	lw	$9, 96($sp)
	addi	$10, $9, 16
	sw	$8, 0($10)
	li	$8, 1
	li	$10, 0
	mv	$11, $gp
	sw	$11, 116($sp)
	mv	$9, $10
	sw	$ra, 120($sp)
	addi	$sp, $sp, 124
	jal	create_array_loop
	addi	$sp, $sp, -124
	lw	$ra, 120($sp)
	lw	$8, 116($sp)
	li	$9, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$8, 120($sp)
	sw	$10, 124($sp)
	mv	$8, $9
	sw	$ra, 128($sp)
	addi	$sp, $sp, 132
	jal	create_float_array_loop
	addi	$sp, $sp, -132
	lw	$ra, 128($sp)
	lw	$8, 124($sp)
	mv	$9, $8
	li	$8, 5
	mv	$10, $gp
	sw	$10, 128($sp)
	sw	$ra, 132($sp)
	addi	$sp, $sp, 136
	jal	create_array_loop
	addi	$sp, $sp, -136
	lw	$ra, 132($sp)
	lw	$8, 128($sp)
	li	$9, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$8, 132($sp)
	sw	$10, 136($sp)
	mv	$8, $9
	sw	$ra, 140($sp)
	addi	$sp, $sp, 144
	jal	create_float_array_loop
	addi	$sp, $sp, -144
	lw	$ra, 140($sp)
	lw	$8, 136($sp)
	lw	$9, 132($sp)
	addi	$10, $9, 4
	sw	$8, 0($10)
	li	$8, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$10, 140($sp)
	sw	$ra, 144($sp)
	addi	$sp, $sp, 148
	jal	create_float_array_loop
	addi	$sp, $sp, -148
	lw	$ra, 144($sp)
	lw	$8, 140($sp)
	lw	$9, 132($sp)
	addi	$10, $9, 8
	sw	$8, 0($10)
	li	$8, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$10, 144($sp)
	sw	$ra, 148($sp)
	addi	$sp, $sp, 152
	jal	create_float_array_loop
	addi	$sp, $sp, -152
	lw	$ra, 148($sp)
	lw	$8, 144($sp)
	lw	$9, 132($sp)
	addi	$10, $9, 12
	sw	$8, 0($10)
	li	$8, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$10, $gp
	sw	$10, 148($sp)
	sw	$ra, 152($sp)
	addi	$sp, $sp, 156
	jal	create_float_array_loop
	addi	$sp, $sp, -156
	lw	$ra, 152($sp)
	lw	$8, 148($sp)
	lw	$9, 132($sp)
	addi	$10, $9, 16
	sw	$8, 0($10)
	mv	$8, $gp
	addi	$gp, $gp, 32
	sw	$9, 28($8)
	lw	$9, 120($sp)
	sw	$9, 24($8)
	lw	$9, 96($sp)
	sw	$9, 20($8)
	lw	$9, 68($sp)
	sw	$9, 16($8)
	lw	$9, 56($sp)
	sw	$9, 12($8)
	lw	$9, 48($sp)
	sw	$9, 8($8)
	lw	$9, 24($sp)
	sw	$9, 4($8)
	lw	$9, 12($sp)
	sw	$9, 0($8)
	lw	$9, 4($sp)
	sll	$10, $9, 2
	lw	$11, 0($sp)
	add	$10, $11, $10
	sw	$8, 0($10)
	addi	$9, $9, -1
	mv	$8, $11
	j	init_line_elements..7346
calc_dirvec..7354:
	ble	$5, $8, ble_then.30069
	mul.s	$f1, $f2, $f2
	lui.s	$f2, 0x3dcc	# 0.100000の上位16ビット
	lli.s	$f2, 0xcccd	# 0.100000の下位16ビット
	add.s	$f1, $f1, $f2
	sqrt.s	$f1, $f1
	inv.s	$f2, $f1
	mul.s	$f5, $f2, $f2
	lui.s	$f6, 0x3f80	# 1.000000の上位16ビット
	lui.s	$f7, 0x3eaa	# 0.333333の上位16ビット
	lli.s	$f7, 0xaaab	# 0.333333の下位16ビット
	lui.s	$f8, 0x3e4c	# 0.200000の上位16ビット
	lli.s	$f8, 0xcccd	# 0.200000の下位16ビット
	lui.s	$f9, 0x3e12	# 0.142857の上位16ビット
	lli.s	$f9, 0x4925	# 0.142857の下位16ビット
	mul.s	$f9, $f5, $f9
	sub.s	$f8, $f8, $f9
	mul.s	$f8, $f5, $f8
	sub.s	$f7, $f7, $f8
	mul.s	$f5, $f5, $f7
	sub.s	$f5, $f6, $f5
	mul.s	$f2, $f2, $f5
	mul.s	$f2, $f2, $f3
	sw.s	$f3, 0($sp)
	sw	$10, 4($sp)
	sw	$9, 8($sp)
	sw.s	$f4, 12($sp)
	sw	$8, 16($sp)
	sw.s	$f1, 20($sp)
	mv.s	$f1, $f2
	sw	$ra, 24($sp)
	addi	$sp, $sp, 28
	jal	tan..6895
	addi	$sp, $sp, -28
	lw	$ra, 24($sp)
	lw.s	$f2, 20($sp)
	mul.s	$f1, $f1, $f2
	lw	$8, 16($sp)
	addi	$8, $8, 1
	mul.s	$f2, $f1, $f1
	lui.s	$f3, 0x3dcc	# 0.100000の上位16ビット
	lli.s	$f3, 0xcccd	# 0.100000の下位16ビット
	add.s	$f2, $f2, $f3
	sqrt.s	$f2, $f2
	inv.s	$f3, $f2
	mul.s	$f4, $f3, $f3
	lui.s	$f5, 0x3f80	# 1.000000の上位16ビット
	lui.s	$f6, 0x3eaa	# 0.333333の上位16ビット
	lli.s	$f6, 0xaaab	# 0.333333の下位16ビット
	lui.s	$f7, 0x3e4c	# 0.200000の上位16ビット
	lli.s	$f7, 0xcccd	# 0.200000の下位16ビット
	lui.s	$f8, 0x3e12	# 0.142857の上位16ビット
	lli.s	$f8, 0x4925	# 0.142857の下位16ビット
	mul.s	$f8, $f4, $f8
	sub.s	$f7, $f7, $f8
	mul.s	$f7, $f4, $f7
	sub.s	$f6, $f6, $f7
	mul.s	$f4, $f4, $f6
	sub.s	$f4, $f5, $f4
	mul.s	$f3, $f3, $f4
	lw.s	$f4, 12($sp)
	mul.s	$f3, $f3, $f4
	sw.s	$f1, 24($sp)
	sw	$8, 28($sp)
	sw.s	$f2, 32($sp)
	mv.s	$f1, $f3
	sw	$ra, 36($sp)
	addi	$sp, $sp, 40
	jal	tan..6895
	addi	$sp, $sp, -40
	lw	$ra, 36($sp)
	lw.s	$f2, 32($sp)
	mul.s	$f2, $f1, $f2
	lw.s	$f1, 24($sp)
	lw.s	$f3, 0($sp)
	lw.s	$f4, 12($sp)
	lw	$8, 28($sp)
	lw	$9, 8($sp)
	lw	$10, 4($sp)
	j	calc_dirvec..7354
ble_then.30069:
	mul.s	$f3, $f1, $f1
	mul.s	$f4, $f2, $f2
	add.s	$f3, $f3, $f4
	lui.s	$f4, 0x3f80	# 1.000000の上位16ビット
	add.s	$f3, $f3, $f4
	sqrt.s	$f3, $f3
	inv.s	$f4, $f3
	mul.s	$f1, $f1, $f4
	inv.s	$f4, $f3
	mul.s	$f2, $f2, $f4
	inv.s	$f3, $f3
	sll	$8, $9, 2
	addi	$8, $8, 748
	lw	$8, 0($8)
	sll	$9, $10, 2
	add	$9, $8, $9
	lw	$9, 0($9)
	lw	$9, 0($9)
	mv	$11, $9
	sw.s	$f1, 0($11)
	addi	$11, $9, 4
	sw.s	$f2, 0($11)
	addi	$9, $9, 8
	sw.s	$f3, 0($9)
	addi	$9, $10, 40
	sll	$9, $9, 2
	add	$9, $8, $9
	lw	$9, 0($9)
	lw	$9, 0($9)
	neg.s	$f4, $f2
	mv	$11, $9
	sw.s	$f1, 0($11)
	addi	$11, $9, 4
	sw.s	$f3, 0($11)
	addi	$9, $9, 8
	sw.s	$f4, 0($9)
	addi	$9, $10, 80
	sll	$9, $9, 2
	add	$9, $8, $9
	lw	$9, 0($9)
	lw	$9, 0($9)
	neg.s	$f4, $f1
	neg.s	$f5, $f2
	mv	$11, $9
	sw.s	$f3, 0($11)
	addi	$11, $9, 4
	sw.s	$f4, 0($11)
	addi	$9, $9, 8
	sw.s	$f5, 0($9)
	addi	$9, $10, 1
	sll	$9, $9, 2
	add	$9, $8, $9
	lw	$9, 0($9)
	lw	$9, 0($9)
	neg.s	$f4, $f1
	neg.s	$f5, $f2
	neg.s	$f6, $f3
	mv	$11, $9
	sw.s	$f4, 0($11)
	addi	$11, $9, 4
	sw.s	$f5, 0($11)
	addi	$9, $9, 8
	sw.s	$f6, 0($9)
	addi	$9, $10, 41
	sll	$9, $9, 2
	add	$9, $8, $9
	lw	$9, 0($9)
	lw	$9, 0($9)
	neg.s	$f4, $f1
	neg.s	$f5, $f3
	mv	$11, $9
	sw.s	$f4, 0($11)
	addi	$11, $9, 4
	sw.s	$f5, 0($11)
	addi	$9, $9, 8
	sw.s	$f2, 0($9)
	addi	$9, $10, 81
	sll	$9, $9, 2
	add	$8, $8, $9
	lw	$8, 0($8)
	lw	$8, 0($8)
	neg.s	$f3, $f3
	mv	$9, $8
	sw.s	$f3, 0($9)
	addi	$9, $8, 4
	sw.s	$f1, 0($9)
	addi	$8, $8, 8
	sw.s	$f2, 0($8)
	jr	$ra
calc_dirvecs..7362:
	ble	$0, $8, ble_then.30071
	jr	$ra
ble_then.30071:
	itof	$f2, $8
	lui.s	$f3, 0x3e4c	# 0.200000の上位16ビット
	lli.s	$f3, 0xcccd	# 0.200000の下位16ビット
	mul.s	$f2, $f2, $f3
	lui.s	$f3, 0x3f66	# 0.900000の上位16ビット
	lli.s	$f3, 0x6666	# 0.900000の下位16ビット
	sub.s	$f3, $f2, $f3
	li	$11, 0
	lui.s	$f2, 0x0	# 0.000000の上位16ビット
	lui.s	$f4, 0x0	# 0.000000の上位16ビット
	sw.s	$f1, 0($sp)
	sw	$9, 4($sp)
	sw	$10, 8($sp)
	sw	$8, 12($sp)
	mv	$8, $11
	mv.s	$f63, $f4
	mv.s	$f4, $f1
	mv.s	$f1, $f2
	mv.s	$f2, $f63
	sw	$ra, 16($sp)
	addi	$sp, $sp, 20
	jal	calc_dirvec..7354
	addi	$sp, $sp, -20
	lw	$ra, 16($sp)
	lw	$8, 12($sp)
	itof	$f1, $8
	lui.s	$f2, 0x3e4c	# 0.200000の上位16ビット
	lli.s	$f2, 0xcccd	# 0.200000の下位16ビット
	mul.s	$f1, $f1, $f2
	lui.s	$f2, 0x3dcc	# 0.100000の上位16ビット
	lli.s	$f2, 0xcccd	# 0.100000の下位16ビット
	add.s	$f3, $f1, $f2
	li	$9, 0
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	lui.s	$f2, 0x0	# 0.000000の上位16ビット
	lw	$10, 8($sp)
	addi	$11, $10, 2
	lw.s	$f4, 0($sp)
	lw	$12, 4($sp)
	mv	$10, $11
	mv	$8, $9
	mv	$9, $12
	sw	$ra, 16($sp)
	addi	$sp, $sp, 20
	jal	calc_dirvec..7354
	addi	$sp, $sp, -20
	lw	$ra, 16($sp)
	lw	$8, 12($sp)
	addi	$8, $8, -1
	lw	$9, 4($sp)
	addi	$9, $9, 1
	ble	$5, $9, ble_then.30073
	j	ble_cont.30074
ble_then.30073:
	addi	$9, $9, -5
ble_cont.30074:
	lw.s	$f1, 0($sp)
	lw	$10, 8($sp)
	j	calc_dirvecs..7362
calc_dirvec_rows..7367:
	ble	$0, $8, ble_then.30075
	jr	$ra
ble_then.30075:
	itof	$f1, $8
	lui.s	$f2, 0x3e4c	# 0.200000の上位16ビット
	lli.s	$f2, 0xcccd	# 0.200000の下位16ビット
	mul.s	$f1, $f1, $f2
	lui.s	$f2, 0x3f66	# 0.900000の上位16ビット
	lli.s	$f2, 0x6666	# 0.900000の下位16ビット
	sub.s	$f1, $f1, $f2
	li	$11, 4
	sw	$10, 0($sp)
	sw	$9, 4($sp)
	sw	$8, 8($sp)
	mv	$8, $11
	sw	$ra, 12($sp)
	addi	$sp, $sp, 16
	jal	calc_dirvecs..7362
	addi	$sp, $sp, -16
	lw	$ra, 12($sp)
	lw	$8, 8($sp)
	addi	$8, $8, -1
	lw	$9, 4($sp)
	addi	$9, $9, 2
	ble	$5, $9, ble_then.30077
	j	ble_cont.30078
ble_then.30077:
	addi	$9, $9, -5
ble_cont.30078:
	lw	$10, 0($sp)
	addi	$10, $10, 4
	j	calc_dirvec_rows..7367
create_dirvec_elements..7373:
	ble	$0, $9, ble_then.30079
	jr	$ra
ble_then.30079:
	li	$10, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$11, $gp
	sw	$8, 0($sp)
	sw	$9, 4($sp)
	sw	$11, 8($sp)
	mv	$8, $10
	sw	$ra, 12($sp)
	addi	$sp, $sp, 16
	jal	create_float_array_loop
	addi	$sp, $sp, -16
	lw	$ra, 12($sp)
	lw	$8, 8($sp)
	mv	$9, $8
	li	$8, 32
	lw	$8, 0($8)
	mv	$10, $gp
	sw	$9, 12($sp)
	sw	$10, 16($sp)
	sw	$ra, 20($sp)
	addi	$sp, $sp, 24
	jal	create_array_loop
	addi	$sp, $sp, -24
	lw	$ra, 20($sp)
	lw	$8, 16($sp)
	mv	$9, $gp
	addi	$gp, $gp, 8
	sw	$8, 4($9)
	lw	$8, 12($sp)
	sw	$8, 0($9)
	mv	$8, $9
	lw	$9, 4($sp)
	sll	$10, $9, 2
	lw	$11, 0($sp)
	add	$10, $11, $10
	sw	$8, 0($10)
	addi	$9, $9, -1
	mv	$8, $11
	j	create_dirvec_elements..7373
create_dirvecs..7376:
	ble	$0, $8, ble_then.30081
	jr	$ra
ble_then.30081:
	li	$9, 120
	li	$10, 3
	lui.s	$f1, 0x0	# 0.000000の上位16ビット
	mv	$11, $gp
	sw	$8, 0($sp)
	sw	$9, 4($sp)
	sw	$11, 8($sp)
	mv	$8, $10
	sw	$ra, 12($sp)
	addi	$sp, $sp, 16
	jal	create_float_array_loop
	addi	$sp, $sp, -16
	lw	$ra, 12($sp)
	lw	$8, 8($sp)
	mv	$9, $8
	li	$8, 32
	lw	$8, 0($8)
	mv	$10, $gp
	sw	$9, 12($sp)
	sw	$10, 16($sp)
	sw	$ra, 20($sp)
	addi	$sp, $sp, 24
	jal	create_array_loop
	addi	$sp, $sp, -24
	lw	$ra, 20($sp)
	lw	$8, 16($sp)
	mv	$9, $gp
	addi	$gp, $gp, 8
	sw	$8, 4($9)
	lw	$8, 12($sp)
	sw	$8, 0($9)
	mv	$8, $gp
	lw	$10, 4($sp)
	sw	$8, 20($sp)
	mv	$8, $10
	sw	$ra, 24($sp)
	addi	$sp, $sp, 28
	jal	create_array_loop
	addi	$sp, $sp, -28
	lw	$ra, 24($sp)
	lw	$8, 20($sp)
	lw	$9, 0($sp)
	sll	$10, $9, 2
	addi	$10, $10, 748
	sw	$8, 0($10)
	sll	$8, $9, 2
	addi	$8, $8, 748
	lw	$8, 0($8)
	li	$10, 118
	mv	$9, $10
	sw	$ra, 24($sp)
	addi	$sp, $sp, 28
	jal	create_dirvec_elements..7373
	addi	$sp, $sp, -28
	lw	$ra, 24($sp)
	lw	$8, 0($sp)
	addi	$8, $8, -1
	j	create_dirvecs..7376
init_dirvec_constants..7378:
	ble	$0, $9, ble_then.30083
	jr	$ra
ble_then.30083:
	sll	$10, $9, 2
	add	$10, $8, $10
	lw	$10, 0($10)
	li	$11, 32
	lw	$11, 0($11)
	addi	$11, $11, -1
	sw	$8, 0($sp)
	sw	$9, 4($sp)
	mv	$9, $11
	mv	$8, $10
	sw	$ra, 8($sp)
	addi	$sp, $sp, 12
	jal	iter_setup_dirvec_constants..7162
	addi	$sp, $sp, -12
	lw	$ra, 8($sp)
	lw	$8, 4($sp)
	addi	$9, $8, -1
	lw	$8, 0($sp)
	j	init_dirvec_constants..7378
init_vecset_constants..7381:
	ble	$0, $8, ble_then.30085
	jr	$ra
ble_then.30085:
	sll	$9, $8, 2
	addi	$9, $9, 748
	lw	$9, 0($9)
	li	$10, 119
	sw	$8, 0($sp)
	mv	$8, $9
	mv	$9, $10
	sw	$ra, 4($sp)
	addi	$sp, $sp, 8
	jal	init_dirvec_constants..7378
	addi	$sp, $sp, -8
	lw	$ra, 4($sp)
	lw	$8, 0($sp)
	addi	$8, $8, -1
	j	init_vecset_constants..7381
